[
  {
    "name": "Ardent Plea",
    "set_name": "Alara Reborn",
    "collector_num": "1",
    "illustrator": "Chippy",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "1WU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Exalted (Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.)",
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 185054,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Aven Mimeomancer",
    "set_name": "Alara Reborn",
    "collector_num": "2",
    "illustrator": "Jesper Ejsing",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Bird",
      "Wizard"
    ],
    "rarity": "Rare",
    "mana_cost": "1WU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying",
      "At the beginning of your upkeep, you may put a feather counter on target creature. If you do, that creature has base power and toughness 3/1 and has flying for as long as it has a feather counter on it."
    ],
    "flavor_text": "\"If the skies are our only refuge, I will see all of us take wing.\"",
    "power": "3",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 180608,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If the second ability affects a creature, it doesn’t cause that creature to lose any of its abilities. It just gives that creature flying as well."
      },
      {
        "date": "5/1/2009",
        "text": "The affected creature remains 3/1 and has flying as long as it has a feather counter on it. The effect continues even if Aven Mimeomancer leaves the battlefield."
      },
      {
        "date": "5/1/2009",
        "text": "You may put a feather counter on a creature that already has a feather counter on it. Doing so has no visible effect unless some other effect has changed the creature’s power or toughness, or caused it to lose flying, since the last feather counter was put on it."
      },
      {
        "date": "5/1/2009",
        "text": "If all feather counters on a creature are moved to a different creature, the ability doesn’t follow them. The first creature stops being affected by the ability because it no longer has a feather counter on it. The second creature is not affected by the ability because Aven Mimeomancer didn’t target it."
      },
      {
        "date": "10/1/2009",
        "text": "The effect from the ability overwrites other effects that set power and/or toughness if and only if those effects existed before the ability resolved. It will not overwrite effects that modify power or toughness (whether from a static ability, counters, or a resolved spell or ability), nor will it overwrite effects that set power and toughness which come into existence after the ability resolves. Effects that switch the creature’s power and toughness are always applied after any other power or toughness changing effects, including this one, regardless of the order in which they are created."
      }
    ]
  },
  {
    "name": "Ethercaste Knight",
    "set_name": "Alara Reborn",
    "collector_num": "3",
    "illustrator": "Steven Belledin",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Knight"
    ],
    "rarity": "Common",
    "mana_cost": "WU",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Exalted (Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.)"
    ],
    "flavor_text": "\"We coat ourselves in steel every day. What is etherium but the next logical step?\"",
    "power": "1",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 179542,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Ethersworn Shieldmage",
    "set_name": "Alara Reborn",
    "collector_num": "4",
    "illustrator": "Daarken",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Vedalken",
      "Wizard"
    ],
    "rarity": "Common",
    "mana_cost": "1WU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flash",
      "When Ethersworn Shieldmage enters the battlefield, prevent all damage that would be dealt to artifact creatures this turn."
    ],
    "flavor_text": "\"See, children of metal? Already your bodies are rejecting harm. Continue on our path, and perfection will be yours.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179578,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "When Ethersworn Shieldmage’s triggered ability resolves, it doesn’t lock in which permanents will be affected. For the rest of the turn, any time damage would be dealt to a permanent, check whether it’s an artifact creature at that time. If it is, that damage is prevented."
      }
    ]
  },
  {
    "name": "Fieldmist Borderpost",
    "set_name": "Alara Reborn",
    "collector_num": "5",
    "illustrator": "Michael Bruinsma",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1WU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "You may pay {1} and return a basic land you control to its owner's hand rather than pay this spell's mana cost.",
      "Fieldmist Borderpost enters the battlefield tapped.",
      "{T}: Add {W} or {U}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 183005,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Casting this card by paying its alternative cost doesn’t change when you can cast it. You can cast it only at the normal time you could cast an artifact spell. It also doesn’t change the spell’s mana cost or converted mana cost. The only difference is the cost you actually pay."
      },
      {
        "date": "5/1/2009",
        "text": "Effects that increase or reduce the cost to cast this card will apply to whichever cost you chose to pay."
      },
      {
        "date": "5/1/2009",
        "text": "To satisfy the alternative cost, you may return any basic land you control to its owner’s hand, regardless of that land’s subtype or whether it’s tapped."
      },
      {
        "date": "5/1/2009",
        "text": "As you cast a spell, you get a chance to activate mana abilities before you pay that spell’s costs. Therefore, you may tap a basic land for mana, then both spend that mana and return that land to your hand to pay this card’s alternative cost. (Of course, you can return a different basic land instead.)"
      }
    ]
  },
  {
    "name": "Filigree Angel",
    "set_name": "Alara Reborn",
    "collector_num": "6",
    "illustrator": "Richard Whitters",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Angel"
    ],
    "rarity": "Rare",
    "mana_cost": "5WWU",
    "converted_mana_cost": 8,
    "oracle_text": [
      "Flying",
      "When Filigree Angel enters the battlefield, you gain 3 life for each artifact you control."
    ],
    "flavor_text": "\"I craved enlightenment, and Crucius's etherium opened my eyes. I would share my sight with you, but first you must believe.\"",
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 188965,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Filigree Angel’s enters-the-battlefield ability counts Filigree Angel itself, assuming that it’s still on the battlefield and still an artifact by the time the ability resolves."
      }
    ]
  },
  {
    "name": "Glassdust Hulk",
    "set_name": "Alara Reborn",
    "collector_num": "7",
    "illustrator": "Franz Vohwinkel",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Golem"
    ],
    "rarity": "Common",
    "mana_cost": "3WU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Whenever another artifact enters the battlefield under your control, Glassdust Hulk gets +1/+1 until end of turn and can't be blocked this turn.",
      "Cycling {W/U} ({W/U}, Discard this card: Draw a card.)"
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 179576,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      }
    ]
  },
  {
    "name": "Meddling Mage",
    "set_name": "Alara Reborn",
    "collector_num": "8",
    "illustrator": "Todd Lockwood",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Rare",
    "mana_cost": "WU",
    "converted_mana_cost": 2,
    "oracle_text": [
      "As Meddling Mage enters the battlefield, choose a nonland card name.",
      "Spells with the chosen name can't be cast."
    ],
    "flavor_text": "\"This violent wasteland is an indictment of its people. These cowards lack the will to oppose disorder.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179547,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "No one can cast spells or activate abilities between the time a card is named and the time that Meddling Mage’s ability starts to work."
      },
      {
        "date": "5/1/2009",
        "text": "Spells with the chosen name that somehow happen to already be on the stack when Meddling Mage enters the battlefield are not affected by Meddling Mage’s ability."
      },
      {
        "date": "5/1/2009",
        "text": "Although the named card can’t be cast, it can still be put onto the battlefield by a spell or ability (if it’s a permanent card)."
      },
      {
        "date": "5/1/2009",
        "text": "You can name either half of a split card, but not both. If you do so, that half (and both halves, if the split card has fuse) can’t be cast. The other half is unaffected."
      },
      {
        "date": "5/1/2009",
        "text": "If a card with morph is named, that card may still be cast face down. Face-down cards have no names."
      },
      {
        "date": "5/1/2009",
        "text": "Once Meddling Mage leaves the battlefield, the named card can be cast again."
      }
    ]
  },
  {
    "name": "Offering to Asha",
    "set_name": "Alara Reborn",
    "collector_num": "9",
    "illustrator": "Daarken",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "2WU",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Counter target spell unless its controller pays {4}. You gain 4 life."
    ],
    "flavor_text": "\"His body belongs to Bant now. His soul? I honestly don't know. I expect it belongs to the angels.\"\n—Rafiq of the Many",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 183007,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You gain 4 life whether or not the targeted spell’s controller pays {4} and whether or not the targeted spell is countered."
      }
    ]
  },
  {
    "name": "Sanctum Plowbeast",
    "set_name": "Alara Reborn",
    "collector_num": "10",
    "illustrator": "Anthony Francisco",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Common",
    "mana_cost": "4WU",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Defender",
      "Plainscycling {2}, islandcycling {2} ({2}, Discard this card: Search your library for a Plains or Island card, reveal it, put it into your hand, then shuffle your library.)"
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 144282,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Unlike the normal cycling ability, landcycling doesn’t allow you to draw a card. Instead, it lets you search your library for a land card of the specified land type, reveal it, put it into your hand, then shuffle your library."
      },
      {
        "date": "5/1/2009",
        "text": "Landcycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on a card being landcycled. Any ability that stops a cycling ability from being activated also stops a landcycling ability from being activated."
      },
      {
        "date": "5/1/2009",
        "text": "You can choose to find any card with the appropriate land type, including nonbasic lands. You can also choose not to find a card, even if there is a land card with the appropriate type in your library."
      },
      {
        "date": "5/1/2009",
        "text": "A landcycling ability lets you search for any card in your library with the stated land type. It doesn’t have to be a basic land."
      },
      {
        "date": "5/1/2009",
        "text": "You may only activate one landcycling ability at a time. You must specify which landcycling ability you are activating as you cycle this card, not as the ability resolves."
      }
    ]
  },
  {
    "name": "Shield of the Righteous",
    "set_name": "Alara Reborn",
    "collector_num": "11",
    "illustrator": "David Palumbo",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [
      "Equipment"
    ],
    "rarity": "Uncommon",
    "mana_cost": "WU",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Equipped creature gets +0/+2 and has vigilance.",
      "Whenever equipped creature blocks a creature, that creature doesn't untap during its controller's next untap step.",
      "Equip {2}"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 185063,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "When the equipped creature blocks a creature, Shield of the Righteous’s second ability doesn’t tap the blocked creature (in case it happens to be untapped due to vigilance, for example). It just causes that creature to not untap during its controller’s next untap step."
      },
      {
        "date": "5/1/2009",
        "text": "If the blocked creature is already untapped at the time its controller’s next untap step begins, this ability has no effect. It won’t apply at some later time when that creature is tapped."
      },
      {
        "date": "5/1/2009",
        "text": "Shield of the Righteous’s second ability doesn’t track the blocked creature’s controller. If that creature changes controllers before its old controller’s next untap step, this ability will prevent it from untapping during its new controller’s next untap step."
      }
    ]
  },
  {
    "name": "Sovereigns of Lost Alara",
    "set_name": "Alara Reborn",
    "collector_num": "12",
    "illustrator": "Donato Giancola",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Spirit"
    ],
    "rarity": "Rare",
    "mana_cost": "4WU",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Exalted (Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.)",
      "Whenever a creature you control attacks alone, you may search your library for an Aura card that could enchant that creature, put it onto the battlefield attached to that creature, then shuffle your library."
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 180600,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Any Aura card you find with Sovereigns of Lost Alara’s second ability must be able to enchant the attacking creature as it currently exists. You need to check the Aura’s enchant ability as well as any effects, such as protection, that would make it illegal to attach that Aura to the attacking creature. For example, if the attacking creature were an artifact creature with protection from blue, you could find an Aura with “enchant artifact,” but you could not find a blue Aura."
      },
      {
        "date": "5/1/2009",
        "text": "If you choose to search your library but no applicable Aura card is left in your deck (or you choose not to find one), then nothing enters the battlefield and you simply shuffle your library."
      },
      {
        "date": "5/1/2009",
        "text": "The attacking creature is not targeted by either this ability or the Aura, so a creature with shroud can be enchanted this way."
      },
      {
        "date": "5/1/2009",
        "text": "If the attacking creature has left the battlefield by the time Sovereigns of Lost Alara’s second ability resolves, you can’t put an Aura onto the battlefield this way. You may still choose to search your library just to shuffle it."
      },
      {
        "date": "12/7/2018",
        "text": "Any Aura card you find with Sovereigns of Lost Alara’s second ability must be able to enchant the attacking creature as it currently exists. You need to check the Aura’s enchant ability as well as any effects, such as protection, that would make it illegal to attach that Aura to the attacking creature. For example, if the attacking creature were an artifact creature with protection from blue, you could find an Aura with “enchant artifact,” but you could not find a blue Aura."
      },
      {
        "date": "12/7/2018",
        "text": "If you choose to search your library but no applicable Aura card is left in your library (or you choose not to find one), then nothing enters the battlefield and you simply shuffle your library."
      },
      {
        "date": "12/7/2018",
        "text": "If the attacking creature has left the battlefield by the time Sovereigns of Lost Alara’s second ability resolves, you can’t put an Aura onto the battlefield this way. You may still choose to search your library just to shuffle it."
      }
    ]
  },
  {
    "name": "Stormcaller's Boon",
    "set_name": "Alara Reborn",
    "collector_num": "13",
    "illustrator": "Brandon Kitkouski",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "2WU",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Sacrifice Stormcaller's Boon: Creatures you control gain flying until end of turn.",
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179534,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Talon Trooper",
    "set_name": "Alara Reborn",
    "collector_num": "14",
    "illustrator": "Matt Stewart",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Bird",
      "Scout"
    ],
    "rarity": "Common",
    "mana_cost": "1WU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying"
    ],
    "flavor_text": "\"The volcanic winds make a maze of the skies of Jund. If we mean to invade, we must first learn their invisible paths.\"",
    "power": "2",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 179537,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Unbender Tine",
    "set_name": "Alara Reborn",
    "collector_num": "15",
    "illustrator": "Greg Hildebrandt",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "2WU",
    "converted_mana_cost": 4,
    "oracle_text": [
      "{T}: Untap another target permanent."
    ],
    "flavor_text": "Creations made in madness may contain great power. The path to that power is as labyrinthine as the creator's mind.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 138217,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Wall of Denial",
    "set_name": "Alara Reborn",
    "collector_num": "16",
    "illustrator": "Howard Lyon",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Wall"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1WU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Defender, flying",
      "Shroud (This creature can't be the target of spells or abilities.)"
    ],
    "flavor_text": "It provides what every discerning mage requires—time to think.",
    "power": "0",
    "toughness": "8",
    "loyalty": null,
    "multiverse_id": 179601,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Architects of Will",
    "set_name": "Alara Reborn",
    "collector_num": "17",
    "illustrator": "Matt Stewart",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Common",
    "mana_cost": "2UB",
    "converted_mana_cost": 4,
    "oracle_text": [
      "When Architects of Will enters the battlefield, look at the top three cards of target player's library, then put them back in any order.",
      "Cycling {U/B} ({U/B}, Discard this card: Draw a card.)"
    ],
    "flavor_text": "This secret society of mages manipulates the beliefs and opinions of others.",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 179597,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      }
    ]
  },
  {
    "name": "Brainbite",
    "set_name": "Alara Reborn",
    "collector_num": "18",
    "illustrator": "Mark Hyzer",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "2UB",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Target opponent reveals their hand. You choose a card from it. That player discards that card.",
      "Draw a card."
    ],
    "flavor_text": "An Esper mage will leave a hole in your memory with surgical precision. A Grixis mage sees no reason to be so kind.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179607,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You may target an opponent who has no cards in hand."
      },
      {
        "date": "5/1/2009",
        "text": "When Brainbite resolves, you’ll draw a card even if the targeted opponent has no cards in hand."
      }
    ]
  },
  {
    "name": "Deny Reality",
    "set_name": "Alara Reborn",
    "collector_num": "19",
    "illustrator": "Jean-Sébastien Rossbach",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "3UB",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)",
      "Return target permanent to its owner's hand."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 185045,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Etherium Abomination",
    "set_name": "Alara Reborn",
    "collector_num": "20",
    "illustrator": "Mitch Cotie",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Horror"
    ],
    "rarity": "Common",
    "mana_cost": "3UB",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Unearth {1}{U}{B} ({1}{U}{B}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)"
    ],
    "flavor_text": "It was given life by the etherium of a hundred slain Esperites.",
    "power": "4",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 179573,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Illusory Demon",
    "set_name": "Alara Reborn",
    "collector_num": "21",
    "illustrator": "Nils Hamm",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Demon",
      "Illusion"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1UB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying",
      "When you cast a spell, sacrifice Illusory Demon."
    ],
    "flavor_text": "In the Maelstrom, a trick of the light can feast on human flesh.",
    "power": "4",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 179596,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If you cast a spell, the spell goes on the stack, then Illusory Demon’s triggered ability goes on the stack on top of it. The triggered ability will resolve (and you’ll sacrifice Illusory Demon) before the spell resolves."
      }
    ]
  },
  {
    "name": "Jhessian Zombies",
    "set_name": "Alara Reborn",
    "collector_num": "22",
    "illustrator": "Ash Wood",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie"
    ],
    "rarity": "Common",
    "mana_cost": "4UB",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Fear (This creature can't be blocked except by artifact creatures and/or black creatures.)",
      "Islandcycling {2}, swampcycling {2} ({2}, Discard this card: Search your library for an Island or Swamp card, reveal it, put it into your hand, then shuffle your library.)"
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 144286,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Unlike the normal cycling ability, landcycling doesn’t allow you to draw a card. Instead, it lets you search your library for a land card of the specified land type, reveal it, put it into your hand, then shuffle your library."
      },
      {
        "date": "5/1/2009",
        "text": "Landcycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on a card being landcycled. Any ability that stops a cycling ability from being activated also stops a landcycling ability from being activated."
      },
      {
        "date": "5/1/2009",
        "text": "You can choose to find any card with the appropriate land type, including nonbasic lands. You can also choose not to find a card, even if there is a land card with the appropriate type in your library."
      },
      {
        "date": "5/1/2009",
        "text": "A landcycling ability lets you search for any card in your library with the stated land type. It doesn’t have to be a basic land."
      },
      {
        "date": "5/1/2009",
        "text": "You may only activate one landcycling ability at a time. You must specify which landcycling ability you are activating as you cycle this card, not as the ability resolves."
      }
    ]
  },
  {
    "name": "Kathari Remnant",
    "set_name": "Alara Reborn",
    "collector_num": "23",
    "illustrator": "Anthony S. Waters",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Bird",
      "Skeleton"
    ],
    "rarity": "Uncommon",
    "mana_cost": "2UB",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Flying",
      "{B}: Regenerate Kathari Remnant.",
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"
    ],
    "flavor_text": null,
    "power": "0",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 185060,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Lich Lord of Unx",
    "set_name": "Alara Reborn",
    "collector_num": "24",
    "illustrator": "Dave Allsop",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Wizard"
    ],
    "rarity": "Rare",
    "mana_cost": "1UB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "{U}{B}, {T}: Create a 1/1 blue and black Zombie Wizard creature token.",
      "{U}{U}{B}{B}: Target player loses X life and puts the top X cards of their library into their graveyard, where X is the number of Zombies you control."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179555,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The second ability counts all Zombies you control, not just the tokens put onto the battlefield with the first ability. It will count Lich Lord of Unx itself if it’s still under your control and still a Zombie when the ability resolves."
      }
    ]
  },
  {
    "name": "Mask of Riddles",
    "set_name": "Alara Reborn",
    "collector_num": "25",
    "illustrator": "Matt Cavotta",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [
      "Equipment"
    ],
    "rarity": "Uncommon",
    "mana_cost": "UB",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Equipped creature has fear. (It can't be blocked except by artifact creatures and/or black creatures.)",
      "Whenever equipped creature deals combat damage to a player, you may draw a card.",
      "Equip {2}"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179584,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If a Mask of Riddles you control somehow winds up equipping a creature you don’t control, Mask of Riddles’s triggered ability will still trigger whenever that creature deals combat damage to a player (even if that player is you). You will control that ability, so you may draw a card."
      }
    ]
  },
  {
    "name": "Mind Funeral",
    "set_name": "Alara Reborn",
    "collector_num": "26",
    "illustrator": "rk post",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "1UB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Target opponent reveals cards from the top of their library until four land cards are revealed. That player puts all cards revealed this way into their graveyard."
    ],
    "flavor_text": "\"The soul is only as eternal as I say it is.\"\n—Sharuum the Hegemon",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179599,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The four land cards, as well as all the other cards revealed during this process, are put into the graveyard. If there aren’t four land cards left in the targeted opponent’s library, that player’s entire library is put into the graveyard."
      }
    ]
  },
  {
    "name": "Mistvein Borderpost",
    "set_name": "Alara Reborn",
    "collector_num": "27",
    "illustrator": "Pete Venters",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1UB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "You may pay {1} and return a basic land you control to its owner's hand rather than pay this spell's mana cost.",
      "Mistvein Borderpost enters the battlefield tapped.",
      "{T}: Add {U} or {B}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 161276,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Casting this card by paying its alternative cost doesn’t change when you can cast it. You can cast it only at the normal time you could cast an artifact spell. It also doesn’t change the spell’s mana cost or converted mana cost. The only difference is the cost you actually pay."
      },
      {
        "date": "5/1/2009",
        "text": "Effects that increase or reduce the cost to cast this card will apply to whichever cost you chose to pay."
      },
      {
        "date": "5/1/2009",
        "text": "To satisfy the alternative cost, you may return any basic land you control to its owner’s hand, regardless of that land’s subtype or whether it’s tapped."
      },
      {
        "date": "5/1/2009",
        "text": "As you cast a spell, you get a chance to activate mana abilities before you pay that spell’s costs. Therefore, you may tap a basic land for mana, then both spend that mana and return that land to your hand to pay this card’s alternative cost. (Of course, you can return a different basic land instead.)"
      }
    ]
  },
  {
    "name": "Nemesis of Reason",
    "set_name": "Alara Reborn",
    "collector_num": "28",
    "illustrator": "Mark Tedin",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Leviathan",
      "Horror"
    ],
    "rarity": "Rare",
    "mana_cost": "3UB",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Whenever Nemesis of Reason attacks, defending player puts the top ten cards of their library into their graveyard."
    ],
    "flavor_text": "Words describing it fail. Pages relating it shrivel. Tales recounting it end.",
    "power": "3",
    "toughness": "7",
    "loyalty": null,
    "multiverse_id": 188962,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If the defending player has fewer than ten cards in their library, that player’s entire library is put into their graveyard."
      }
    ]
  },
  {
    "name": "Soul Manipulation",
    "set_name": "Alara Reborn",
    "collector_num": "29",
    "illustrator": "Carl Critchlow",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1UB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Choose one or both —",
      "• Counter target creature spell.",
      "• Return target creature card from your graveyard to your hand."
    ],
    "flavor_text": "\"Birth and death are both reversible.\"\n—Nicol Bolas",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 183008,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You may choose just the first mode (targeting a creature spell), just the second mode (targeting a creature card in your graveyard), or both modes (targeting a creature spell and a creature card in your graveyard). You can’t choose a mode unless there’s a legal target for it."
      },
      {
        "date": "5/1/2009",
        "text": "If you choose both modes, you choose their targets at the same time. You can’t counter your own creature spell and then return that card from your graveyard to your hand."
      }
    ]
  },
  {
    "name": "Soulquake",
    "set_name": "Alara Reborn",
    "collector_num": "30",
    "illustrator": "Warren Mahy",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "3UUBB",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Return all creatures on the battlefield and all creature cards in graveyards to their owners' hands."
    ],
    "flavor_text": "The Maelstrom sent a wave of raw mana through the battlefield, carrying off the fighting and fallen alike.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179409,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Time Sieve",
    "set_name": "Alara Reborn",
    "collector_num": "31",
    "illustrator": "Franz Vohwinkel",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "UB",
    "converted_mana_cost": 2,
    "oracle_text": [
      "{T}, Sacrifice five artifacts: Take an extra turn after this one."
    ],
    "flavor_text": "\"I pray that I am never considered useless or old.\"\n—Sharuum the Hegemon",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 189649,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "One of the five artifacts you sacrifice may be Time Sieve itself."
      }
    ]
  },
  {
    "name": "Vedalken Ghoul",
    "set_name": "Alara Reborn",
    "collector_num": "32",
    "illustrator": "Dave Kendall",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Vedalken",
      "Zombie"
    ],
    "rarity": "Common",
    "mana_cost": "UB",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Whenever Vedalken Ghoul becomes blocked, defending player loses 4 life."
    ],
    "flavor_text": "For four nights following Ennor's death and the reclaiming of his etherium, its recipients were found slain, the etherium ripped from their bodies.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 183010,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Anathemancer",
    "set_name": "Alara Reborn",
    "collector_num": "33",
    "illustrator": "Richard Whitters",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Wizard"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1BR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "When Anathemancer enters the battlefield, it deals damage to target player equal to the number of nonbasic lands that player controls.",
      "Unearth {5}{B}{R} ({5}{B}{R}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)"
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179538,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Bituminous Blast",
    "set_name": "Alara Reborn",
    "collector_num": "34",
    "illustrator": "Raymond Swanland",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "3BR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)",
      "Bituminous Blast deals 4 damage to target creature."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 185057,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Breath of Malfegor",
    "set_name": "Alara Reborn",
    "collector_num": "35",
    "illustrator": "Vance Kovacs",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "3BR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Breath of Malfegor deals 5 damage to each opponent."
    ],
    "flavor_text": "The blood of the demons quickened as their master rose over the battlefield. The blood of the angels also quickened: here was the chance to finally end the war started millennia ago.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 161291,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Deathbringer Thoctar",
    "set_name": "Alara Reborn",
    "collector_num": "36",
    "illustrator": "Karl Kopinski",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Beast"
    ],
    "rarity": "Rare",
    "mana_cost": "4BR",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Whenever another creature dies, you may put a +1/+1 counter on Deathbringer Thoctar.",
      "Remove a +1/+1 counter from Deathbringer Thoctar: It deals 1 damage to any target."
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 180622,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If Deathbringer Thoctar and another creature are dealt lethal damage at the same time, Deathbringer Thoctar will be put into a graveyard before it would receive any counters. Its ability will still trigger, but it will do nothing when it resolves."
      },
      {
        "date": "5/1/2009",
        "text": "You may remove any +1/+1 counter from Deathbringer Thoctar to activate its second ability, not just a +1/+1 counter put on it with its first ability."
      }
    ]
  },
  {
    "name": "Defiler of Souls",
    "set_name": "Alara Reborn",
    "collector_num": "37",
    "illustrator": "Paul Bonner",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Demon"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3BBR",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Flying",
      "At the beginning of each player's upkeep, that player sacrifices a monocolored creature."
    ],
    "flavor_text": "\"Stray not into sin, lest you face the doorman of an insatiable tomb.\"\n—Prayer of Asha",
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 189646,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Demonic Dread",
    "set_name": "Alara Reborn",
    "collector_num": "38",
    "illustrator": "Thomas M. Baxa",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1BR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)",
      "Target creature can't block this turn."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 185062,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Demonspine Whip",
    "set_name": "Alara Reborn",
    "collector_num": "39",
    "illustrator": "Mark Hyzer",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [
      "Equipment"
    ],
    "rarity": "Uncommon",
    "mana_cost": "BR",
    "converted_mana_cost": 2,
    "oracle_text": [
      "{X}: Equipped creature gets +X/+0 until end of turn.",
      "Equip {1}"
    ],
    "flavor_text": "Using a spine to break a slave's back appeals to the Grixis sense of irony.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180311,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "When the first ability resolves, the +X/+0 bonus is given to the creature that Demonspine Whip is attached to at that time, regardless of what creature (if any) it was attached to when the ability was activated. If Demonspine Whip is on the battlefield but not attached to a creature at this time, no creature gets the bonus."
      },
      {
        "date": "5/1/2009",
        "text": "Once Demonspine Whip’s ability resolves and gives the +X/+0 bonus to a creature, that bonus stays with that creature for the rest of the turn even if Demonspine Whip moves to another creature or leaves the battlefield."
      },
      {
        "date": "5/1/2009",
        "text": "If Demonspine Whip is no longer on the battlefield by the time its first ability resolves, the game checks whether it was attached to a creature at the time it left the battlefield. If it was, that creature gets the +X/+0 bonus. If it wasn’t, no creature gets the bonus."
      }
    ]
  },
  {
    "name": "Igneous Pouncer",
    "set_name": "Alara Reborn",
    "collector_num": "40",
    "illustrator": "Chippy",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Common",
    "mana_cost": "4BR",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Haste",
      "Swampcycling {2}, mountaincycling {2} ({2}, Discard this card: Search your library for a Swamp or Mountain card, reveal it, put it into your hand, then shuffle your library.)"
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 144276,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Unlike the normal cycling ability, landcycling doesn’t allow you to draw a card. Instead, it lets you search your library for a land card of the specified land type, reveal it, put it into your hand, then shuffle your library."
      },
      {
        "date": "5/1/2009",
        "text": "Landcycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on a card being landcycled. Any ability that stops a cycling ability from being activated also stops a landcycling ability from being activated."
      },
      {
        "date": "5/1/2009",
        "text": "You can choose to find any card with the appropriate land type, including nonbasic lands. You can also choose not to find a card, even if there is a land card with the appropriate type in your library."
      },
      {
        "date": "5/1/2009",
        "text": "A landcycling ability lets you search for any card in your library with the stated land type. It doesn’t have to be a basic land."
      },
      {
        "date": "5/1/2009",
        "text": "You may only activate one landcycling ability at a time. You must specify which landcycling ability you are activating as you cycle this card, not as the ability resolves."
      }
    ]
  },
  {
    "name": "Kathari Bomber",
    "set_name": "Alara Reborn",
    "collector_num": "41",
    "illustrator": "Carl Critchlow",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Bird",
      "Shaman"
    ],
    "rarity": "Common",
    "mana_cost": "1BR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying",
      "When Kathari Bomber deals combat damage to a player, create two 1/1 red Goblin creature tokens and sacrifice Kathari Bomber.",
      "Unearth {3}{B}{R} ({3}{B}{R}: Return this card from your graveyard to the battlefield. It gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)"
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179602,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/14/2017",
        "text": "When Kathari Bomber’s triggered ability resolves, you create two Goblin tokens regardless of how much combat damage Kathari Bomber dealt to the player. You create the tokens even if you can’t sacrifice Kathari Bomber."
      }
    ]
  },
  {
    "name": "Lightning Reaver",
    "set_name": "Alara Reborn",
    "collector_num": "42",
    "illustrator": "Cyril Van Der Haegen",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Beast"
    ],
    "rarity": "Rare",
    "mana_cost": "3BR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Haste; fear (This creature can't be blocked except by artifact creatures and/or black creatures.)",
      "Whenever Lightning Reaver deals combat damage to a player, put a charge counter on it.",
      "At the beginning of your end step, Lightning Reaver deals damage equal to the number of charge counters on it to each opponent."
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 180617,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Monstrous Carabid",
    "set_name": "Alara Reborn",
    "collector_num": "43",
    "illustrator": "Pete Venters",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Insect"
    ],
    "rarity": "Common",
    "mana_cost": "3BR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Monstrous Carabid attacks each combat if able.",
      "Cycling {B/R} ({B/R}, Discard this card: Draw a card.)"
    ],
    "flavor_text": "What happens when a plane of predators collides with four planes of prey?",
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 185051,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      }
    ]
  },
  {
    "name": "Sanity Gnawers",
    "set_name": "Alara Reborn",
    "collector_num": "44",
    "illustrator": "Pete Venters",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Rat"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1BR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "When Sanity Gnawers enters the battlefield, target player discards a card at random."
    ],
    "flavor_text": "The last thought to go through their victim's mind is the one they tear out through the scalp.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 179623,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Singe-Mind Ogre",
    "set_name": "Alara Reborn",
    "collector_num": "45",
    "illustrator": "Daarken",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Ogre",
      "Mutant"
    ],
    "rarity": "Common",
    "mana_cost": "2BR",
    "converted_mana_cost": 4,
    "oracle_text": [
      "When Singe-Mind Ogre enters the battlefield, target player reveals a card at random from their hand, then loses life equal to that card's converted mana cost."
    ],
    "flavor_text": "Even the balmgivers of Bant couldn't heal the incurables, but sharing their torment helped.",
    "power": "3",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179574,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Terminate",
    "set_name": "Alara Reborn",
    "collector_num": "46",
    "illustrator": "Wayne Reynolds",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "BR",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Destroy target creature. It can't be regenerated."
    ],
    "flavor_text": "\"I've seen death before. My mother succumbing to illness, my comrades bleeding on the battlefield . . . But I'd never seen anything as dreadful as that.\"\n—Taani, berserker of Etlan",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 176449,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Thought Hemorrhage",
    "set_name": "Alara Reborn",
    "collector_num": "47",
    "illustrator": "Chippy",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "2BR",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Choose a nonland card name. Target player reveals their hand. Thought Hemorrhage deals 3 damage to that player for each card with the chosen name revealed this way. Search that player's graveyard, hand, and library for all cards with that name and exile them. Then that player shuffles their library."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180596,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The card is named as Thought Hemorrhage resolves. Spells and abilities can’t be cast or activated between the time a card is named and the time that Thought Hemorrhage has the rest of its effect."
      },
      {
        "date": "5/1/2009",
        "text": "If the targeted player has multiple cards with the chosen name in their hand, the damage dealt by Thought Hemorrhage is all considered to be the same instance of damage. A single effect that prevents “the next time a source would deal damage,” for example, will prevent all of it."
      },
      {
        "date": "5/1/2009",
        "text": "Thought Hemorrhage has no effect on cards on the battlefield that have the same name as the named card."
      },
      {
        "date": "5/1/2009",
        "text": "The cards you’re searching for must be found if they’re in the graveyard, because that’s a zone everyone can see. Finding those cards in the hand and library is optional, though. This is true even though the targeted player has revealed their hand."
      },
      {
        "date": "2/1/2014",
        "text": "If you target yourself with this spell, you must reveal your entire hand to the other players just as any other player would."
      }
    ]
  },
  {
    "name": "Veinfire Borderpost",
    "set_name": "Alara Reborn",
    "collector_num": "48",
    "illustrator": "Ralph Horsley",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1BR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "You may pay {1} and return a basic land you control to its owner's hand rather than pay this spell's mana cost.",
      "Veinfire Borderpost enters the battlefield tapped.",
      "{T}: Add {B} or {R}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 189640,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Casting this card by paying its alternative cost doesn’t change when you can cast it. You can cast it only at the normal time you could cast an artifact spell. It also doesn’t change the spell’s mana cost or converted mana cost. The only difference is the cost you actually pay."
      },
      {
        "date": "5/1/2009",
        "text": "Effects that increase or reduce the cost to cast this card will apply to whichever cost you chose to pay."
      },
      {
        "date": "5/1/2009",
        "text": "To satisfy the alternative cost, you may return any basic land you control to its owner’s hand, regardless of that land’s subtype or whether it’s tapped."
      },
      {
        "date": "5/1/2009",
        "text": "As you cast a spell, you get a chance to activate mana abilities before you pay that spell’s costs. Therefore, you may tap a basic land for mana, then both spend that mana and return that land to your hand to pay this card’s alternative cost. (Of course, you can return a different basic land instead.)"
      }
    ]
  },
  {
    "name": "Blitz Hellion",
    "set_name": "Alara Reborn",
    "collector_num": "49",
    "illustrator": "Anthony S. Waters",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Hellion"
    ],
    "rarity": "Rare",
    "mana_cost": "3RG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Trample, haste",
      "At the beginning of the end step, Blitz Hellion's owner shuffles it into their library."
    ],
    "flavor_text": "Alarans commemorated its appearances with new holidays bearing names like the Great Cataclysm and the Fall of Ilson Gate.",
    "power": "7",
    "toughness": "7",
    "loyalty": null,
    "multiverse_id": 179406,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Blitz Hellion’s last ability triggers at the end of each turn in which it’s on the battlefield. If it’s not on the battlefield by the time this ability resolves, nothing happens. Blitz Hellion stays wherever it is, and its owner doesn’t shuffle their library."
      },
      {
        "date": "5/1/2009",
        "text": "A token that’s copying Blitz Hellion will be shuffled into its owner’s library when this ability resolves, then will cease to exist. For practical purposes, the token should not actually be put into the library, though the library is still shuffled."
      }
    ]
  },
  {
    "name": "Bloodbraid Elf",
    "set_name": "Alara Reborn",
    "collector_num": "50",
    "illustrator": "Dominick Domingo",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elf",
      "Berserker"
    ],
    "rarity": "Uncommon",
    "mana_cost": "2RG",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Haste",
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 185053,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Colossal Might",
    "set_name": "Alara Reborn",
    "collector_num": "51",
    "illustrator": "Justin Sweet",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "RG",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Target creature gets +4/+2 and gains trample until end of turn."
    ],
    "flavor_text": "\"Never corner a barbarian. You become the path of least resistance.\"\n—Sarkhan Vol",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179624,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Deadshot Minotaur",
    "set_name": "Alara Reborn",
    "collector_num": "52",
    "illustrator": "Jason Chan",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Minotaur"
    ],
    "rarity": "Common",
    "mana_cost": "3RG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "When Deadshot Minotaur enters the battlefield, it deals 3 damage to target creature with flying.",
      "Cycling {R/G} ({R/G}, Discard this card: Draw a card.)"
    ],
    "flavor_text": "\"May the earth rise up to meet you.\"",
    "power": "3",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 179543,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "5/1/2009",
        "text": "The enters-the-battlefield ability is mandatory. If you’re the only player who controls a creature with flying, you must target one of those creatures."
      }
    ]
  },
  {
    "name": "Dragon Broodmother",
    "set_name": "Alara Reborn",
    "collector_num": "53",
    "illustrator": "Jaime Jones",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Dragon"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2RRRG",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Flying",
      "At the beginning of each upkeep, create a 1/1 red and green Dragon creature token with flying and devour 2. (As the token enters the battlefield, you may sacrifice any number of creatures. It enters the battlefield with twice that many +1/+1 counters on it.)"
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 189648,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Putting a token creature with devour onto the battlefield works the same as putting any other creature with devour onto the battlefield. The token may devour Dragon Broodmother itself!"
      },
      {
        "date": "5/1/2009",
        "text": "In a Two-Headed Giant game, Dragon Broodmother’s second ability triggers only once at the beginning of each team’s upkeep, not once for each player. You’ll get one Dragon token at the beginning of your team’s upkeep and one Dragon token at the beginning of the opposing team’s upkeep."
      }
    ]
  },
  {
    "name": "Firewild Borderpost",
    "set_name": "Alara Reborn",
    "collector_num": "54",
    "illustrator": "Jean-Sébastien Rossbach",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1RG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "You may pay {1} and return a basic land you control to its owner's hand rather than pay this spell's mana cost.",
      "Firewild Borderpost enters the battlefield tapped.",
      "{T}: Add {R} or {G}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 188974,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Casting this card by paying its alternative cost doesn’t change when you can cast it. You can cast it only at the normal time you could cast an artifact spell. It also doesn’t change the spell’s mana cost or converted mana cost. The only difference is the cost you actually pay."
      },
      {
        "date": "5/1/2009",
        "text": "Effects that increase or reduce the cost to cast this card will apply to whichever cost you chose to pay."
      },
      {
        "date": "5/1/2009",
        "text": "To satisfy the alternative cost, you may return any basic land you control to its owner’s hand, regardless of that land’s subtype or whether it’s tapped."
      },
      {
        "date": "5/1/2009",
        "text": "As you cast a spell, you get a chance to activate mana abilities before you pay that spell’s costs. Therefore, you may tap a basic land for mana, then both spend that mana and return that land to your hand to pay this card’s alternative cost. (Of course, you can return a different basic land instead.)"
      }
    ]
  },
  {
    "name": "Godtracker of Jund",
    "set_name": "Alara Reborn",
    "collector_num": "55",
    "illustrator": "Justin Sweet",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elf",
      "Shaman"
    ],
    "rarity": "Common",
    "mana_cost": "1RG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Whenever a creature with power 5 or greater enters the battlefield under your control, you may put a +1/+1 counter on Godtracker of Jund."
    ],
    "flavor_text": "\"The behemoths are content to graze like cattle, while dragons rage and conquer. I know which example I'll follow.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 183994,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Gorger Wurm",
    "set_name": "Alara Reborn",
    "collector_num": "56",
    "illustrator": "Parente",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Wurm"
    ],
    "rarity": "Common",
    "mana_cost": "3RG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Devour 1 (As this enters the battlefield, you may sacrifice any number of creatures. This creature enters the battlefield with that many +1/+1 counters on it.)"
    ],
    "flavor_text": "In war-torn Alara, sometimes a wurm's gullet is the safest place to be.",
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 179561,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Mage Slayer",
    "set_name": "Alara Reborn",
    "collector_num": "57",
    "illustrator": "Lars Grant-West",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [
      "Equipment"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1RG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Whenever equipped creature attacks, it deals damage equal to its power to the player or planeswalker it's attacking.",
      "Equip {3}"
    ],
    "flavor_text": "\"When the wielder is strong enough, any sword will do.\"\n—Kresh the Bloodbraided",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179567,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "This ability triggers and resolves in the declare attackers step. The creature will still deal its combat damage as normal later on during the combat phase."
      },
      {
        "date": "5/1/2009",
        "text": "When the equipped creature attacks, the first ability will trigger. When that ability resolves, that creature will deal damage equal to its power to player or planeswalker it’s attacking, even if Mage Slayer has left the battlefield or is equipping a different creature by that time."
      }
    ]
  },
  {
    "name": "Predatory Advantage",
    "set_name": "Alara Reborn",
    "collector_num": "58",
    "illustrator": "Raymond Swanland",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "3RG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "At the beginning of each opponent's end step, if that player didn't cast a creature spell this turn, create a 2/2 green Lizard creature token."
    ],
    "flavor_text": "Those who forget their past are doomed to be eaten by it.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180602,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Predatory Advantage’s ability has an “intervening ‘if’ clause.” That means (1) the ability won’t trigger at all unless the opponent whose turn it is didn’t cast a creature spell that turn, and (2) the ability will do nothing unless the opponent whose turn it is still hasn’t cast a creature spell by the time it resolves."
      },
      {
        "date": "5/1/2009",
        "text": "Predatory Advantage checks whether a player cast a creature spell, not whether a creature entered the battlefield under that player’s control. If that player cast a creature spell but you countered it, for example, you won’t get a Lizard token that turn."
      },
      {
        "date": "5/1/2009",
        "text": "In a Two-Headed Giant game, Predatory Advantage’s ability triggers twice at the end of the opposing team’s turn: once for each player. If neither of those players cast a creature spell that turn, you’ll get two Lizards. If one of those players cast a creature spell but the other didn’t, you’ll get one Lizard."
      }
    ]
  },
  {
    "name": "Rhox Brute",
    "set_name": "Alara Reborn",
    "collector_num": "59",
    "illustrator": "Raymond Swanland",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Rhino",
      "Warrior"
    ],
    "rarity": "Common",
    "mana_cost": "2RG",
    "converted_mana_cost": 4,
    "oracle_text": [],
    "flavor_text": "\"In this new world, I have seen the once-devout rhoxes take up arms with the savages of Jund. I would be offended, but I see the wisdom in their choice.\"\n—Gernan, Dawnray archer",
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 189650,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Spellbreaker Behemoth",
    "set_name": "Alara Reborn",
    "collector_num": "60",
    "illustrator": "Jason Chan",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Rare",
    "mana_cost": "1RGG",
    "converted_mana_cost": 4,
    "oracle_text": [
      "This spell can't be countered.",
      "Creature spells you control with power 5 or greater can't be countered."
    ],
    "flavor_text": "\"Some think its immunity to countermagic evolved because of the constant mage attacks on Naya. I think it just ate a bunch of wizards.\"\n—Broka, drumhunter",
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 179551,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Any spells or abilities that would counter Spellbreaker Behemoth or (once it’s on the battlefield) a creature spell you control with power 5 or greater can still be cast or activated and will still resolve. They just won’t counter that spell. Any other effects they have will happen as normal."
      },
      {
        "date": "5/1/2009",
        "text": "Effects that affect a creature’s power (such as the one from Glorious Anthem, for example) apply only to creatures on the battlefield, not to creature spells on the stack."
      },
      {
        "date": "5/1/2009",
        "text": "If a creature card has “*” in its power, the ability that defines “*” works in all zones, including the stack."
      }
    ]
  },
  {
    "name": "Valley Rannet",
    "set_name": "Alara Reborn",
    "collector_num": "61",
    "illustrator": "Dave Allsop",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Common",
    "mana_cost": "4RG",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Mountaincycling {2}, forestcycling {2} ({2}, Discard this card: Search your library for a Mountain or Forest card, reveal it, put it into your hand, then shuffle your library.)"
    ],
    "flavor_text": null,
    "power": "6",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 144260,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Unlike the normal cycling ability, landcycling doesn’t allow you to draw a card. Instead, it lets you search your library for a land card of the specified land type, reveal it, put it into your hand, then shuffle your library."
      },
      {
        "date": "5/1/2009",
        "text": "Landcycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on a card being landcycled. Any ability that stops a cycling ability from being activated also stops a landcycling ability from being activated."
      },
      {
        "date": "5/1/2009",
        "text": "You can choose to find any card with the appropriate land type, including nonbasic lands. You can also choose not to find a card, even if there is a land card with the appropriate type in your library."
      },
      {
        "date": "5/1/2009",
        "text": "A landcycling ability lets you search for any card in your library with the stated land type. It doesn’t have to be a basic land."
      },
      {
        "date": "5/1/2009",
        "text": "You may only activate one landcycling ability at a time. You must specify which landcycling ability you are activating as you cycle this card, not as the ability resolves."
      }
    ]
  },
  {
    "name": "Vengeful Rebirth",
    "set_name": "Alara Reborn",
    "collector_num": "62",
    "illustrator": "Vance Kovacs",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "4RG",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Return target card from your graveyard to your hand. If you return a nonland card to your hand this way, Vengeful Rebirth deals damage equal to that card's converted mana cost to any target.",
      "Exile Vengeful Rebirth."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179628,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "You can return a land card to your hand with Vengeful Rebirth. It just won’t deal any damage to the target permanent or player if you do."
      },
      {
        "date": "12/7/2018",
        "text": "If the target permanent or player becomes an illegal target but the target card in your graveyard doesn’t, Vengeful Rebirth will still return that card from your graveyard to your hand, but it won’t deal any damage. Vengeful Rebirth will then be exiled."
      },
      {
        "date": "12/7/2018",
        "text": "If the target card in your graveyard becomes an illegal target but the target permanent or player doesn’t, Vengeful Rebirth won’t return that card to your hand and it won’t deal any damage (because you didn’t return a nonland card to your hand this way). Vengeful Rebirth will still be exiled."
      },
      {
        "date": "12/7/2018",
        "text": "If both targets are illegal, Vengeful Rebirth doesn’t resolve. It will be put into your graveyard."
      }
    ]
  },
  {
    "name": "Violent Outburst",
    "set_name": "Alara Reborn",
    "collector_num": "63",
    "illustrator": "Richard Whitters",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1RG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)",
      "Creatures you control get +1/+0 until end of turn."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 185056,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Vithian Renegades",
    "set_name": "Alara Reborn",
    "collector_num": "64",
    "illustrator": "rk post",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Shaman"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1RG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "When Vithian Renegades enters the battlefield, destroy target artifact."
    ],
    "flavor_text": "\"Here is the proof that what has been done may yet be undone. The hope we thought dead will be gloriously reborn.\"",
    "power": "3",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179535,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The enters-the-battlefield ability is mandatory. If you’re the only player who controls any artifacts, you must target one of them."
      }
    ]
  },
  {
    "name": "Behemoth Sledge",
    "set_name": "Alara Reborn",
    "collector_num": "65",
    "illustrator": "Steve Prescott",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [
      "Equipment"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1GW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Equipped creature gets +2/+2 and has trample and lifelink.",
      "Equip {3}"
    ],
    "flavor_text": "Those who worship the great gargantuans could hardly be expected to fight with a subtle weapon.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179545,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "multiple instances of lifelink on the same creature are redundant. If a creature with multiple instances of lifelink deals damage, its controller still only gains life equal to the damage dealt."
      }
    ]
  },
  {
    "name": "Captured Sunlight",
    "set_name": "Alara Reborn",
    "collector_num": "66",
    "illustrator": "Nils Hamm",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "2GW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)",
      "You gain 4 life."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 185064,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Dauntless Escort",
    "set_name": "Alara Reborn",
    "collector_num": "67",
    "illustrator": "Volkan Baga",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Rhino",
      "Soldier"
    ],
    "rarity": "Rare",
    "mana_cost": "1GW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Sacrifice Dauntless Escort: Creatures you control gain indestructible until end of turn."
    ],
    "flavor_text": "Elspeth's squires do not seek advancement. For them, no knightly glory could surpass the glory of serving their champion.",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 180614,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/1/2013",
        "text": "Once Dauntless Escort’s ability resolves, the set of creatures it affects is locked in. It won’t affect creatures that enter the battlefield after the ability has finished resolving."
      },
      {
        "date": "7/1/2013",
        "text": "If any creature leaves your control, it will retain indestructible."
      },
      {
        "date": "7/1/2013",
        "text": "Lethal damage and effects that say “destroy” won’t cause a creature with indestructible to be put into the graveyard. However, a creature with indestructible can be put into the graveyard for a number of reasons. The most likely reasons are if it’s sacrificed, if it’s legendary and another legendary creature with the same name is controlled by the same player, or if its toughness is 0 or less."
      }
    ]
  },
  {
    "name": "Enlisted Wurm",
    "set_name": "Alara Reborn",
    "collector_num": "68",
    "illustrator": "Steve Prescott",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Wurm"
    ],
    "rarity": "Uncommon",
    "mana_cost": "4GW",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"
    ],
    "flavor_text": "A match for any army—even its own.",
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 185047,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Grizzled Leotau",
    "set_name": "Alara Reborn",
    "collector_num": "69",
    "illustrator": "Lars Grant-West",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Cat"
    ],
    "rarity": "Common",
    "mana_cost": "GW",
    "converted_mana_cost": 2,
    "oracle_text": [],
    "flavor_text": "\"There is no glory in a death of age, as even the leotau know. As winter steals into their coats, they seek the deadliest lands, that they may die as they lived.\"\n—Aarsil the Blessed",
    "power": "1",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 189647,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Knight of New Alara",
    "set_name": "Alara Reborn",
    "collector_num": "70",
    "illustrator": "Chris Rahn",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Knight"
    ],
    "rarity": "Rare",
    "mana_cost": "2GW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Each other multicolored creature you control gets +1/+1 for each of its colors."
    ],
    "flavor_text": "\"I embrace all of Alara, Grixis as much as Bant. Let my former home call me traitor. I do this not for accolades, but because it is right.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 189642,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "For example, a white creature gets no bonus. A white and blue creature gets +2/+2. A white, blue, and black creature gets +3/+3, and so on."
      }
    ]
  },
  {
    "name": "Knotvine Paladin",
    "set_name": "Alara Reborn",
    "collector_num": "71",
    "illustrator": "Matt Stewart",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Knight"
    ],
    "rarity": "Rare",
    "mana_cost": "GW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Whenever Knotvine Paladin attacks, it gets +1/+1 until end of turn for each untapped creature you control."
    ],
    "flavor_text": "\"He is part of a new breed of guardian, one who embraces the best of both his world and ours.\"\n—Mayael the Anima",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 180624,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The number of untapped creatures you control is counted as the ability resolves, and the bonus is locked in at that time. By this point, other attacking creatures will already be tapped (unless they have vigilance)."
      }
    ]
  },
  {
    "name": "Leonin Armorguard",
    "set_name": "Alara Reborn",
    "collector_num": "72",
    "illustrator": "Steven Belledin",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Cat",
      "Soldier"
    ],
    "rarity": "Common",
    "mana_cost": "2GW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "When Leonin Armorguard enters the battlefield, creatures you control get +1/+1 until end of turn."
    ],
    "flavor_text": "Well suited are the nacatl to a coat of steel and forge-tempered claws.",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 180606,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Leonin Armorguard gets this bonus too."
      }
    ]
  },
  {
    "name": "Mycoid Shepherd",
    "set_name": "Alara Reborn",
    "collector_num": "73",
    "illustrator": "Trevor Claxton",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Fungus"
    ],
    "rarity": "Rare",
    "mana_cost": "1GGW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Whenever Mycoid Shepherd or another creature you control with power 5 or greater dies, you may gain 5 life."
    ],
    "flavor_text": "As pure mana flooded across the shards, it brought a sense of unity even to Jund's vicious food chain.",
    "power": "5",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 179548,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Mycoid Shepherd’s ability will trigger when it’s put into a graveyard from the battlefield no matter what its power is at that time."
      },
      {
        "date": "5/1/2009",
        "text": "If another creature you control is put into a graveyard from the battlefield, Mycoid Shepherd’s ability checks that creature’s power as it last existed on the battlefield. If it was 5 or greater, the ability will trigger."
      },
      {
        "date": "5/1/2009",
        "text": "If Mycoid Shepherd and another creature you control with power 5 or greater are put into a graveyard from the battlefield at the same time, Mycoid Shepherd’s ability will trigger twice."
      }
    ]
  },
  {
    "name": "Pale Recluse",
    "set_name": "Alara Reborn",
    "collector_num": "74",
    "illustrator": "Cyril Van Der Haegen",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Spider"
    ],
    "rarity": "Common",
    "mana_cost": "4GW",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Reach (This creature can block creatures with flying.)",
      "Forestcycling {2}, plainscycling {2} ({2}, Discard this card: Search your library for a Forest or Plains card, reveal it, put it into your hand, then shuffle your library.)"
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 144249,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Unlike the normal cycling ability, landcycling doesn’t allow you to draw a card. Instead, it lets you search your library for a land card of the specified land type, reveal it, put it into your hand, then shuffle your library."
      },
      {
        "date": "5/1/2009",
        "text": "Landcycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on a card being landcycled. Any ability that stops a cycling ability from being activated also stops a landcycling ability from being activated."
      },
      {
        "date": "5/1/2009",
        "text": "You can choose to find any card with the appropriate land type, including nonbasic lands. You can also choose not to find a card, even if there is a land card with the appropriate type in your library."
      },
      {
        "date": "5/1/2009",
        "text": "A landcycling ability lets you search for any card in your library with the stated land type. It doesn’t have to be a basic land."
      },
      {
        "date": "5/1/2009",
        "text": "You may only activate one landcycling ability at a time. You must specify which landcycling ability you are activating as you cycle this card, not as the ability resolves."
      }
    ]
  },
  {
    "name": "Qasali Pridemage",
    "set_name": "Alara Reborn",
    "collector_num": "75",
    "illustrator": "Chris Rahn",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Cat",
      "Wizard"
    ],
    "rarity": "Common",
    "mana_cost": "GW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Exalted (Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.)",
      "{1}, Sacrifice Qasali Pridemage: Destroy target artifact or enchantment."
    ],
    "flavor_text": "An elder in one pride, of the Sigiled caste in another.",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179556,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Reborn Hope",
    "set_name": "Alara Reborn",
    "collector_num": "76",
    "illustrator": "Warren Mahy",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "GW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Return target multicolored card from your graveyard to your hand."
    ],
    "flavor_text": "\"In darkness is kindled the fiercest hope.\"\n—Hadran, sunseeder of Naya",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 175256,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Sigil Captain",
    "set_name": "Alara Reborn",
    "collector_num": "77",
    "illustrator": "Howard Lyon",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Rhino",
      "Soldier"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1GWW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Whenever a creature enters the battlefield under your control, if that creature is 1/1, put two +1/+1 counters on it."
    ],
    "flavor_text": "\"One sigil awarded for valor, the other awarded for surviving Hellkite's Pass.\"",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 179560,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Sigil Captain’s ability has an “intervening ‘if’ clause.” That means (1) the ability won’t trigger at all unless the creature that enters the battlefield under your control is 1/1, and (2) the ability will do nothing unless that creature is still 1/1 at the time the ability resolves."
      },
      {
        "date": "5/1/2009",
        "text": "For that reason, two Sigil Captains don’t work well together. When a 1/1 creature enters the battlefield under your control, the abilities of both Sigil Captains will trigger. When the first resolves, two +1/+1 counters are put on the 1/1 creature. When the second resolves, it will do nothing because the creature that entered the battlefield is now 3/3."
      },
      {
        "date": "5/1/2009",
        "text": "Sigil Captain’s ability checks a creature’s initial power and toughness upon being put on the battlefield, so it will take into account counters that it enters the battlefield with and static abilities that may give it a continuous power boost once it’s on the battlefield (such as the one on Glorious Anthem). After the creature is already on the battlefield, changing its power and toughness to 1/1 with a spell, activated ability, or triggered ability won’t allow this ability to trigger; it’s too late by then."
      },
      {
        "date": "5/1/2009",
        "text": "If, for some reason, Sigil Captain enters the battlefield as a 1/1 creature (due to a pair of Engineered Plagues, for example), it will cause its own ability to trigger."
      }
    ]
  },
  {
    "name": "Sigil of the Nayan Gods",
    "set_name": "Alara Reborn",
    "collector_num": "78",
    "illustrator": "Warren Mahy",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Common",
    "mana_cost": "1GW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Enchant creature",
      "Enchanted creature gets +1/+1 for each creature you control.",
      "Cycling {G/W} ({G/W}, Discard this card: Draw a card.)"
    ],
    "flavor_text": "As the elves learned the hymns of angels, the knights learned the roars of titans.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179630,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "5/1/2009",
        "text": "Sigil of the Nayan Gods’s ability counts the number of creatures you control, regardless of who controls the creature the Aura is enchanting. If you control the creature it’s enchanting, the bonus will include that creature too."
      }
    ]
  },
  {
    "name": "Sigiled Behemoth",
    "set_name": "Alara Reborn",
    "collector_num": "79",
    "illustrator": "Donato Giancola",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Common",
    "mana_cost": "4GW",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Exalted (Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.)"
    ],
    "flavor_text": "\"Do not mistake a behemoth's assistance for subservience.\"\n—Mayael the Anima",
    "power": "5",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 159688,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Wildfield Borderpost",
    "set_name": "Alara Reborn",
    "collector_num": "80",
    "illustrator": "Zoltan Boros & Gabor Szikszai",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1GW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "You may pay {1} and return a basic land you control to its owner's hand rather than pay this spell's mana cost.",
      "Wildfield Borderpost enters the battlefield tapped.",
      "{T}: Add {G} or {W}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179590,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Casting this card by paying its alternative cost doesn’t change when you can cast it. You can cast it only at the normal time you could cast an artifact spell. It also doesn’t change the spell’s mana cost or converted mana cost. The only difference is the cost you actually pay."
      },
      {
        "date": "5/1/2009",
        "text": "Effects that increase or reduce the cost to cast this card will apply to whichever cost you chose to pay."
      },
      {
        "date": "5/1/2009",
        "text": "To satisfy the alternative cost, you may return any basic land you control to its owner’s hand, regardless of that land’s subtype or whether it’s tapped."
      },
      {
        "date": "5/1/2009",
        "text": "As you cast a spell, you get a chance to activate mana abilities before you pay that spell’s costs. Therefore, you may tap a basic land for mana, then both spend that mana and return that land to your hand to pay this card’s alternative cost. (Of course, you can return a different basic land instead.)"
      }
    ]
  },
  {
    "name": "Identity Crisis",
    "set_name": "Alara Reborn",
    "collector_num": "81",
    "illustrator": "Thomas M. Baxa",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "2WWBB",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Exile all cards from target player's hand and graveyard."
    ],
    "flavor_text": "\"To join our ranks, one must be pure. To be pure, one must be blessed by etherium. To be blessed, one must forget oneself.\"\n—Ethersworn prayer",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 175109,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Necromancer's Covenant",
    "set_name": "Alara Reborn",
    "collector_num": "82",
    "illustrator": "Thomas M. Baxa",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "3WBB",
    "converted_mana_cost": 6,
    "oracle_text": [
      "When Necromancer's Covenant enters the battlefield, exile all creature cards from target player's graveyard, then create a 2/2 black Zombie creature token for each card exiled this way.",
      "Zombies you control have lifelink."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 183011,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The Zombie tokens are put onto the battlefield under your control."
      },
      {
        "date": "5/1/2009",
        "text": "Necromancer’s Covenant grants lifelink to all Zombies you control, not just the tokens put onto the battlefield with its first ability."
      }
    ]
  },
  {
    "name": "Tainted Sigil",
    "set_name": "Alara Reborn",
    "collector_num": "83",
    "illustrator": "Chippy",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "1WB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "{T}, Sacrifice Tainted Sigil: You gain life equal to the total life lost by all players this turn. (Damage causes loss of life.)"
    ],
    "flavor_text": "Sigils corrupted by outsiders do not lose their power, only their purity.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180618,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Tainted Sigil’s ability counts the life lost by all players, including you."
      },
      {
        "date": "5/1/2009",
        "text": "When Tainted Sigil’s ability resolves, it checks how much life each player lost over the course of the turn, then it totals that number and you gain that much life in one shot. It doesn’t matter how a player lost life or what caused it. It also doesn’t matter if Tainted Sigil wasn’t on the battlefield when some or all of the life was lost."
      },
      {
        "date": "5/1/2009",
        "text": "If you lose enough life to lower your life total to 0 or less, you’ll lose the game as a state-based actions before you activate Tainted Sigil’s ability."
      },
      {
        "date": "5/1/2009",
        "text": "Tainted Sigil’s ability checks only whether life was lost. It doesn’t care whether life was also gained. For example, say one player lost 4 life during the turn and no one else lost any, but that same player also gained 6 life that turn. That player has a higher life total than they started the turn with — but Tainted Sigil’s ability counts only the life loss, so you’ll gain 4 life."
      }
    ]
  },
  {
    "name": "Vectis Dominator",
    "set_name": "Alara Reborn",
    "collector_num": "84",
    "illustrator": "Zoltan Boros & Gabor Szikszai",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Common",
    "mana_cost": "1WB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "{T}: Tap target creature unless its controller pays 2 life."
    ],
    "flavor_text": "\"I appreciate the artistry of the telemins, but the creatures of the other worlds provide a much more dramatic performance.\"\n—Ennor, mentalist",
    "power": "0",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179592,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Zealous Persecution",
    "set_name": "Alara Reborn",
    "collector_num": "85",
    "illustrator": "Christopher Moeller",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "WB",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Until end of turn, creatures you control get +1/+1 and creatures your opponents control get -1/-1."
    ],
    "flavor_text": "\"Jharic returned from Grixis changed, a haunted look in her eyes. She destroyed them with an unholy glee that made me shudder.\"\n—Knight-Captain Wyhorn",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179575,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Cloven Casting",
    "set_name": "Alara Reborn",
    "collector_num": "86",
    "illustrator": "Vance Kovacs",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "5UR",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Whenever you cast a multicolored instant or sorcery spell, you may pay {1}. If you do, copy that spell. You may choose new targets for the copy."
    ],
    "flavor_text": "\"Let us flee to the deep jungle. Our city is no longer safe—and I suspect neither is the fallback retreat.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 189653,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "This ability triggers only once for each multicolored instant or sorcery spell you cast. You can’t use a single Cloven Casting to copy the same spell twice."
      },
      {
        "date": "5/1/2009",
        "text": "You can copy the spell that caused Cloven Casting’s ability to trigger even if it’s been countered by the time that ability resolves."
      },
      {
        "date": "5/1/2009",
        "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. The new targets must be legal."
      },
      {
        "date": "5/1/2009",
        "text": "If a modal spell is copied, the copy will have the same mode as the original."
      },
      {
        "date": "5/1/2009",
        "text": "Abilities that trigger when a spell is cast (such as this ability or cascade) won’t trigger when you create a copy this way."
      }
    ]
  },
  {
    "name": "Double Negative",
    "set_name": "Alara Reborn",
    "collector_num": "87",
    "illustrator": "Parente",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "UUR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Counter up to two target spells."
    ],
    "flavor_text": "They feared each other for their differences but were absolutely terrified at their similarities.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179544,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You may cast Double Negative with no targets, one target, or two targets."
      },
      {
        "date": "5/1/2009",
        "text": "In order to counter two target spells, both of those spells must be on the stack at the time you cast Double Negative. Two spells can be on the stack at the same time as the result of an ability (such as cascade or replicate), as the result of a copy effect (such as the one from Cloven Casting or Twincast), or because a spell has been cast in response to another spell."
      },
      {
        "date": "5/1/2009",
        "text": "It’s unusual for a player to cast a spell in response to their own spell, and that will be specifically called out when it happens. Under normal circumstances, if a player casts a spell, it is assumed that the player passes priority afterward. If that player casts another spell, it is assumed that each other player has also passed priority, which caused the first spell to resolve and the first player to receive priority again. Unless the first player says otherwise, only one spell will be on the stack at a time in that scenario."
      }
    ]
  },
  {
    "name": "Magefire Wings",
    "set_name": "Alara Reborn",
    "collector_num": "88",
    "illustrator": "Zoltan Boros & Gabor Szikszai",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Common",
    "mana_cost": "UR",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Enchant creature",
      "Enchanted creature gets +2/+0 and has flying."
    ],
    "flavor_text": "Giving a thing wings does not take away its fear of flight—or its fear of fire, for that matter.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179591,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Skyclaw Thrash",
    "set_name": "Alara Reborn",
    "collector_num": "89",
    "illustrator": "Jaime Jones",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Viashino",
      "Warrior"
    ],
    "rarity": "Uncommon",
    "mana_cost": "3UR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Whenever Skyclaw Thrash attacks, flip a coin. If you win the flip, Skyclaw Thrash gets +1/+1 and gains flying until end of turn."
    ],
    "flavor_text": "Their newfound wings shined elegantly and functioned partially.",
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 179569,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If you lose the flip, nothing happens. Skyclaw Thrash continues to attack as normal."
      }
    ]
  },
  {
    "name": "Spellbound Dragon",
    "set_name": "Alara Reborn",
    "collector_num": "90",
    "illustrator": "Jesper Ejsing",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Dragon"
    ],
    "rarity": "Rare",
    "mana_cost": "3UR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Flying",
      "Whenever Spellbound Dragon attacks, draw a card, then discard a card. Spellbound Dragon gets +X/+0 until end of turn, where X is the discarded card's converted mana cost."
    ],
    "flavor_text": "A king in Jund, a serf in Esper.",
    "power": "3",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 180611,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You’ll discard a card even if some other effect replaces the draw."
      }
    ]
  },
  {
    "name": "Lord of Extinction",
    "set_name": "Alara Reborn",
    "collector_num": "91",
    "illustrator": "Izzy",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3BG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Lord of Extinction's power and toughness are each equal to the number of cards in all graveyards."
    ],
    "flavor_text": "The forlorn cries of the dead combine to make its laugh.",
    "power": "*",
    "toughness": "*",
    "loyalty": null,
    "multiverse_id": 177922,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "The ability that defines Lord of Extinction’s power and toughness works in all zones, not just the battlefield. If Lord of Extinction is in your graveyard, it will count itself."
      },
      {
        "date": "12/7/2018",
        "text": "If an instant or sorcery spell deals damage to Lord of Extinction or lowers its toughness, that spell is put into its owner’s graveyard before state-based actions are performed. That card will raise Lord of Extinction’s toughness before the game checks to see if it dies."
      }
    ]
  },
  {
    "name": "Maelstrom Pulse",
    "set_name": "Alara Reborn",
    "collector_num": "92",
    "illustrator": "Anthony Francisco",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "1BG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Destroy target nonland permanent and all other permanents with the same name as that permanent."
    ],
    "flavor_text": "During the collision of the shards, entire ways of life disappeared without a trace.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180613,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "A face-down creature has no name, so it doesn’t have the same name as anything else."
      },
      {
        "date": "12/7/2018",
        "text": "Maelstrom Pulse has only one target. Other permanents with the same name will be destroyed even if they have hexproof or protection."
      },
      {
        "date": "12/7/2018",
        "text": "If the target permanent becomes an illegal target for Maelstrom Pulse, the spell doesn’t resolve. Nothing is destroyed."
      },
      {
        "date": "12/7/2018",
        "text": "The name of a creature token is the same as the creature types it was created with unless the token is a copy of another creature or the effect that created the token specifically gives it a different name. For example, a 1/1 red Elemental creature token created by Young Pyromancer and a 4/4 green Elemental creature token created by Walker of the Grove are both named “Elemental.”"
      },
      {
        "date": "12/7/2018",
        "text": "If Maelstrom Pulse resolves but the target permanent isn’t destroyed (perhaps because it regenerates or has indestructible), all other permanents with the same name as it will still be destroyed."
      }
    ]
  },
  {
    "name": "Marrow Chomper",
    "set_name": "Alara Reborn",
    "collector_num": "93",
    "illustrator": "Lars Grant-West",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Lizard"
    ],
    "rarity": "Uncommon",
    "mana_cost": "3BG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Devour 2 (As this enters the battlefield, you may sacrifice any number of creatures. This creature enters the battlefield with twice that many +1/+1 counters on it.)",
      "When Marrow Chomper enters the battlefield, you gain 2 life for each creature it devoured."
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 183014,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Morbid Bloom",
    "set_name": "Alara Reborn",
    "collector_num": "94",
    "illustrator": "Trevor Claxton",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "4BG",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Exile target creature card from a graveyard, then create X 1/1 green Saproling creature tokens, where X is the exiled card's toughness."
    ],
    "flavor_text": "\"From the damned I make my garden.\"\n—Jorshu of Clan Nel Toth",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179614,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If the targeted card is removed from the graveyard before Morbid Bloom resolves, the spell doesn’t resolve. You won’t get any Saproling tokens."
      },
      {
        "date": "5/1/2009",
        "text": "If a creature card has “*” in its toughness, the ability that defines “*” works in all zones. The value of X is equal to the toughness of the targeted creature card as it last existed in the graveyard."
      }
    ]
  },
  {
    "name": "Putrid Leech",
    "set_name": "Alara Reborn",
    "collector_num": "95",
    "illustrator": "Dave Allsop",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Leech"
    ],
    "rarity": "Common",
    "mana_cost": "BG",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Pay 2 life: Putrid Leech gets +2/+2 until end of turn. Activate this ability only once each turn."
    ],
    "flavor_text": "It reacted to Naya's overabundant food supply by growing additional mouths.",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179612,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Cerodon Yearling",
    "set_name": "Alara Reborn",
    "collector_num": "96",
    "illustrator": "Christopher Moeller",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Common",
    "mana_cost": "RW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Vigilance, haste"
    ],
    "flavor_text": "The unit of measurement used to chart a cerodon's growth is \"persons consumed.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 180604,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Fight to the Death",
    "set_name": "Alara Reborn",
    "collector_num": "97",
    "illustrator": "Michael Komarck",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "RW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Destroy all blocking creatures and all blocked creatures."
    ],
    "flavor_text": "When a battlefield falls silent, it's rarely due to a cease-fire.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179562,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "A “blocking creature” is one that has been declared as a blocker this combat, or one that was put onto the battlefield blocking this combat. Unless that creature leaves combat, it continues to be a blocking creature through the end of combat step, even if the creature or creatures that it was blocking are no longer on the battlefield or have otherwise left combat by then."
      },
      {
        "date": "5/1/2009",
        "text": "A “blocked creature” is an attacking creature that has been blocked by a creature this combat, or has become blocked as the result of a spell or ability this combat. Unless the attacking creature leaves combat, it continues to be a blocked creature through the end of combat step, even if the creature or creatures that blocked it are no longer on the battlefield or have otherwise left combat by then."
      },
      {
        "date": "5/1/2009",
        "text": "Attacking creatures that haven’t been blocked are unaffected by Fight to the Death."
      },
      {
        "date": "5/1/2009",
        "text": "If Fight to the Death is cast before blockers are declared or after combat ends, it won’t do anything."
      }
    ]
  },
  {
    "name": "Glory of Warfare",
    "set_name": "Alara Reborn",
    "collector_num": "98",
    "illustrator": "Parente",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "2RW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "As long as it's your turn, creatures you control get +2/+0.",
      "As long as it's not your turn, creatures you control get +0/+2."
    ],
    "flavor_text": "\"Their hopes dashed on our shields! Their victory slashed by our swords!\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179611,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "There is never a point at which Glory of Warfare will give a creature you control +2/+2 or +0/+0. A creature that’s normally 1/1, for example, will change from being 3/1 to being 1/3 when your turn ends and another player’s turn begins. At no time will it be 3/3 or 1/1."
      }
    ]
  },
  {
    "name": "Intimidation Bolt",
    "set_name": "Alara Reborn",
    "collector_num": "99",
    "illustrator": "Michael Bruinsma",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "1RW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Intimidation Bolt deals 3 damage to target creature. Other creatures can't attack this turn."
    ],
    "flavor_text": "For hours afterward, all they could see was the grisly silhouette of their master, screaming.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179568,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If the targeted creature has become an illegal target by the time Intimidation Bolt resolves, Intimidation Bolt doesn’t resolve. Creatures will still be able to attack that turn."
      },
      {
        "date": "5/1/2009",
        "text": "If the targeted creature survives the damage, it can attack this turn, but no other creatures can. If the targeted creature is destroyed, no creatures can attack this turn, including creatures that enter the battlefield later on."
      },
      {
        "date": "5/1/2009",
        "text": "For the second part of Intimidation Bolt’s effect to do anything, it must be cast before attackers are declared."
      }
    ]
  },
  {
    "name": "Stun Sniper",
    "set_name": "Alara Reborn",
    "collector_num": "100",
    "illustrator": "Steve Prescott",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Archer"
    ],
    "rarity": "Uncommon",
    "mana_cost": "RW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "{1}, {T}: Stun Sniper deals 1 damage to target creature. Tap that creature."
    ],
    "flavor_text": "The tips of her bolts are blunt, but her aim is deadly sharp.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 179589,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Lorescale Coatl",
    "set_name": "Alara Reborn",
    "collector_num": "101",
    "illustrator": "Greg Staples",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Snake"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1GU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Whenever you draw a card, you may put a +1/+1 counter on Lorescale Coatl."
    ],
    "flavor_text": "\"The enlightenment I never found in etherium I have found traced in the coatl's scales.\"\n—Ranalus, vedalken heretic",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 179633,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/16/2018",
        "text": "If a spell or ability causes you to draw multiple cards, Lorescale Coatl’s ability triggers that many times."
      },
      {
        "date": "3/16/2018",
        "text": "If a spell or ability causes you to put cards in your hand without specifically using the word “draw,” Lorescale Coatl’s ability won’t trigger."
      }
    ]
  },
  {
    "name": "Nulltread Gargantuan",
    "set_name": "Alara Reborn",
    "collector_num": "102",
    "illustrator": "Anthony Francisco",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1GU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "When Nulltread Gargantuan enters the battlefield, put a creature you control on top of its owner's library."
    ],
    "flavor_text": "It crushes all underfoot, yet leaves no trace of its passage—no trampled debris, no flattened souls, not even a hoofprint.",
    "power": "5",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 179580,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Nulltread Gargantuan’s ability doesn’t target the creature you put on top of its owner’s library. You don’t choose one until the ability resolves. No one can respond to the choice."
      },
      {
        "date": "5/1/2009",
        "text": "If you control no other creatures, you’ll have to put Nulltread Gargantuan on top of its owner’s library."
      }
    ]
  },
  {
    "name": "Sages of the Anima",
    "set_name": "Alara Reborn",
    "collector_num": "103",
    "illustrator": "Kev Walker",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elf",
      "Wizard"
    ],
    "rarity": "Rare",
    "mana_cost": "3GU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "If you would draw a card, instead reveal the top three cards of your library. Put all creature cards revealed this way into your hand and the rest on the bottom of your library in any order."
    ],
    "flavor_text": "Godtrackers found new pantheons of beast-gods beyond Naya's borders.",
    "power": "3",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 180601,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Other players don’t get to see the order that you put the cards on the bottom of your library."
      },
      {
        "date": "5/1/2009",
        "text": "If an effect would cause you to draw multiple cards, each individual draw is replaced by Sages of the Anima’s effect. Process the draws one at a time."
      },
      {
        "date": "5/1/2009",
        "text": "If there are fewer than three cards in your library, you’ll reveal all of them."
      },
      {
        "date": "5/1/2009",
        "text": "This effect is mandatory. Even if there are no more creature cards in your library, you have to do this instead of drawing a card."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell or ability causes you to put cards in your hand without specifically using the word “draw,” Sages of the Anima’s ability won’t affect it."
      },
      {
        "date": "5/1/2009",
        "text": "If two or more replacement effects would apply to a card-drawing event, the player who’s drawing the card chooses what order to apply them. It’s possible that after applying one of them, the others will no longer be applicable because the player would no longer draw a card. For example, if you have more than one Sages of the Anima on the battlefield and you would draw a card, each Sages of the Anima’s replacement effect could apply. Once you use one, the rest are no longer applicable."
      }
    ]
  },
  {
    "name": "Vedalken Heretic",
    "set_name": "Alara Reborn",
    "collector_num": "104",
    "illustrator": "Greg Staples",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Vedalken",
      "Rogue"
    ],
    "rarity": "Rare",
    "mana_cost": "GU",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Whenever Vedalken Heretic deals damage to an opponent, you may draw a card."
    ],
    "flavor_text": "\"Etherium clouded my eyes, clogged my ears, desensitized my skin. Now that I can feel, I can begin to learn.\"",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 180619,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Vedalken Heretic’s ability triggers when it deals any damage to an opponent, not just combat damage."
      }
    ]
  },
  {
    "name": "Winged Coatl",
    "set_name": "Alara Reborn",
    "collector_num": "105",
    "illustrator": "Izzy",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Snake"
    ],
    "rarity": "Common",
    "mana_cost": "1GU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flash (You may cast this spell any time you could cast an instant.)",
      "Flying",
      "Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)"
    ],
    "flavor_text": "The nacatl called this new species \"vetli,\" their word for poison arrows.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 179603,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Enigma Sphinx",
    "set_name": "Alara Reborn",
    "collector_num": "106",
    "illustrator": "Chris Rahn",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Sphinx"
    ],
    "rarity": "Rare",
    "mana_cost": "4WUB",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Flying",
      "When Enigma Sphinx is put into your graveyard from the battlefield, put it into your library third from the top.",
      "Cascade (When you cast this spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 180597,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "5/1/2009",
        "text": "After Enigma Sphinx’s middle ability triggers, if Enigma Sphinx is removed from your graveyard in response, it won’t be put into your library."
      },
      {
        "date": "5/1/2009",
        "text": "If you have zero or one card left in your library when Enigma Sphinx’s middle ability resolves, Enigma Sphinx is put on the bottom of your library."
      },
      {
        "date": "5/1/2009",
        "text": "If you control an Enigma Sphinx that’s owned by another player, it’s put into that player’s graveyard from the battlefield, so Enigma Sphinx’s middle ability won’t trigger."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Esper Sojourners",
    "set_name": "Alara Reborn",
    "collector_num": "107",
    "illustrator": "John Avon",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Vedalken",
      "Wizard"
    ],
    "rarity": "Common",
    "mana_cost": "WUB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "When you cycle Esper Sojourners or it dies, you may tap or untap target permanent.",
      "Cycling {2}{U} ({2}{U}, Discard this card: Draw a card.)"
    ],
    "flavor_text": "The wilder the frontier, the greater the need for a controlling hand.",
    "power": "2",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 188967,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "5/1/2009",
        "text": "The triggered ability acts as a cycle-triggered ability or as a leaves-the-battlefield ability, as appropriate. The player who controls the triggered ability is the player who cycled the Sojourner, or the player who last controlled the Sojourner on the battlefield."
      },
      {
        "date": "5/1/2009",
        "text": "If you cycle this card, the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."
      },
      {
        "date": "5/1/2009",
        "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn’t resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you’ll draw a card."
      },
      {
        "date": "5/1/2009",
        "text": "You can cycle this card even if there are no targets for the triggered ability. That’s because the cycling ability itself has no targets."
      }
    ]
  },
  {
    "name": "Etherwrought Page",
    "set_name": "Alara Reborn",
    "collector_num": "108",
    "illustrator": "Howard Lyon",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "1WUB",
    "converted_mana_cost": 4,
    "oracle_text": [
      "At the beginning of your upkeep, choose one —",
      "• You gain 2 life.",
      "• Look at the top card of your library. You may put that card into your graveyard.",
      "• Each opponent loses 1 life."
    ],
    "flavor_text": "An unbound page is a riddle, free of cover and of context, a favorite token of the hegemon.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179618,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You choose a mode when the ability triggers."
      },
      {
        "date": "5/1/2009",
        "text": "You may choose a different mode each time it triggers."
      }
    ]
  },
  {
    "name": "Sen Triplets",
    "set_name": "Alara Reborn",
    "collector_num": "109",
    "illustrator": "Greg Staples",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2WUB",
    "converted_mana_cost": 5,
    "oracle_text": [
      "At the beginning of your upkeep, choose target opponent. This turn, that player can't cast spells or activate abilities and plays with their hand revealed. You may play cards from that player's hand this turn."
    ],
    "flavor_text": "They are the masters of your mind.",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 180607,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Playing a card this way works just like playing any other card, with one exception: You're playing the card from your opponent's hand rather than your own. To be specific:\r\n    -- A card played this way follows the normal timing rules for its card type, as well as any other applicable restrictions such as “Cast [this card] only during combat.” For example, you can't play a card from the targeted opponent's hand during your end step unless it's an instant or has flash.\r\n    -- To cast a nonland card from your opponent's hand this way, you must pay its mana cost.\r\n    -- You can play a land card from the targeted opponent's hand only if you haven't played a land yet that turn."
      },
      {
        "date": "5/1/2009",
        "text": "You control the spells you cast from your opponent’s hand, so you make decisions for them as appropriate. For example, if one of those spells says “target creature you control,” you’ll target one of your creatures, not one of your opponent’s creatures."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast a spell with cascade this way, you’ll control the cascade ability. When it resolves, you’ll find a new card to cast from your own library."
      },
      {
        "date": "5/1/2009",
        "text": "You can cast spells from the targeted player’s hand, but you can’t activate abilities. Specifically, you can’t cycle cards in that player’s hand."
      },
      {
        "date": "5/1/2009",
        "text": "This ability doesn’t prevent the targeted opponent’s triggered abilities from triggering. If one does, that player puts it on the stack and, if applicable, chooses targets for it. Those abilities will resolve as normal."
      },
      {
        "date": "5/1/2009",
        "text": "If the resolution of a spell or ability involves having the targeted player cast a spell, that part of the effect simply won’t work."
      },
      {
        "date": "5/1/2009",
        "text": "After this ability resolves, the targeted player still gets priority at the appropriate times, and can still perform special actions (such as turning a face-down creature face up). However, since that player can’t cast any spells or activate abilities — including mana abilities — there’s not much they can actually accomplish this way."
      },
      {
        "date": "5/1/2009",
        "text": "If you start to play a card from the targeted opponent’s hand, there’s no way for the opponent to get rid of that card in response (like discarding it to pay Gathan Raiders’s morph cost, for example). That’s because the first thing that happens when you start to cast a spell is that it moves to the stack, so it’s not in your opponent’s hand anymore."
      },
      {
        "date": "5/1/2009",
        "text": "Once Sen Triplets’s ability resolves, it remains in effect for the rest of the turn whether or not you still control Sen Triplets."
      }
    ]
  },
  {
    "name": "Sphinx of the Steel Wind",
    "set_name": "Alara Reborn",
    "collector_num": "110",
    "illustrator": "Kev Walker",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Sphinx"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "5WUB",
    "converted_mana_cost": 8,
    "oracle_text": [
      "Flying, first strike, vigilance, lifelink, protection from red and from green"
    ],
    "flavor_text": "No one has properly answered her favorite riddle: \"Why should I spare your life?\"",
    "power": "6",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 189641,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Drastic Revelation",
    "set_name": "Alara Reborn",
    "collector_num": "111",
    "illustrator": "Trevor Claxton",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "2UBR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Discard your hand. Draw seven cards, then discard three cards at random."
    ],
    "flavor_text": "Every disaster holds mystery, for lack of a sane witness.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179587,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You discard your hand as part of Drastic Revelation’s effect, not as an additional cost. If you have no cards in hand at this point, you simply don’t discard any; the rest of the spell will still have its effect."
      },
      {
        "date": "5/1/2009",
        "text": "You’ll discard three cards at random even if some other effect replaces your seven draws."
      },
      {
        "date": "5/1/2009",
        "text": "If there are fewer than seven cards left in your library, you’ll draw all the cards in your library, then you’ll discard three cards at random. Then you’ll lose the game as a state-based action."
      }
    ]
  },
  {
    "name": "Grixis Sojourners",
    "set_name": "Alara Reborn",
    "collector_num": "112",
    "illustrator": "John Avon",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Ogre"
    ],
    "rarity": "Common",
    "mana_cost": "1UBR",
    "converted_mana_cost": 4,
    "oracle_text": [
      "When you cycle Grixis Sojourners or it dies, you may exile target card from a graveyard.",
      "Cycling {2}{B} ({2}{B}, Discard this card: Draw a card.)"
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 188972,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "5/1/2009",
        "text": "The triggered ability acts as a cycle-triggered ability or as a leaves-the-battlefield ability, as appropriate. The player who controls the triggered ability is the player who cycled the Sojourner, or the player who last controlled the Sojourner on the battlefield."
      },
      {
        "date": "5/1/2009",
        "text": "If you cycle this card, the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."
      },
      {
        "date": "5/1/2009",
        "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn’t resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you’ll draw a card."
      },
      {
        "date": "5/1/2009",
        "text": "You can cycle this card even if there are no targets for the triggered ability. That’s because the cycling ability itself has no targets."
      },
      {
        "date": "5/1/2009",
        "text": "Grixis Sojourner’s triggered ability may target Grixis Sojourners itself. By the time the ability triggers, Grixis Sojourner will already be in your graveyard."
      }
    ]
  },
  {
    "name": "Thraximundar",
    "set_name": "Alara Reborn",
    "collector_num": "113",
    "illustrator": "Raymond Swanland",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Zombie",
      "Assassin"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4UBR",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Haste",
      "Whenever Thraximundar attacks, defending player sacrifices a creature.",
      "Whenever a player sacrifices a creature, you may put a +1/+1 counter on Thraximundar."
    ],
    "flavor_text": "His name means \"he who paints the earth red.\"",
    "power": "6",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 180595,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Thraximundar’s middle ability resolves during the declare attackers step. The defending player sacrifices a creature before it would get a chance to block."
      },
      {
        "date": "5/1/2009",
        "text": "Thraximundar’s last ability triggers whenever any player (including you) sacrifices a creature for any reason. It doesn’t trigger only when a creature is sacrificed due to its middle ability. Note that Thraximundar itself doesn’t allow you to sacrifice any creatures."
      }
    ]
  },
  {
    "name": "Unscythe, Killer of Kings",
    "set_name": "Alara Reborn",
    "collector_num": "114",
    "illustrator": "Karl Kopinski",
    "types": [
      "Artifact"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Equipment"
    ],
    "rarity": "Rare",
    "mana_cost": "UBBR",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Equipped creature gets +3/+3 and has first strike.",
      "Whenever a creature dealt damage by equipped creature this turn dies, you may exile that card. If you do, create a 2/2 black Zombie creature token.",
      "Equip {2}"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 189651,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Whenever a creature is put into a graveyard from the battlefield, check whether that creature had been dealt damage this turn by the creature that Unscythe is currently attached to. If so, Unscythe’s second ability will trigger. This is true even if Unscythe wasn’t attached to the creature at the time it dealt that damage. Only the currently equipped creature is checked, not any creatures that Unscythe may have been attached to earlier in the turn."
      },
      {
        "date": "5/1/2009",
        "text": "Unscythe’s second ability cares about any damage, not just combat damage."
      },
      {
        "date": "5/1/2009",
        "text": "If Unscythe’s second ability triggers, but the creature that was put into a graveyard is somehow removed from the graveyard in response (or it was a token), it won’t be able to be exiled with Unscythe’s ability. You won’t get a Zombie token."
      }
    ]
  },
  {
    "name": "Dragon Appeasement",
    "set_name": "Alara Reborn",
    "collector_num": "115",
    "illustrator": "Paul Bonner",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "3BRG",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Skip your draw step.",
      "Whenever you sacrifice a creature, you may draw a card."
    ],
    "flavor_text": "\"Look there—they carry that one upon a sedan chair. It must be their leader. Wait . . . Oh! Perhaps not.\"\n—Kaeda, aven scout",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180616,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Dragon Appeasement itself doesn’t allow you to sacrifice any creatures. Its last ability triggers whenever you sacrifice a creature because some other spell, ability, or cost instructed you to."
      }
    ]
  },
  {
    "name": "Jund Sojourners",
    "set_name": "Alara Reborn",
    "collector_num": "116",
    "illustrator": "John Avon",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Viashino",
      "Shaman"
    ],
    "rarity": "Common",
    "mana_cost": "BRG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "When you cycle Jund Sojourners or it dies, you may have it deal 1 damage to any target.",
      "Cycling {2}{R} ({2}{R}, Discard this card: Draw a card.)"
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 188966,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "5/1/2009",
        "text": "The triggered ability acts as a cycle-triggered ability or as a leaves-the-battlefield ability, as appropriate. The player who controls the triggered ability is the player who cycled the Sojourner, or the player who last controlled the Sojourner on the battlefield."
      },
      {
        "date": "5/1/2009",
        "text": "If you cycle this card, the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."
      },
      {
        "date": "5/1/2009",
        "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn’t resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you’ll draw a card."
      },
      {
        "date": "5/1/2009",
        "text": "You can cycle this card even if there are no targets for the triggered ability. That’s because the cycling ability itself has no targets."
      }
    ]
  },
  {
    "name": "Karrthus, Tyrant of Jund",
    "set_name": "Alara Reborn",
    "collector_num": "117",
    "illustrator": "Dave Kendall",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Dragon"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4BRG",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Flying, haste",
      "When Karrthus, Tyrant of Jund enters the battlefield, gain control of all Dragons, then untap all Dragons.",
      "Other Dragon creatures you control have haste."
    ],
    "flavor_text": null,
    "power": "7",
    "toughness": "7",
    "loyalty": null,
    "multiverse_id": 180587,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The triggered ability’s control-change effect has no duration. Each Dragon you gain control of this way will remain under your control until the game ends, that permanent leaves the battlefield, or some other effect changes its controller."
      },
      {
        "date": "5/1/2009",
        "text": "When the triggered ability resolves, you’ll gain control of all Dragons, including the Dragons you already control (such as Karrthus itself). Usually this will have no appreciable effect, though it will override any previous control-change abilities (such as if you had gained control of one of those Dragons only for the rest of the turn). Then you’ll untap all Dragons, including the ones you already controlled and Karrthus itself (if it had somehow managed to become tapped by then)."
      }
    ]
  },
  {
    "name": "Lavalanche",
    "set_name": "Alara Reborn",
    "collector_num": "118",
    "illustrator": "Steve Argyle",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "XBRG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Lavalanche deals X damage to target player or planeswalker and each creature that player or that planeswalker's controller controls."
    ],
    "flavor_text": "Alara's burning blood cannot be contained by mere earth and stone.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180612,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If the targeted player has become an illegal target by the time Lavalanche resolves, Lavalanche doesn’t resolve. Nothing will be dealt damage."
      },
      {
        "date": "5/1/2009",
        "text": "Because Lavalanche doesn’t target any creatures, it will deal damage to creatures with shroud. Any damage it would deal to creatures with appropriate protection abilities will still be prevented, however."
      }
    ]
  },
  {
    "name": "Madrush Cyclops",
    "set_name": "Alara Reborn",
    "collector_num": "119",
    "illustrator": "Wayne Reynolds",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Cyclops",
      "Warrior"
    ],
    "rarity": "Rare",
    "mana_cost": "1BRG",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Creatures you control have haste."
    ],
    "flavor_text": "Death comes in the blink of an eye.",
    "power": "3",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 180625,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Madrush Cyclops gives itself haste."
      }
    ]
  },
  {
    "name": "Gloryscale Viashino",
    "set_name": "Alara Reborn",
    "collector_num": "120",
    "illustrator": "Volkan Baga",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Viashino",
      "Soldier"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1RGW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Whenever you cast a multicolored spell, Gloryscale Viashino gets +3/+3 until end of turn."
    ],
    "flavor_text": "\"This is a new world and a new war. We need warriors who know chaos and how to combat it.\"\n—Lisha of the Azure",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 189654,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Mayael's Aria",
    "set_name": "Alara Reborn",
    "collector_num": "121",
    "illustrator": "Steve Argyle",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "RGW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "At the beginning of your upkeep, put a +1/+1 counter on each creature you control if you control a creature with power 5 or greater. Then you gain 10 life if you control a creature with power 10 or greater. Then you win the game if you control a creature with power 20 or greater."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180620,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "This ability triggers at the beginning of each of your upkeeps. Whether you control any applicable creatures is checked only when the ability resolves."
      },
      {
        "date": "5/1/2009",
        "text": "The three parts of the ability happen sequentially. For example, if you control a creature with 9 power when the ability starts to resolve, you’ll put a +1/+1 counter on each creature you control — and now, since you control a creature with 10 power, you’ll gain 10 life."
      }
    ]
  },
  {
    "name": "Naya Sojourners",
    "set_name": "Alara Reborn",
    "collector_num": "122",
    "illustrator": "John Avon",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elf",
      "Shaman"
    ],
    "rarity": "Common",
    "mana_cost": "2RGW",
    "converted_mana_cost": 5,
    "oracle_text": [
      "When you cycle Naya Sojourners or it dies, you may put a +1/+1 counter on target creature.",
      "Cycling {2}{G} ({2}{G}, Discard this card: Draw a card.)"
    ],
    "flavor_text": "The elves had entered a land like an open grave—an act of fortitude or folly?",
    "power": "5",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 188970,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "5/1/2009",
        "text": "The triggered ability acts as a cycle-triggered ability or as a leaves-the-battlefield ability, as appropriate. The player who controls the triggered ability is the player who cycled the Sojourner, or the player who last controlled the Sojourner on the battlefield."
      },
      {
        "date": "5/1/2009",
        "text": "If you cycle this card, the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."
      },
      {
        "date": "5/1/2009",
        "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn’t resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you’ll draw a card."
      },
      {
        "date": "5/1/2009",
        "text": "You can cycle this card even if there are no targets for the triggered ability. That’s because the cycling ability itself has no targets."
      }
    ]
  },
  {
    "name": "Retaliator Griffin",
    "set_name": "Alara Reborn",
    "collector_num": "123",
    "illustrator": "Jesper Ejsing",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Griffin"
    ],
    "rarity": "Rare",
    "mana_cost": "1RGW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Flying",
      "Whenever a source an opponent controls deals damage to you, you may put that many +1/+1 counters on Retaliator Griffin."
    ],
    "flavor_text": "For every eye, an eye. For every tooth, a tooth. Griffins are nothing if not fair.",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 147530,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The source of combat damage is the creature that dealt it."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell causes damage to be dealt, that spell will always identify the source of the damage. In most cases, the source is the spell itself. For example, Breath of Malfegor says “Breath of Malfegor deals 5 damage to each opponent.”"
      },
      {
        "date": "5/1/2009",
        "text": "If an ability causes damage to be dealt, that ability will always identify the source of the damage. The ability itself is never the source. However, the source of the ability is often the source of the damage. For example, Deathbringer Thoctar’s ability says “Deathbringer Thoctar deals 1 damage to any target.”"
      },
      {
        "date": "5/1/2009",
        "text": "If the source of the damage is a permanent, Retaliator Griffin checks whether an opponent controls that permanent at the time that damage is dealt. If the permanent has left the battlefield by then, its last known information is used. If the source of the damage is a spell, whether it’s controlled by an opponent is obvious. If the source of the damage is a card in some other zone (such as a cycled Jund Sojourners), Retaliator Griffin checks whether the card’s owner, rather than its controller, is an opponent."
      },
      {
        "date": "5/1/2009",
        "text": "If Retaliator Griffin is dealt lethal damage at the same time that you’re dealt damage by a source an opponent controls, Retaliator Griffin will be put into a graveyard before it would receive any counters. Its ability will still trigger, but it will do nothing when it resolves."
      }
    ]
  },
  {
    "name": "Uril, the Miststalker",
    "set_name": "Alara Reborn",
    "collector_num": "124",
    "illustrator": "Jaime Jones",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2RGW",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Hexproof (This creature can't be the target of spells or abilities your opponents control.)",
      "Uril, the Miststalker gets +2/+2 for each Aura attached to it."
    ],
    "flavor_text": "It strides through the whitecover, mists in which even gargantuans can hide.",
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 189645,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Bant Sojourners",
    "set_name": "Alara Reborn",
    "collector_num": "125",
    "illustrator": "John Avon",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Common",
    "mana_cost": "1GWU",
    "converted_mana_cost": 4,
    "oracle_text": [
      "When you cycle Bant Sojourners or it dies, you may create a 1/1 white Soldier creature token.",
      "Cycling {2}{W} ({2}{W}, Discard this card: Draw a card.)"
    ],
    "flavor_text": "\"We must spread Bant's light before we are shadowed over.\"",
    "power": "2",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 188963,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "5/1/2009",
        "text": "The triggered ability acts as a cycle-triggered ability or as a leaves-the-battlefield ability, as appropriate. The player who controls the triggered ability is the player who cycled the Sojourner, or the player who last controlled the Sojourner on the battlefield."
      },
      {
        "date": "5/1/2009",
        "text": "If you cycle this card, the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."
      },
      {
        "date": "5/1/2009",
        "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn’t resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you’ll draw a card."
      }
    ]
  },
  {
    "name": "Finest Hour",
    "set_name": "Alara Reborn",
    "collector_num": "126",
    "illustrator": "Michael Komarck",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "2GWU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Exalted (Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.)",
      "Whenever a creature you control attacks alone, if it's the first combat phase of the turn, untap that creature. After this phase, there is an additional combat phase."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180609,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Finest Hour’s second ability has an “intervening ‘if’ clause.” The ability won’t trigger at all unless it’s the first combat phase of the turn."
      },
      {
        "date": "5/1/2009",
        "text": "Unlike other similar cards, Finest Hour doesn’t create a main phase in between the two combat phases. The second combat phase will begin immediately after the current one ends."
      }
    ]
  },
  {
    "name": "Flurry of Wings",
    "set_name": "Alara Reborn",
    "collector_num": "127",
    "illustrator": "Matt Cavotta",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "GWU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Create X 1/1 white Bird Soldier creature tokens with flying, where X is the number of attacking creatures."
    ],
    "flavor_text": "\"We are born soldiers. The call to battle is a homecoming.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179605,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "An “attacking creature” is one that has been declared as an attacker this combat, or one that was put onto the battlefield attacking this combat. Unless that creature leaves combat, it continues to be an attacking creature through the end of combat step, even if the player it was attacking has left the game, or the planeswalker it was attacking has left combat."
      },
      {
        "date": "5/1/2009",
        "text": "Flurry of Wings counts the number of creatures that are attacking as it resolves. It doesn’t matter how many creatures were originally declared as attackers that turn. It also doesn’t matter who controls those creatures, or who or what they’re attacking."
      },
      {
        "date": "5/1/2009",
        "text": "If Flurry of Wings is cast before attackers have been declared or after combat ends, it won’t do anything."
      }
    ]
  },
  {
    "name": "Jenara, Asura of War",
    "set_name": "Alara Reborn",
    "collector_num": "128",
    "illustrator": "Chris Rahn",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Angel"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "GWU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying",
      "{1}{W}: Put a +1/+1 counter on Jenara, Asura of War."
    ],
    "flavor_text": "Wounded soldiers looked up, grateful for her appearance. But she passed over them, her eyes firmly on their foe.",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 180605,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Wargate",
    "set_name": "Alara Reborn",
    "collector_num": "129",
    "illustrator": "Franz Vohwinkel",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "XGWU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Search your library for a permanent card with converted mana cost X or less, put it onto the battlefield, then shuffle your library."
    ],
    "flavor_text": "Bant mages still call to the heavens for aid, but angels are not the only ones who answer.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 180592,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."
      },
      {
        "date": "5/1/2009",
        "text": "You may always find a permanent card with converted mana cost 0. (If X is 0, that’s all you can find.) Cards with no mana cost (such as land cards), cards with mana cost {0}, and cards with mana cost {X} all have converted mana cost 0."
      }
    ]
  },
  {
    "name": "Maelstrom Nexus",
    "set_name": "Alara Reborn",
    "collector_num": "130",
    "illustrator": "Steven Belledin",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "WUBRG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "The first spell you cast each turn has cascade. (When you cast your first spell, exile cards from the top of your library until you exile a nonland card that costs less. You may cast it without paying its mana cost. Put the exiled cards on the bottom of your library in a random order.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179540,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "Cascade triggers when you cast the spell, meaning that it resolves before that spell. If you end up casting the exiled card, it will go on the stack above the spell with cascade."
      },
      {
        "date": "5/1/2009",
        "text": "When the cascade ability resolves, you must exile cards. The only optional part of the ability is whether or not you cast the last card exiled."
      },
      {
        "date": "5/1/2009",
        "text": "If a spell with cascade is countered, the cascade ability will still resolve normally."
      },
      {
        "date": "5/1/2009",
        "text": "You exile the cards face-up. All players will be able to see them."
      },
      {
        "date": "5/1/2009",
        "text": "If you cast the last exiled card, you’re casting it as a spell. It can be countered. If that card has cascade, the new spell’s cascade ability will trigger, and you’ll repeat the process for the new spell."
      },
      {
        "date": "5/1/2009",
        "text": "After you’re done exiling cards and casting the last one if you chose to do so, the remaining exiled cards are randomly placed on the bottom of your library. Neither you nor any other player is allowed to know the order of those cards."
      },
      {
        "date": "5/1/2009",
        "text": "Maelstrom Nexus affects the first spell you cast each turn, not just the first spell you cast on your own turn."
      },
      {
        "date": "5/1/2009",
        "text": "If the first spell you cast in a turn already has cascade, both cascade abilities will trigger separately. Deal with them one at a time: First one cascade ability will resolve, and you’ll cast the applicable card if you want. That new spell will resolve. Then the other cascade ability will resolve in the same way. Finally, the original spell will resolve."
      },
      {
        "date": "5/1/2009",
        "text": "This effect takes into account spells that were cast earlier in the turn that Maelstrom Nexus entered the battlefield, including any spells still on the stack. If you’ve already cast any spells that turn (including Maelstrom Nexus itself), this ability won’t give any of your spells cascade that turn."
      },
      {
        "date": "5/1/2009",
        "text": "A spell’s converted mana cost is determined solely by the mana symbols printed in its upper right corner. If its mana cost includes {X}, take the chosen value of X into account. Ignore any alternative costs, additional costs, cost increases, or cost reductions."
      },
      {
        "date": "4/18/2017",
        "text": "The converted mana cost of a split card is determined by the combined mana cost of its two halves. If cascade allows you to cast a split card, you may cast either half but not both halves."
      }
    ]
  },
  {
    "name": "Arsenal Thresher",
    "set_name": "Alara Reborn",
    "collector_num": "131",
    "illustrator": "Ralph Horsley",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Construct"
    ],
    "rarity": "Common",
    "mana_cost": "2{W/B}U",
    "converted_mana_cost": 4,
    "oracle_text": [
      "As Arsenal Thresher enters the battlefield, you may reveal any number of other artifact cards from your hand. Arsenal Thresher enters the battlefield with a +1/+1 counter on it for each card revealed this way."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 189652,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "If multiple Arsenal Threshers are entering the battlefield at the same time (for example, if Warp World is resolving), you may reveal the same artifact cards from your hand for each of them."
      },
      {
        "date": "5/1/2009",
        "text": "If Arsenal Thresher and another artifact are entering the battlefield from your hand at the same time, you may reveal that other artifact for Arsenal Thresher. If that artifact is a second Arsenal Thresher, you may reveal each Arsenal Thresher for the other."
      }
    ]
  },
  {
    "name": "Esper Stormblade",
    "set_name": "Alara Reborn",
    "collector_num": "132",
    "illustrator": "Matt Stewart",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Vedalken",
      "Wizard"
    ],
    "rarity": "Common",
    "mana_cost": "{W/B}U",
    "converted_mana_cost": 2,
    "oracle_text": [
      "As long as you control another multicolored permanent, Esper Stormblade gets +1/+1 and has flying."
    ],
    "flavor_text": "Stormcallers came to appreciate the novelty of Jund's volcanic updrafts.",
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 188968,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Thopter Foundry",
    "set_name": "Alara Reborn",
    "collector_num": "133",
    "illustrator": "Ralph Horsley",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "{W/B}U",
    "converted_mana_cost": 2,
    "oracle_text": [
      "{1}, Sacrifice a nontoken artifact: Create a 1/1 blue Thopter artifact creature token with flying. You gain 1 life."
    ],
    "flavor_text": "\"Etherium is limited. Innovation is not.\"\n—Tezzeret",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 183017,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "The nontoken artifact you sacrifice may be Thopter Foundry itself."
      }
    ]
  },
  {
    "name": "Grixis Grimblade",
    "set_name": "Alara Reborn",
    "collector_num": "134",
    "illustrator": "Trevor Claxton",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Warrior"
    ],
    "rarity": "Common",
    "mana_cost": "{U/R}B",
    "converted_mana_cost": 2,
    "oracle_text": [
      "As long as you control another multicolored permanent, Grixis Grimblade gets +1/+1 and has deathtouch. (Any amount of damage it deals to a creature is enough to destroy that creature.)"
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 188976,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Sewn-Eye Drake",
    "set_name": "Alara Reborn",
    "collector_num": "135",
    "illustrator": "Anthony S. Waters",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie",
      "Drake"
    ],
    "rarity": "Common",
    "mana_cost": "2{U/R}B",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Flying, haste"
    ],
    "flavor_text": "\"Too wary to charge, too prudent to serve. Not anymore.\"\n—Sedris, the Traitor King",
    "power": "3",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 179594,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Slave of Bolas",
    "set_name": "Alara Reborn",
    "collector_num": "136",
    "illustrator": "Steve Argyle",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "3{U/R}B",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Gain control of target creature. Untap that creature. It gains haste until end of turn. Sacrifice it at the beginning of the next end step."
    ],
    "flavor_text": "Nicol Bolas doesn't distinguish between servants and victims.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 188971,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You may target a creature you already control."
      },
      {
        "date": "5/1/2009",
        "text": "If you don’t control the targeted creature when the “at end of turn” ability resolves, it won’t be sacrificed. If it’s still on the battlefield but under another player’s control, the ability won’t try to have you sacrifice it again at the end of the turn after that."
      }
    ]
  },
  {
    "name": "Giant Ambush Beetle",
    "set_name": "Alara Reborn",
    "collector_num": "137",
    "illustrator": "Carl Critchlow",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Insect"
    ],
    "rarity": "Uncommon",
    "mana_cost": "3{B/G}R",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Haste",
      "When Giant Ambush Beetle enters the battlefield, you may have target creature block it this turn if able."
    ],
    "flavor_text": "It waits with absolute stillness. One might think it a statue if it weren't occasionally seen chewing on its victims.",
    "power": "4",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 179598,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You decide whether to have the targeted creature block Giant Ambush Beetle this turn if able at the time the enters-the-battlefield ability resolves, not at the time Giant Ambush Beetle attacks."
      },
      {
        "date": "5/1/2009",
        "text": "Deciding to have the targeted creature block doesn’t force you to attack with Giant Ambush Beetle that turn. If Giant Ambush Beetle doesn’t attack, the targeted creature is free to block whichever creature its controller chooses, or block no creatures at all."
      },
      {
        "date": "5/1/2009",
        "text": "If you choose to have the targeted creature block but that creature isn’t able to block Giant Ambush Beetle (for example, because the targeted creature can block only creatures with flying), the requirement to block does nothing. The targeted creature is free to block whichever creature its controller chooses, or block no creatures at all."
      },
      {
        "date": "5/1/2009",
        "text": "Tapped creatures, creatures that can’t block as the result of an effect, creatures with unpaid costs to block (such as those from War Cadence), and creatures that aren’t controlled by the defending player are exempt from effects that would require them to block. Such creatures can be targeted by Giant Ambush Beetle’s ability, but the requirement to block does nothing."
      }
    ]
  },
  {
    "name": "Jund Hackblade",
    "set_name": "Alara Reborn",
    "collector_num": "138",
    "illustrator": "Dan Dos Santos",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Goblin",
      "Berserker"
    ],
    "rarity": "Common",
    "mana_cost": "{B/G}R",
    "converted_mana_cost": 2,
    "oracle_text": [
      "As long as you control another multicolored permanent, Jund Hackblade gets +1/+1 and has haste."
    ],
    "flavor_text": "The knights were halfway through their precombat rites before they realized the foul brute meant to start without them.",
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 188973,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Sangrite Backlash",
    "set_name": "Alara Reborn",
    "collector_num": "139",
    "illustrator": "Cyril Van Der Haegen",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Common",
    "mana_cost": "{B/G}R",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Enchant creature",
      "Enchanted creature gets +3/-3."
    ],
    "flavor_text": "\"Sangrite is the dragon's beating heart. Little wonder, then, that so many fools' chests burst trying to contain it.\"\n—Sarkhan Vol",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179553,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Marisi's Twinclaws",
    "set_name": "Alara Reborn",
    "collector_num": "140",
    "illustrator": "Izzy",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Cat",
      "Warrior"
    ],
    "rarity": "Uncommon",
    "mana_cost": "2{R/W}G",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Double strike"
    ],
    "flavor_text": "\"Looks like we're completely outnumbered.\"\n\"Lucky for us. I thought we'd be bored.\"",
    "power": "2",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 179585,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Naya Hushblade",
    "set_name": "Alara Reborn",
    "collector_num": "141",
    "illustrator": "Jason Chan",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elf",
      "Rogue"
    ],
    "rarity": "Common",
    "mana_cost": "{R/W}G",
    "converted_mana_cost": 2,
    "oracle_text": [
      "As long as you control another multicolored permanent, Naya Hushblade gets +1/+1 and has shroud. (It can't be the target of spells or abilities.)"
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 188969,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Trace of Abundance",
    "set_name": "Alara Reborn",
    "collector_num": "142",
    "illustrator": "Dave Kendall",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Common",
    "mana_cost": "{R/W}G",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Enchant land",
      "Enchanted land has shroud. (It can't be the target of spells or abilities.)",
      "Whenever enchanted land is tapped for mana, its controller adds an additional one mana of any color."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 161292,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Bant Sureblade",
    "set_name": "Alara Reborn",
    "collector_num": "143",
    "illustrator": "Michael Komarck",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Common",
    "mana_cost": "{G/U}W",
    "converted_mana_cost": 2,
    "oracle_text": [
      "As long as you control another multicolored permanent, Bant Sureblade gets +1/+1 and has first strike."
    ],
    "flavor_text": "Soldiers who fought through Grixis learned to hit first, recite the prayer of Asha later.",
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 188975,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Crystallization",
    "set_name": "Alara Reborn",
    "collector_num": "144",
    "illustrator": "Zoltan Boros & Gabor Szikszai",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Common",
    "mana_cost": "{G/U}W",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Enchant creature",
      "Enchanted creature can't attack or block.",
      "When enchanted creature becomes the target of a spell or ability, exile that creature."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 179621,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "When the enchanted creature becomes the target of a spell or ability, Crystallization’s last ability will trigger. When that ability resolves, that creature will be exiled, even if Crystallization has left the battlefield or is enchanting a different creature by that time. If Crystallization is still enchanting the same creature, Crystallization will then be put into its owner’s graveyard as a state-based action."
      }
    ]
  },
  {
    "name": "Messenger Falcons",
    "set_name": "Alara Reborn",
    "collector_num": "145",
    "illustrator": "David Palumbo",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Bird"
    ],
    "rarity": "Uncommon",
    "mana_cost": "2{G/U}W",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Flying",
      "When Messenger Falcons enters the battlefield, draw a card."
    ],
    "flavor_text": "So many aven had died scouting the distant fronts that the knight-captains recruited Nayan falcons as couriers.",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 189644,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  }
]
