[
  {
    "name": "Aegis Angel",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "1",
    "illustrator": "Aleksi Briclot",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Angel"
    ],
    "rarity": "Rare",
    "mana_cost": "4WW",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Flying (This creature can't be blocked except by creatures with flying or reach.)",
      "When Aegis Angel enters the battlefield, another target permanent gains indestructible for as long as you control Aegis Angel. (Effects that say \"destroy\" don't destroy it. A creature with indestructible can't be destroyed by damage.)"
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 430540,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "9/22/2011",
        "text": "If Aegis Angel leaves the battlefield, you no longer control it."
      },
      {
        "date": "9/22/2011",
        "text": "If Aegis Angel and the permanent would be destroyed simultaneously, only Aegis Angel will be destroyed."
      },
      {
        "date": "7/1/2013",
        "text": "If another player gains control of Aegis Angel, the permanent will no longer have indestructible, even if you regain control of Aegis Angel."
      }
    ]
  },
  {
    "name": "Aerial Responder",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "2",
    "illustrator": "Raoul Vitale",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Dwarf",
      "Soldier"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1WW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying, vigilance, lifelink"
    ],
    "flavor_text": "Dwarves have an instinct for repair, an inherent understanding of how systems work, and a reputation for fearlessness. They're perfect candidates for the Fair's emergency response team.",
    "power": "2",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 430541,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Anointer of Champions",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "3",
    "illustrator": "Anna Steinbauer",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Cleric"
    ],
    "rarity": "Uncommon",
    "mana_cost": "W",
    "converted_mana_cost": 1,
    "oracle_text": [
      "{T}: Target attacking creature gets +1/+1 until end of turn."
    ],
    "flavor_text": "\"Arise. You have been anointed by the light. Go forth and fight without fear, for you shall be victorious.\"",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430542,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Doomed Traveler",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "4",
    "illustrator": "Lars Grant-West",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Common",
    "mana_cost": "W",
    "converted_mana_cost": 1,
    "oracle_text": [
      "When Doomed Traveler dies, create a 1/1 white Spirit creature token with flying."
    ],
    "flavor_text": "He vowed he would never rest until he reached his destination. He doesn't know how right he was.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430543,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Excoriate",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "5",
    "illustrator": "Johann Bodin",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "3W",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Exile target tapped creature."
    ],
    "flavor_text": "The demon had flown past the reach of Erebos's whip but not the point of the sun god's spear.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430544,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Expedition Raptor",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "6",
    "illustrator": "Johann Bodin",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Bird"
    ],
    "rarity": "Common",
    "mana_cost": "3WW",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Flying",
      "When Expedition Raptor enters the battlefield, support 2. (Put a +1/+1 counter on each of up to two other target creatures.)"
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430545,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "1/22/2016",
        "text": "You can’t put more than one +1/+1 counter on any one target using the support action."
      },
      {
        "date": "1/22/2016",
        "text": "Support can target a creature you don’t control."
      },
      {
        "date": "1/22/2016",
        "text": "If a spell with support has other abilities that target creatures, those abilities and the support ability can target the same creature."
      }
    ]
  },
  {
    "name": "Fencing Ace",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "7",
    "illustrator": "David Rapoza",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1W",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Double strike (This creature deals both first-strike and regular combat damage.)"
    ],
    "flavor_text": "His prowess gives the guildless hope that they can hold out against tyranny.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430546,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Fiendslayer Paladin",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "8",
    "illustrator": "Wesley Burt",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Knight"
    ],
    "rarity": "Rare",
    "mana_cost": "1WW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "First strike (This creature deals combat damage before creatures without first strike.)",
      "Lifelink (Damage dealt by this creature also causes you to gain that much life.)",
      "Fiendslayer Paladin can't be the target of black or red spells your opponents control."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430547,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/1/2013",
        "text": "Fiendslayer Paladin can be affected by black or red spells that don’t target it. For example, a red spell that “deals 3 damage to each creature” would deal damage to Fiendslayer Paladin."
      }
    ]
  },
  {
    "name": "Flickerwisp",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "9",
    "illustrator": "Jeremy Enecio",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1WW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying",
      "When Flickerwisp enters the battlefield, exile another target permanent. Return that card to the battlefield under its owner's control at the beginning of the next end step."
    ],
    "flavor_text": "Its wings disturb more than air.",
    "power": "3",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430548,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "8/1/2008",
        "text": "The exiled card will return to the battlefield at the beginning of the end step even if Flickerwisp is no longer on the battlefield."
      },
      {
        "date": "8/1/2008",
        "text": "If the permanent that returns to the battlefield has any abilities that trigger at the beginning of the end step, those abilities won’t trigger that turn."
      }
    ]
  },
  {
    "name": "Gideon Jura",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "10",
    "illustrator": "Chris Rahn",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Gideon"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3WW",
    "converted_mana_cost": 5,
    "oracle_text": [
      "+2: During target opponent's next turn, creatures that player controls attack Gideon Jura if able.",
      "−2: Destroy target tapped creature.",
      "0: Until end of turn, Gideon Jura becomes a 6/6 Human Soldier creature that's still a planeswalker. Prevent all damage that would be dealt to him this turn."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "6",
    "multiverse_id": 430549,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/15/2010",
        "text": "Gideon Jura’s first ability doesn’t lock in what it applies to. That’s because the effect states a true thing about a set of creatures, but doesn’t actually change the characteristics of those creatures. As a result, whatever creatures the targeted opponent controls during the declare attackers step of their next turn must attack Gideon Jura if able. This includes creatures that come under that player’s control after the ability has resolved and creatures that have lost all abilities."
      },
      {
        "date": "6/15/2010",
        "text": "Gideon Jura’s first ability causes creatures to attack him if able. If, during the affected player’s declare attackers step, a creature they control is tapped, is affected by a spell or ability that says it can’t attack, or is affected by “summoning sickness,” then that creature doesn’t attack. If there’s a cost associated with having a creature attack, the player isn’t forced to pay that cost, so the creature doesn’t have to attack in that case either."
      },
      {
        "date": "6/15/2010",
        "text": "If a creature controlled by the affected player can’t attack Gideon Jura (because he’s no longer on the battlefield, for example), that player may have it attack you, another one of your planeswalkers, or nothing at all."
      },
      {
        "date": "6/15/2010",
        "text": "Gideon Jura’s first ability applies during each combat phase of the affected player’s next turn (as opposed to applying during the affected player’s next combat phase). The distinction is relevant if there are no combat phases during that turn (due to Fatespinner’s effect, for example) or there are multiples (due to World at War, for example)."
      },
      {
        "date": "6/15/2010",
        "text": "If Gideon Jura becomes a creature due to his third ability, that doesn’t count as having a creature enter the battlefield. Gideon Jura was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
      },
      {
        "date": "6/15/2010",
        "text": "If Gideon Jura becomes a creature, he may be affected by “summoning sickness.” You can’t attack with him or use any of his {T} abilities (if he gains any) unless he began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when Gideon Jura came under your control, not when he became a creature."
      },
      {
        "date": "6/15/2010",
        "text": "Gideon Jura’s third ability causes him to become a creature with the creature types Human Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: Gideon is just a planeswalker type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."
      },
      {
        "date": "6/15/2010",
        "text": "If you activate Gideon Jura’s third ability and then unpreventable damage is dealt to him (due to Unstable Footing, for example), that damage has all applicable results: specifically, the damage is marked on Gideon Jura (since he’s a creature) and that damage causes that many loyalty counters to be removed from him (since he’s a planeswalker). If the total amount of damage marked on Gideon Jura is lethal damage, he’s destroyed as a state-based action. If Gideon Jura has no loyalty counters on him, he’s put into his owner’s graveyard as a state-based action."
      },
      {
        "date": "6/15/2010",
        "text": "Say you activate Gideon Jura’s third ability, then an opponent gains control of him before combat. You may have any of your creatures attack Gideon Jura (since he’s still a planeswalker). Then Gideon Jura may block (since he’s a creature). He may block any eligible attacking creature, including one that’s attacking him! During combat, he behaves as an attacked planeswalker and/or a blocking creature, as appropriate. For example, he deals combat damage to any creatures he’s blocking, but he doesn’t deal combat damage to any unblocked creatures that are attacking him."
      },
      {
        "date": "1/22/2011",
        "text": "The first ability only affects the declaration of attackers. If a creature is put onto the battlefield attacking (thanks to Hero of Bladehold, Preeminent Captain, or the Ninjutsu ability, for example), that creature’s controller may choose the defending player or planeswalker that it will be attacking in the normal way."
      }
    ]
  },
  {
    "name": "Gideon's Lawkeeper",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "11",
    "illustrator": "Steve Prescott",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Common",
    "mana_cost": "W",
    "converted_mana_cost": 1,
    "oracle_text": [
      "{W}, {T}: Tap target creature."
    ],
    "flavor_text": "\"The essence of a lawful society is swift deterrence.\"",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430550,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Grand Abolisher",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "12",
    "illustrator": "Eric Deschamps",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Cleric"
    ],
    "rarity": "Rare",
    "mana_cost": "WW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "During your turn, your opponents can't cast spells or activate abilities of artifacts, creatures, or enchantments."
    ],
    "flavor_text": "\"Your superstitions and mumblings are useless chaff before my righteousness.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430551,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "9/22/2011",
        "text": "Grand Abolisher doesn’t stop your opponents from activating abilities of artifact, creature, or enchantment cards in zones other than the battlefield (like cycling abilities, for example)."
      },
      {
        "date": "9/22/2011",
        "text": "Grand Abolisher doesn’t affect triggered abilities or static abilities."
      }
    ]
  },
  {
    "name": "Grasp of the Hieromancer",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "13",
    "illustrator": "Igor Kieryluk",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Common",
    "mana_cost": "1W",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Enchant creature",
      "Enchanted creature gets +1/+1 and has \"Whenever this creature attacks, tap target creature defending player controls.\""
    ],
    "flavor_text": "\"There is power in abandon, but far more in control.\"\n—Warden Hixus, to Kytheon",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430552,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/22/2015",
        "text": "The triggered ability granted to the enchanted creature will tap the creature before blockers are declared."
      },
      {
        "date": "6/22/2015",
        "text": "The enchanted creature is the source of the triggered ability it gains, not Grasp of the Hieromancer. If the enchanted creature isn’t white, that ability can target a creature with protection from white, for example."
      }
    ]
  },
  {
    "name": "Lightwielder Paladin",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "14",
    "illustrator": "D. Alexander Gregory",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Knight"
    ],
    "rarity": "Rare",
    "mana_cost": "3WW",
    "converted_mana_cost": 5,
    "oracle_text": [
      "First strike (This creature deals combat damage before creatures without first strike.)",
      "Whenever Lightwielder Paladin deals combat damage to a player, you may exile target black or red permanent that player controls."
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 430553,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "Lands are colorless (even if their frames have some colored elements to them). You can’t target a Swamp, a Mountain, or any other land with Lightwielder Paladin’s ability (unless some other effect has turned that land black or red)."
      }
    ]
  },
  {
    "name": "Mentor of the Meek",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "15",
    "illustrator": "Jana Schirmer & Johannes Voss",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Rare",
    "mana_cost": "2W",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Whenever another creature with power 2 or less enters the battlefield under your control, you may pay {1}. If you do, draw a card."
    ],
    "flavor_text": "\"In these halls there is no pass or fail. Your true test comes with the first full moon.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430554,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/13/2018",
        "text": "Mentor of the Meek’s ability checks the power of the other creature only as it enters the battlefield. If that creature’s power is 2 or less, the ability will trigger. Once the ability triggers, raising that creature’s power above 2 won’t affect that ability. Similarly, reducing the creature’s power to 2 or less after it enters the battlefield won’t cause the ability to trigger."
      },
      {
        "date": "7/13/2018",
        "text": "Apply power bonuses from counters the creature enters the battlefield with and continuous effects such as that of Valiant Knight before checking to see if Mentor of the Meek’s ability will trigger."
      },
      {
        "date": "7/13/2018",
        "text": "While resolving the triggered ability of Mentor of the Meek, you can’t pay {1} multiple times to draw more than one card."
      }
    ]
  },
  {
    "name": "Moment of Heroism",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "16",
    "illustrator": "Christopher Moeller",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1W",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Target creature gets +2/+2 and gains lifelink until end of turn. (Damage dealt by the creature also causes its controller to gain that much life.)"
    ],
    "flavor_text": "\"My faith is stronger than fang, claw, or mindless hunger.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430555,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "9/22/2011",
        "text": "Multiple instances of lifelink on the same creature are redundant."
      }
    ]
  },
  {
    "name": "Odric, Master Tactician",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "17",
    "illustrator": "Michael Komarck",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Rare",
    "mana_cost": "2WW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "First strike (This creature deals combat damage before creatures without first strike.)",
      "Whenever Odric, Master Tactician and at least three other creatures attack, you choose which creatures block this combat and how those creatures block."
    ],
    "flavor_text": "\"Fear holds no place in faith's battle plan.\"",
    "power": "3",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 430556,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/1/2012",
        "text": "You can decide that a creature won’t block."
      },
      {
        "date": "7/1/2012",
        "text": "All blocking declarations must still be legal."
      },
      {
        "date": "7/1/2012",
        "text": "If there’s a cost associated with having a creature block and you choose for that creature to block, its controller can choose to pay that cost or not. If that player decides to not pay that cost, you must propose a new set of blocking creatures."
      }
    ]
  },
  {
    "name": "Precinct Captain",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "18",
    "illustrator": "Steve Prescott",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Rare",
    "mana_cost": "WW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "First strike",
      "Whenever Precinct Captain deals combat damage to a player, create a 1/1 white Soldier creature token."
    ],
    "flavor_text": "\"In troubled times, we all need someone to watch our back.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430557,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Relief Captain",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "19",
    "illustrator": "Anastasia Ovchinnikova",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Kor",
      "Knight",
      "Ally"
    ],
    "rarity": "Uncommon",
    "mana_cost": "2WW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "When Relief Captain enters the battlefield, support 3. (Put a +1/+1 counter on each of up to three other target creatures.)"
    ],
    "flavor_text": "Sometimes gestures of support are small. Sometimes not.",
    "power": "3",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430558,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "1/22/2016",
        "text": "You can’t put more than one +1/+1 counter on any one target using the support action."
      },
      {
        "date": "1/22/2016",
        "text": "Support can target a creature you don’t control."
      },
      {
        "date": "1/22/2016",
        "text": "If a spell with support has other abilities that target creatures, those abilities and the support ability can target the same creature."
      }
    ]
  },
  {
    "name": "Shoulder to Shoulder",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "20",
    "illustrator": "Chris Rallis",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "2W",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Support 2. (Put a +1/+1 counter on each of up to two target creatures.)",
      "Draw a card."
    ],
    "flavor_text": "\"Sea Gate may have fallen, but we still stand. We still fight.\"\n—Gideon Jura",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430559,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "1/22/2016",
        "text": "You can’t put more than one +1/+1 counter on any one target using the support action."
      },
      {
        "date": "1/22/2016",
        "text": "Support can target a creature you don’t control."
      },
      {
        "date": "1/22/2016",
        "text": "If a spell with support has other abilities that target creatures, those abilities and the support ability can target the same creature."
      }
    ]
  },
  {
    "name": "Sun Titan",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "21",
    "illustrator": "Todd Lockwood",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Giant"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4WW",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Vigilance",
      "Whenever Sun Titan enters the battlefield or attacks, you may return target permanent card with converted mana cost 3 or less from your graveyard to the battlefield."
    ],
    "flavor_text": "A blazing sun that never sets.",
    "power": "6",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 430560,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "8/15/2010",
        "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."
      },
      {
        "date": "8/15/2010",
        "text": "The converted mana cost of a card in your graveyard is determined solely by the mana symbols printed in its upper right corner. The converted mana cost is the total amount of mana in that cost, regardless of color. For example, a card with mana cost {3}{U}{U} has converted mana cost 5."
      },
      {
        "date": "8/15/2010",
        "text": "If the mana cost of a card in your graveyard includes {X}, X is considered to be 0."
      },
      {
        "date": "8/15/2010",
        "text": "If a card in your graveyard has no mana symbols in its upper right corner (because it’s a land card, for example), its converted mana cost is 0."
      }
    ]
  },
  {
    "name": "Youthful Knight",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "22",
    "illustrator": "Rebecca Guay",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Knight"
    ],
    "rarity": "Common",
    "mana_cost": "1W",
    "converted_mana_cost": 2,
    "oracle_text": [
      "First strike"
    ],
    "flavor_text": "Idealism fits him better than his armor.",
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430561,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Compulsive Research",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "23",
    "illustrator": "Sara Winters",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "2U",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Target player draws three cards. Then that player discards two cards unless they discard a land card."
    ],
    "flavor_text": "\"Four parts molten bronze, yes . . . one part frozen mercury, yes, yes . . . but then what?\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430562,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/14/2017",
        "text": "The target player can discard either one land card or two cards which may or may not be lands. The player can discard one land and one other card or two land cards if they choose."
      }
    ]
  },
  {
    "name": "Icefall Regent",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "24",
    "illustrator": "David Gaillet",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Dragon"
    ],
    "rarity": "Rare",
    "mana_cost": "3UU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Flying",
      "When Icefall Regent enters the battlefield, tap target creature an opponent controls. That creature doesn't untap during its controller's untap step for as long as you control Icefall Regent.",
      "Spells your opponents cast that target Icefall Regent cost {2} more to cast."
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 430563,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/25/2015",
        "text": "Icefall Regent’s triggered ability can target any creature controlled by an opponent, including one that is already tapped. In that case, the creature stays tapped and won’t untap during its controller’s untap step."
      },
      {
        "date": "2/25/2015",
        "text": "If another player gains control of Icefall Regent, the creature will no longer be affected by the ability stopping it from untapping, even if you later regain control of Icefall Regent."
      },
      {
        "date": "2/25/2015",
        "text": "The ability stopping the creature from untapping will continue to apply to it even if the creature changes controllers."
      },
      {
        "date": "2/25/2015",
        "text": "Icefall Regent’s last ability affects all spells cast by your opponents that target it, including Aura spells and spells with multiple targets. It doesn’t affect abilities."
      }
    ]
  },
  {
    "name": "Ior Ruin Expedition",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "25",
    "illustrator": "Chris Rahn",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1U",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Landfall — Whenever a land enters the battlefield under your control, you may put a quest counter on Ior Ruin Expedition.",
      "Remove three quest counters from Ior Ruin Expedition and sacrifice it: Draw two cards."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430564,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad’s ability, for example)."
      },
      {
        "date": "10/1/2009",
        "text": "When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."
      }
    ]
  },
  {
    "name": "Prognostic Sphinx",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "26",
    "illustrator": "Steve Prescott",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Sphinx"
    ],
    "rarity": "Rare",
    "mana_cost": "3UU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Flying",
      "Discard a card: Prognostic Sphinx gains hexproof until end of turn. Tap it.",
      "Whenever Prognostic Sphinx attacks, scry 3. (Look at the top three cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)"
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 430565,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "9/15/2013",
        "text": "You can activate Prognostic Sphinx’s ability even if it’s already tapped."
      },
      {
        "date": "9/15/2013",
        "text": "When you scry, you may put all the cards you look at back on top of your library, you may put all of those cards on the bottom of your library, or you may put some of those cards on top and the rest of them on the bottom."
      },
      {
        "date": "9/15/2013",
        "text": "You choose how to order cards returned to your library after scrying no matter where you put them."
      },
      {
        "date": "9/15/2013",
        "text": "You perform the actions stated on a card in sequence. For some spells and abilities, that means you’ll scry last. For others, that means you’ll scry and then perform other actions."
      },
      {
        "date": "9/15/2013",
        "text": "Scry appears on some spells and abilities with one or more targets. If all of the spell or ability’s targets are illegal when it tries to resolve, it won’t resolve and none of its effects will happen. You won’t scry."
      }
    ]
  },
  {
    "name": "Reckless Scholar",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "27",
    "illustrator": "Steve Prescott",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Uncommon",
    "mana_cost": "2U",
    "converted_mana_cost": 3,
    "oracle_text": [
      "{T}: Target player draws a card, then discards a card."
    ],
    "flavor_text": "Progress comes at a price.",
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430566,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Sphinx of Jwar Isle",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "28",
    "illustrator": "Justin Sweet",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Sphinx"
    ],
    "rarity": "Rare",
    "mana_cost": "4UU",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Flying",
      "Shroud (This creature can't be the target of spells or abilities.)",
      "You may look at the top card of your library any time."
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 430567,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "Essentially, Sphinx of Jwar Isle lets you play with the top card of your library revealed only to you. Knowing what that card is becomes part of the information you have access to, just like you can look at the cards in your hand. You may look at the top card of your library whenever you want, even if you don’t have priority. This action doesn’t use the stack."
      },
      {
        "date": "10/1/2009",
        "text": "If the top card of your library changes during the process of casting a spell or activating an ability, you can’t look at the new top card until the process of casting the spell or activating the ability ends (all targets are chosen, all costs are paid, and so on)."
      }
    ]
  },
  {
    "name": "Vision Skeins",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "29",
    "illustrator": "Aleksi Briclot",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1U",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Each player draws two cards."
    ],
    "flavor_text": "\"I could see in the other mage's eyes that he'd thought of it too. Then it became a race to exploit the knowledge first.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430568,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Windrider Eel",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "30",
    "illustrator": "Austin Hsu",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Fish"
    ],
    "rarity": "Common",
    "mana_cost": "3U",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Flying",
      "Landfall — Whenever a land enters the battlefield under your control, Windrider Eel gets +2/+2 until end of turn."
    ],
    "flavor_text": "\"The best spot to hook one is right behind the gills.\"\n—Rana Cloudwake, kor skyfisher",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430569,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad’s ability, for example)."
      },
      {
        "date": "10/1/2009",
        "text": "When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."
      }
    ]
  },
  {
    "name": "Archfiend of Depravity",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "31",
    "illustrator": "Daarken",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Demon"
    ],
    "rarity": "Rare",
    "mana_cost": "3BB",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Flying",
      "At the beginning of each opponent's end step, that player chooses up to two creatures they control, then sacrifices the rest."
    ],
    "flavor_text": "\"Why would I kill you all? Who then would be left to worship me?\"",
    "power": "5",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 430570,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "11/24/2014",
        "text": "The opponent chooses which creatures to spare, if any, as the ability resolves. This choice doesn’t target the creatures."
      },
      {
        "date": "11/24/2014",
        "text": "The opponent may choose to spare one or no creatures. If the player doesn’t choose any creatures, they will sacrifice all creatures they control."
      }
    ]
  },
  {
    "name": "Deathbringer Regent",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "32",
    "illustrator": "Adam Paquette",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Dragon"
    ],
    "rarity": "Rare",
    "mana_cost": "5BB",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Flying",
      "When Deathbringer Regent enters the battlefield, if you cast it from your hand and there are five or more other creatures on the battlefield, destroy all other creatures."
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 430571,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/25/2015",
        "text": "If you cast a creature spell that enters the battlefield as a copy of Deathbringer Regent, the enters-the-battlefield ability will trigger (assuming the “five or more other creatures” requirement is also met)."
      },
      {
        "date": "2/25/2015",
        "text": "Deathbringer Regent’s last ability destroys all creatures except Deathbringer Regent, including the five other creatures required for the ability to have an effect."
      }
    ]
  },
  {
    "name": "Doom Blade",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "33",
    "illustrator": "Chippy",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "1B",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Destroy target nonblack creature."
    ],
    "flavor_text": "The void is without substance but cuts like steel.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430572,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Harvester of Souls",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "34",
    "illustrator": "Slawomir Maniak",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Demon"
    ],
    "rarity": "Rare",
    "mana_cost": "4BB",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Deathtouch",
      "Whenever another nontoken creature dies, you may draw a card."
    ],
    "flavor_text": "\"He is judge, jury, and executioner because he killed them all.\"\n—Bishop Cawle of Elgaud",
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 430573,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Nightscape Familiar",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "35",
    "illustrator": "Jeff Easley",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Zombie"
    ],
    "rarity": "Common",
    "mana_cost": "1B",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Blue spells and red spells you cast cost {1} less to cast.",
      "{1}{B}: Regenerate Nightscape Familiar."
    ],
    "flavor_text": "Nightscape masters don't stop at raising the spirit of a fallen battlemage. They raise the flesh along with it.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430574,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "If a spell is both blue and red, you pay {1} less, not {2} less."
      },
      {
        "date": "10/4/2004",
        "text": "The generic X cost is still considered generic even if there is a requirement that a specific color be used for it. For example, “only black mana can be spent this way”. This distinction is important for effects which reduce the generic portion of a spell’s cost."
      },
      {
        "date": "10/4/2004",
        "text": "This can lower the cost to zero, but not below zero."
      },
      {
        "date": "10/4/2004",
        "text": "The effect is cumulative."
      },
      {
        "date": "10/4/2004",
        "text": "The lower cost is not optional like with some other cost reducers."
      },
      {
        "date": "10/4/2004",
        "text": "Can never affect the colored part of the cost."
      },
      {
        "date": "10/4/2004",
        "text": "If this card is sacrificed to pay part of a spell’s cost, the cost reduction still applies."
      }
    ]
  },
  {
    "name": "Overseer of the Damned",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "36",
    "illustrator": "rk post",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Demon"
    ],
    "rarity": "Rare",
    "mana_cost": "5BB",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Flying",
      "When Overseer of the Damned enters the battlefield, you may destroy target creature.",
      "Whenever a nontoken creature an opponent controls dies, create a tapped 2/2 black Zombie creature token."
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 430575,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Reckless Spite",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "37",
    "illustrator": "Karl Kopinski",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "1BB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Destroy two target nonblack creatures. You lose 5 life."
    ],
    "flavor_text": "\"The end is justified in being mean. Or something like that.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430576,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Vampire Nighthawk",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "38",
    "illustrator": "Jason Chan",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Vampire",
      "Shaman"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1BB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying, deathtouch, lifelink"
    ],
    "flavor_text": "As they fought the Eldrazi, many vampires learned to live among humans. Others were unable to make the adjustment.",
    "power": "2",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 430577,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Avatar of Fury",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "39",
    "illustrator": "rk post",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Avatar"
    ],
    "rarity": "Rare",
    "mana_cost": "6RR",
    "converted_mana_cost": 8,
    "oracle_text": [
      "If an opponent controls seven or more lands, this spell costs {6} less to cast.",
      "Flying",
      "{R}: Avatar of Fury gets +1/+0 until end of turn."
    ],
    "flavor_text": null,
    "power": "6",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 430578,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "The converted mana cost of this card is still 8, even if you only pay {R}{R} to cast it."
      }
    ]
  },
  {
    "name": "Battle-Rattle Shaman",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "40",
    "illustrator": "Warren Mahy",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Goblin",
      "Shaman"
    ],
    "rarity": "Common",
    "mana_cost": "3R",
    "converted_mana_cost": 4,
    "oracle_text": [
      "At the beginning of combat on your turn, you may have target creature get +2/+0 until end of turn."
    ],
    "flavor_text": "The shaman rattles not to inspire a battle fury but to drown out the shrieks of those fleeing the Eldrazi.",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430579,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/14/2017",
        "text": "Battle-Rattle Shaman’s ability triggers when the beginning of combat step starts during each of your turns. It resolves before you declare attackers."
      },
      {
        "date": "3/14/2017",
        "text": "If a spell or ability causes your turn to have multiple combat phases, Battle Rattle Shaman’s ability triggers during each of them."
      }
    ]
  },
  {
    "name": "Blood Ogre",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "41",
    "illustrator": "Christopher Moeller",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Ogre",
      "Warrior"
    ],
    "rarity": "Common",
    "mana_cost": "2R",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Bloodthirst 1 (If an opponent was dealt damage this turn, this creature enters the battlefield with a +1/+1 counter on it.)",
      "First strike (This creature deals combat damage before creatures without first strike.)"
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430580,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Chandra, Pyromaster",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "42",
    "illustrator": "Chris Rahn",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Chandra"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2RR",
    "converted_mana_cost": 4,
    "oracle_text": [
      "+1: Chandra, Pyromaster deals 1 damage to target player or planeswalker and 1 damage to up to one target creature that player or that planeswalker's controller controls. That creature can't block this turn.",
      "0: Exile the top card of your library. You may play it this turn.",
      "−7: Exile the top ten cards of your library. Choose an instant or sorcery card exiled this way and copy it three times. You may cast the copies without paying their mana costs."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "4",
    "multiverse_id": 430581,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/18/2014",
        "text": "To activate the first ability, you must target a player but you can choose to not target any creatures."
      },
      {
        "date": "7/18/2014",
        "text": "If the first ability resolves but the damage is prevented or redirected, the target creature still won’t be able to block that turn."
      },
      {
        "date": "7/18/2014",
        "text": "The card exiled by the second ability is exiled face up. Playing it follows the normal rules for playing that card. You must pay its costs, and you must follow all applicable timing rules. For example, if it’s a creature card, you can cast it only during your main phase while the stack is empty."
      },
      {
        "date": "7/18/2014",
        "text": "If you exile a land card using the second ability, you may play that land only if you have any available land plays. Normally, this means you can play the land only if you haven’t played a land yet that turn."
      },
      {
        "date": "7/18/2014",
        "text": "In the third ability, “exiled this way” means the cards you just exiled because of that ability resolving. Cards exiled with the second ability or with previous activations of the third ability don’t count."
      },
      {
        "date": "7/18/2014",
        "text": "While resolving the third ability, you create the copies of the card in exile and cast them from exile. You can cast zero, one, two, or all three copies. The card itself isn’t cast. It remains exiled."
      },
      {
        "date": "7/18/2014",
        "text": "While casting the copies created by the third ability, timing restrictions based on the card’s type (such as creature or sorcery) are ignored. Other restrictions, such as “Cast [this spell] only during combat,” are not."
      },
      {
        "date": "7/18/2014",
        "text": "Because you’re casting the copies “without paying their mana costs,” you can’t pay any alternative costs for the copies. You can pay additional costs, such as kicker costs. If the copies have any mandatory additional costs, you must pay those."
      },
      {
        "date": "7/18/2014",
        "text": "If the copied card has {X} in its mana cost, you must choose 0 as its value when casting the copies."
      }
    ]
  },
  {
    "name": "Chandra's Outrage",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "43",
    "illustrator": "Christopher Moeller",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "2RR",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Chandra's Outrage deals 4 damage to target creature and 2 damage to that creature's controller."
    ],
    "flavor_text": "Chandra never believed in using her \"inside voice.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430582,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/16/2018",
        "text": "If the target creature is an illegal target by the time Chandra’s Outrage resolves, the spell doesn’t resolve. No player is dealt damage."
      }
    ]
  },
  {
    "name": "Chandra's Phoenix",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "44",
    "illustrator": "Aleksi Briclot",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Phoenix"
    ],
    "rarity": "Rare",
    "mana_cost": "1RR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flying",
      "Haste (This creature can attack and {T} as soon as it comes under your control.)",
      "Whenever an opponent is dealt damage by a red instant or sorcery spell you control or by a red planeswalker you control, return Chandra's Phoenix from your graveyard to your hand."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430583,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Coordinated Assault",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "45",
    "illustrator": "John Severin Brassell",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "R",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Up to two target creatures each get +1/+0 and gain first strike until end of turn."
    ],
    "flavor_text": "It's hard to shout \"Shields up!\" with a javelin in your chest.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430584,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Dualcaster Mage",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "46",
    "illustrator": "Matt Stewart",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Rare",
    "mana_cost": "1RR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Flash",
      "When Dualcaster Mage enters the battlefield, copy target instant or sorcery spell. You may choose new targets for the copy."
    ],
    "flavor_text": "\"It has been my experience that disasters like to strike in pairs.\"",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430585,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/8/2016",
        "text": "Dualcaster Mage’s triggered ability can target (and copy) any instant or sorcery spell, not just one with targets. It doesn’t matter who controls it."
      },
      {
        "date": "6/8/2016",
        "text": "As Dualcaster Mage’s triggered ability resolves, it creates a copy of a spell on the stack. The copy isn’t cast, so abilities that trigger when a player casts a spell won’t trigger."
      },
      {
        "date": "6/8/2016",
        "text": "The copy will have the same targets as the spell it’s copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can’t choose a new legal target, then it remains unchanged (even if the current target is illegal)."
      },
      {
        "date": "6/8/2016",
        "text": "You can’t choose to pay any additional costs for the copy. However, effects based on any additional or alternative costs paid for the targeted spell are copied as though those same costs were paid for the copy."
      },
      {
        "date": "6/8/2016",
        "text": "If the spell is modal (that is, it says “Choose one —” or the like), the copy will have the same mode. You can’t choose a different one."
      },
      {
        "date": "6/8/2016",
        "text": "If the spell has an X whose value was determined as it was cast (like Earthquake does), the copy has the same value of X."
      },
      {
        "date": "6/8/2016",
        "text": "If the copy says that it affects “you,” it affects the controller of the copy, not the controller of the original spell. Similarly, if the copy says that it affects an “opponent,” it affects an opponent of the copy’s controller, not an opponent of the original spell’s controller."
      }
    ]
  },
  {
    "name": "Fiery Fall",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "47",
    "illustrator": "Daarken",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "5R",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Fiery Fall deals 5 damage to target creature.",
      "Basic landcycling {1}{R} ({1}{R}, Discard this card: Search your library for a basic land card, reveal it, put it into your hand, then shuffle your library.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430586,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2009",
        "text": "Unlike the normal cycling ability, basic landcycling doesn’t allow you to draw a card. Instead, it lets you search your library for a basic land card. You don’t choose the type of basic land card you’ll find until you’re performing the search. After you choose a basic land card in your library, you reveal it, put it into your hand, then shuffle your library."
      },
      {
        "date": "2/1/2009",
        "text": "Basic landcycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on a card being basic landcycled. Any ability that stops a cycling ability from being activated also stops a basic landcycling ability from being activated."
      },
      {
        "date": "2/1/2009",
        "text": "Basic landcycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with basic landcycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "2/1/2009",
        "text": "You can choose not to find a basic land card, even if there is one in your library."
      }
    ]
  },
  {
    "name": "Flametongue Kavu",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "48",
    "illustrator": "Slawomir Maniak",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Kavu"
    ],
    "rarity": "Uncommon",
    "mana_cost": "3R",
    "converted_mana_cost": 4,
    "oracle_text": [
      "When Flametongue Kavu enters the battlefield, it deals 4 damage to target creature."
    ],
    "flavor_text": "\"For dim-witted, thick-skulled genetic mutants, they have pretty good aim.\"\n—Sisay, captain of the Weatherlight",
    "power": "4",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430587,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "If it enters the battlefield as the only targetable creature, it must target itself."
      }
    ]
  },
  {
    "name": "Gorehorn Minotaurs",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "49",
    "illustrator": "Wayne Reynolds",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Minotaur",
      "Warrior"
    ],
    "rarity": "Common",
    "mana_cost": "2RR",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Bloodthirst 2 (If an opponent was dealt damage this turn, this creature enters the battlefield with two +1/+1 counters on it.)"
    ],
    "flavor_text": "Some of the eleven minotaur clans of Mirtiin are expert crafters and learned philosophers. Others just like to hit stuff.",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 430588,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Grim Lavamancer",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "50",
    "illustrator": "Michael Sutfin",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Rare",
    "mana_cost": "R",
    "converted_mana_cost": 1,
    "oracle_text": [
      "{R}, {T}, Exile two cards from your graveyard: Grim Lavamancer deals 2 damage to any target."
    ],
    "flavor_text": "\"Fools dig for water, corpses, or gold. The earth's real treasure is far deeper.\"",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430589,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "9/22/2011",
        "text": "The two cards are exiled as the cost of Grim Lavamancer’s ability is paid. Players can’t respond to the paying of costs by trying to move those cards to another zone."
      }
    ]
  },
  {
    "name": "Guttersnipe",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "51",
    "illustrator": "Steve Prescott",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Goblin",
      "Shaman"
    ],
    "rarity": "Uncommon",
    "mana_cost": "2R",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Whenever you cast an instant or sorcery spell, Guttersnipe deals 2 damage to each opponent."
    ],
    "flavor_text": "He wants to watch Ravnica burn, one soul at a time.",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 430590,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/13/2018",
        "text": "Guttersnipe’s triggered ability resolves before the spell that caused it to trigger. It resolves even if that spell is countered."
      },
      {
        "date": "7/13/2018",
        "text": "In a Two-Headed Giant game, Guttersnipe’s ability causes the opposing team to lose 4 life."
      }
    ]
  },
  {
    "name": "Hammerhand",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "52",
    "illustrator": "Tomasz Jedruszek",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Common",
    "mana_cost": "R",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Enchant creature",
      "When Hammerhand enters the battlefield, target creature can't block this turn.",
      "Enchanted creature gets +1/+1 and has haste. (It can attack and {T} no matter when it came under your control.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430591,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Inferno Titan",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "53",
    "illustrator": "Kev Walker",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Giant"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4RR",
    "converted_mana_cost": 6,
    "oracle_text": [
      "{R}: Inferno Titan gets +1/+0 until end of turn.",
      "Whenever Inferno Titan enters the battlefield or attacks, it deals 3 damage divided as you choose among one, two, or three targets."
    ],
    "flavor_text": null,
    "power": "6",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 430592,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "8/15/2010",
        "text": "You divide the damage as you put Inferno Titan’s triggered ability on the stack, not as it resolves. Each target must be assigned at least 1 damage. (In other words, as you put the ability on the stack, you choose whether to have it deal 3 damage to a single target, 2 damage to one target and 1 damage to another target, or 1 damage to each of three targets.)"
      }
    ]
  },
  {
    "name": "Lightning Bolt",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "54",
    "illustrator": "Christopher Moeller",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "R",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Lightning Bolt deals 3 damage to any target."
    ],
    "flavor_text": "The sparkmage shrieked, calling on the rage of the storms of his youth. To his surprise, the sky responded with a fierce energy he'd never thought to see again.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430593,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Obsidian Fireheart",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "55",
    "illustrator": "Raymond Swanland",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "1RRR",
    "converted_mana_cost": 4,
    "oracle_text": [
      "{1}{R}{R}: Put a blaze counter on target land without a blaze counter on it. For as long as that land has a blaze counter on it, it has \"At the beginning of your upkeep, this land deals 1 damage to you.\" (The land continues to burn after Obsidian Fireheart has left the battlefield.)"
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 430594,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "As the reminder text indicates, whether the targeted land has the triggered ability that’s been granted to it depends only on whether it has a blaze counter on it, not on whether Obsidian Fireheart is still on the battlefield."
      },
      {
        "date": "10/1/2009",
        "text": "The ability gained by the land triggers at the beginning of the upkeep of the land’s controller, not the beginning of the upkeep of Obsidian Fireheart’s controller. The player who controls the land at the time the ability triggers is the one who’s dealt damage."
      },
      {
        "date": "10/1/2009",
        "text": "A land with a blaze counter on it is an illegal target for this ability. You may activate the ability targeting a land, then activate the ability in response to itself targeting the same land. Although the first ability to resolve will put a blaze counter on that land, the second ability to resolve won’t resolve."
      },
      {
        "date": "10/1/2009",
        "text": "If all blaze counters on a land are moved to a different land, the triggered ability doesn’t follow them. The first land no longer has the ability because it no longer has a blaze counter on it. The second land doesn’t have the ability because Obsidian Fireheart didn’t target it."
      },
      {
        "date": "10/1/2009",
        "text": "If a land ends up with more than one blaze counter on it (thanks to Doubling Season or Gilder Bairn, for example), the ability still only causes it to deal 1 damage to its controller each turn."
      }
    ]
  },
  {
    "name": "Searing Spear",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "56",
    "illustrator": "Chris Rahn",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1R",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Searing Spear deals 3 damage to any target."
    ],
    "flavor_text": "Sometimes you die a glorious death with your sword held high. Sometimes you're just target practice.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430595,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Skarrgan Firebird",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "57",
    "illustrator": "Kev Walker",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Phoenix"
    ],
    "rarity": "Uncommon",
    "mana_cost": "4RR",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Bloodthirst 3 (If an opponent was dealt damage this turn, this creature enters the battlefield with three +1/+1 counters on it.)",
      "Flying",
      "{R}{R}{R}: Return Skarrgan Firebird from your graveyard to your hand. Activate this ability only if an opponent was dealt damage this turn."
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 430596,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2006",
        "text": "You can activate Skarrgan Firebird’s last ability if an opponent was dealt damage by any source, even if you didn’t control that source."
      }
    ]
  },
  {
    "name": "Stormblood Berserker",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "58",
    "illustrator": "Min Yum",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Berserker"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1R",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Bloodthirst 2 (If an opponent was dealt damage this turn, this creature enters the battlefield with two +1/+1 counters on it.)",
      "Menace (This creature can't be blocked except by two or more creatures.)"
    ],
    "flavor_text": "Blood is holy to those whose god is War.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430597,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Sudden Demise",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "59",
    "illustrator": "Dan Scott",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "XR",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Choose a color. Sudden Demise deals X damage to each creature of the chosen color."
    ],
    "flavor_text": "In the Skyfang Mountains, one misstep can mean the end of an entire clan.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430598,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/17/2013",
        "text": "You choose the value for X as you cast Sudden Demise. You don’t choose the color until it resolves."
      },
      {
        "date": "10/17/2013",
        "text": "Sudden Demise will deal damage to a multicolored creature if one of its colors is the chosen color."
      }
    ]
  },
  {
    "name": "Torchling",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "60",
    "illustrator": "rk post",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Shapeshifter"
    ],
    "rarity": "Rare",
    "mana_cost": "3RR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "{R}: Untap Torchling.",
      "{R}: Target creature blocks Torchling this turn if able.",
      "{R}: Change the target of target spell that targets only Torchling.",
      "{1}: Torchling gets +1/-1 until end of turn.",
      "{1}: Torchling gets -1/+1 until end of turn."
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 430599,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2007",
        "text": "When the third ability resolves, you must change the target if able. If you can’t choose a legal target for the spell when this ability resolves, that spell’s target doesn’t change."
      },
      {
        "date": "2/1/2007",
        "text": "If a spell targets multiple things, you can’t target it with Torchling’s third ability, even if all but one of those targets has become illegal."
      },
      {
        "date": "2/1/2007",
        "text": "If a spell has multiple targets, but it’s targeting Torchling with all of them (such as Seeds of Strength targeting Torchling three times), you can target that spell with Torchling’s third ability. In that case, you change all of those targets to the same new target, as long as it meets each of the spell’s targeting conditions."
      }
    ]
  },
  {
    "name": "Volcanic Geyser",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "61",
    "illustrator": "Clint Cearley",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "XRR",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Volcanic Geyser deals X damage to any target."
    ],
    "flavor_text": "\"The common folk call it the breaking of the crust or the spilling of fire. Geomancers call it target practice.\"\n—Ryda, geomancer",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430600,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Cultivate",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "62",
    "illustrator": "Anthony Palumbo",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "2G",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Search your library for up to two basic land cards, reveal those cards, and put one onto the battlefield tapped and the other into your hand. Then shuffle your library."
    ],
    "flavor_text": "All seeds share a common bond, calling to each other across infinity.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430601,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "8/15/2010",
        "text": "If you choose to find only one basic land card, you put it onto the battlefield tapped."
      }
    ]
  },
  {
    "name": "Explore",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "63",
    "illustrator": "John Avon",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1G",
    "converted_mana_cost": 2,
    "oracle_text": [
      "You may play an additional land this turn.",
      "Draw a card."
    ],
    "flavor_text": "An explorer's reward is a view of tomorrow's possibilities.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430602,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/14/2017",
        "text": "Explore’s effect allows you to play an additional land during your main phase. Doing so follows the normal timing rules for playing lands. In particular, you don’t get to play a land as Explore resolves; Explore fully resolves first and you draw a card, perhaps a land you’ll play later."
      },
      {
        "date": "3/14/2017",
        "text": "The effects of multiple Explores in the same turn are cumulative. They’re also cumulative with other effects that let you play additional lands, such as the one from Urban Evolution."
      },
      {
        "date": "3/14/2017",
        "text": "If you somehow manage to cast Explore when it’s not your turn, you’ll draw a card when it resolves, but you won’t be able to play a land that turn."
      }
    ]
  },
  {
    "name": "Fertilid",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "64",
    "illustrator": "Wayne Reynolds",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Common",
    "mana_cost": "2G",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Fertilid enters the battlefield with two +1/+1 counters on it.",
      "{1}{G}, Remove a +1/+1 counter from Fertilid: Target player searches their library for a basic land card, puts it onto the battlefield tapped, then shuffles their library."
    ],
    "flavor_text": null,
    "power": "0",
    "toughness": "0",
    "loyalty": null,
    "multiverse_id": 430603,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "4/1/2008",
        "text": "Although the targeted player doesn’t need to find a basic land card if they don’t want to, that player must shuffle their library."
      }
    ]
  },
  {
    "name": "Forgotten Ancient",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "65",
    "illustrator": "Mark Tedin",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Rare",
    "mana_cost": "3G",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Whenever a player casts a spell, you may put a +1/+1 counter on Forgotten Ancient.",
      "At the beginning of your upkeep, you may move any number of +1/+1 counters from Forgotten Ancient onto other creatures."
    ],
    "flavor_text": "Its blood is life. Its body is growth.",
    "power": "0",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 430604,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "It does not get counters for copies of spells (as with Storm), just for spells that are actually cast."
      },
      {
        "date": "10/4/2004",
        "text": "The moving of counters is not a targeted ability."
      },
      {
        "date": "10/4/2004",
        "text": "You decide how many counters to move and where to move them when the ability resolves."
      },
      {
        "date": "10/4/2004",
        "text": "Putting on a counter is optional. If you forget to do so, it means you chose not to do so."
      }
    ]
  },
  {
    "name": "Hunter's Prowess",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "66",
    "illustrator": "Greg Staples",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "4G",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Until end of turn, target creature gets +3/+3 and gains trample and \"Whenever this creature deals combat damage to a player, draw that many cards.\""
    ],
    "flavor_text": "To be counted among the warriors of Setessa's Leina Tower, you must not fear death, only failure.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430605,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Khalni Heart Expedition",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "67",
    "illustrator": "Jason Chan",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "1G",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Landfall — Whenever a land enters the battlefield under your control, you may put a quest counter on Khalni Heart Expedition.",
      "Remove three quest counters from Khalni Heart Expedition and sacrifice it: Search your library for up to two basic land cards, put them onto the battlefield tapped, then shuffle your library."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430606,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad’s ability, for example)."
      },
      {
        "date": "10/1/2009",
        "text": "When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."
      }
    ]
  },
  {
    "name": "Nissa, Worldwaker",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "68",
    "illustrator": "Chris Rahn",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Nissa"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3GG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "+1: Target land you control becomes a 4/4 Elemental creature with trample. It's still a land.",
      "+1: Untap up to four target Forests.",
      "−7: Search your library for any number of basic land cards, put them onto the battlefield, then shuffle your library. Those lands become 4/4 Elemental creatures with trample. They're still lands."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "3",
    "multiverse_id": 430607,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/18/2014",
        "text": "The type-changing effects of the first and third abilities don’t have a duration. They last indefinitely."
      },
      {
        "date": "7/18/2014",
        "text": "If the land targeted by the first ability entered the battlefield this turn, it won’t be able to attack and its activated abilities with {T} in the cost (including its mana ability) can’t be activated (unless something gives it haste). The same is true for the lands put onto the battlefield with the third ability."
      }
    ]
  },
  {
    "name": "Oran-Rief Hydra",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "69",
    "illustrator": "Chris Rahn",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Hydra"
    ],
    "rarity": "Rare",
    "mana_cost": "4GG",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Trample",
      "Landfall — Whenever a land enters the battlefield under your control, put a +1/+1 counter on Oran-Rief Hydra. If that land is a Forest, put two +1/+1 counters on Oran-Rief Hydra instead."
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 430608,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "8/25/2015",
        "text": "A landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability puts a land onto the battlefield under your control."
      },
      {
        "date": "8/25/2015",
        "text": "When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one to resolve."
      },
      {
        "date": "8/25/2015",
        "text": "If the ability has an additional or replacement effect that depends on the land having a certain basic land type, the ability will check that land’s type as the ability resolves. If, at that time, the land that entered the battlefield is no longer on the battlefield, use its types when it left the battlefield to determine what happens."
      }
    ]
  },
  {
    "name": "Press the Advantage",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "70",
    "illustrator": "Marco Nelor",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "2GG",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Up to two target creatures each get +2/+2 and gain trample until end of turn."
    ],
    "flavor_text": "\"Show your enemies as much mercy as they would show you.\"\n—Surrak, the Hunt Caller",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430609,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/25/2015",
        "text": "If you cast Press the Advantage with two targets, and only one of them is still a legal target as Press the Advantage resolves, that target will get +2/+2 and gain trample. Press the Advantage will have no effect on the illegal target."
      }
    ]
  },
  {
    "name": "Rampaging Baloths",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "71",
    "illustrator": "Steve Prescott",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4GG",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Trample",
      "Landfall — Whenever a land enters the battlefield under your control, you may create a 4/4 green Beast creature token."
    ],
    "flavor_text": "\"When the land is angry, so are they.\"\n—Nissa Revane",
    "power": "6",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 430610,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad’s ability, for example)."
      },
      {
        "date": "10/1/2009",
        "text": "When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."
      }
    ]
  },
  {
    "name": "Retreat to Kazandu",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "72",
    "illustrator": "Kieran Yanner",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "2G",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Landfall — Whenever a land enters the battlefield under your control, choose one —",
      "• Put a +1/+1 counter on target creature.",
      "• You gain 2 life."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430611,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "8/25/2015",
        "text": "A landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability puts a land onto the battlefield under your control."
      },
      {
        "date": "8/25/2015",
        "text": "When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one to resolve."
      },
      {
        "date": "8/25/2015",
        "text": "If the ability has an additional or replacement effect that depends on the land having a certain basic land type, the ability will check that land’s type as the ability resolves. If, at that time, the land that entered the battlefield is no longer on the battlefield, use its types when it left the battlefield to determine what happens."
      }
    ]
  },
  {
    "name": "Scute Mob",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "73",
    "illustrator": "Zoltan Boros & Gabor Szikszai",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Insect"
    ],
    "rarity": "Rare",
    "mana_cost": "G",
    "converted_mana_cost": 1,
    "oracle_text": [
      "At the beginning of your upkeep, if you control five or more lands, put four +1/+1 counters on Scute Mob."
    ],
    "flavor_text": "\"Survival rule 781: There are always more scute bugs.\"\n—Zurdi, goblin shortcutter",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430612,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "Scute Mob’s ability has an “intervening ‘if’ clause.” That means (1) the ability won’t trigger at all unless you control five or more lands as your upkeep starts, and (2) the ability will do nothing if you control fewer than five lands by the time it resolves."
      }
    ]
  },
  {
    "name": "Sylvan Bounty",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "74",
    "illustrator": "Chris Rahn",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "5G",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Target player gains 8 life.",
      "Basic landcycling {1}{G} ({1}{G}, Discard this card: Search your library for a basic land card, reveal it, put it into your hand, then shuffle your library.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430613,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2009",
        "text": "Unlike the normal cycling ability, basic landcycling doesn’t allow you to draw a card. Instead, it lets you search your library for a basic land card. You don’t choose the type of basic land card you’ll find until you’re performing the search. After you choose a basic land card in your library, you reveal it, put it into your hand, then shuffle your library."
      },
      {
        "date": "2/1/2009",
        "text": "Basic landcycling is a form of cycling. Any ability that triggers on a card being cycled also triggers on a card being basic landcycled. Any ability that stops a cycling ability from being activated also stops a basic landcycling ability from being activated."
      },
      {
        "date": "2/1/2009",
        "text": "Basic landcycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with basic landcycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "2/1/2009",
        "text": "You can choose not to find a basic land card, even if there is one in your library."
      }
    ]
  },
  {
    "name": "Thragtusk",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "75",
    "illustrator": "Nils Hamm",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Beast"
    ],
    "rarity": "Rare",
    "mana_cost": "4G",
    "converted_mana_cost": 5,
    "oracle_text": [
      "When Thragtusk enters the battlefield, you gain 5 life.",
      "When Thragtusk leaves the battlefield, create a 3/3 green Beast creature token."
    ],
    "flavor_text": "\"Always carry two spears.\"\n—Mokgar, Kalonian hunter",
    "power": "5",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 430614,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/1/2012",
        "text": "Thragtusk’s second ability will trigger no matter what zone Thragtusk goes to."
      }
    ]
  },
  {
    "name": "Turntimber Basilisk",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "76",
    "illustrator": "Goran Josic",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Basilisk"
    ],
    "rarity": "Uncommon",
    "mana_cost": "1GG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Deathtouch (Any amount of damage this deals to a creature is enough to destroy it.)",
      "Landfall — Whenever a land enters the battlefield under your control, you may have target creature block Turntimber Basilisk this turn if able."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430615,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "The landfall ability triggers whenever a land enters the battlefield under your control for any reason. It triggers whenever you play a land, as well as whenever a spell or ability (such as Rampant Growth) causes you to put a land onto the battlefield under your control. It will even trigger when a spell or ability causes another player to put a land onto the battlefield under your control (as can happen with Yavimaya Dryad’s ability, for example)."
      },
      {
        "date": "10/1/2009",
        "text": "When a land enters the battlefield under your control, each landfall ability of the permanents you control will trigger. You can put them on the stack in any order. The last ability you put on the stack will be the first one that resolves."
      },
      {
        "date": "10/1/2009",
        "text": "You decide whether to have the targeted creature block Turntimber Basilisk this turn if able at the time the landfall ability resolves, not at the time Turntimber Basilisk attacks."
      },
      {
        "date": "10/1/2009",
        "text": "Deciding to have the targeted creature block doesn’t force you to attack with Turntimber Basilisk that turn. If Turntimber Basilisk doesn’t attack, the targeted creature is free to block whichever creature its controller chooses, or block no creatures at all."
      },
      {
        "date": "10/1/2009",
        "text": "If you choose to have the targeted creature block but that creature isn’t able to block Turntimber Basilisk (for example, because the targeted creature can block only creatures with flying), the requirement to block does nothing. The targeted creature is free to block whichever creature its controller chooses, or block no creatures at all."
      },
      {
        "date": "10/1/2009",
        "text": "Tapped creatures, creatures that can’t block as the result of an effect, creatures with unpaid costs to block (such as those from War Cadence), and creatures that aren’t controlled by the defending player are exempt from effects that would require them to block. Such creatures can be targeted by Turntimber Basilisk’s landfall ability, but the requirement to block does nothing."
      },
      {
        "date": "10/1/2009",
        "text": "If Turntimber Basilisk’s landfall ability triggers multiple times during the same turn, you can have multiple creatures block it that turn if able."
      }
    ]
  },
  {
    "name": "Vastwood Zendikon",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "77",
    "illustrator": "Rob Alexander",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Common",
    "mana_cost": "4G",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Enchant land",
      "Enchanted land is a 6/4 green Elemental creature. It's still a land.",
      "When enchanted land dies, return that card to its owner's hand."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430616,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/1/2010",
        "text": "The enchanted permanent will be both a land and a creature and can be affected by anything that affects either a land or a creature."
      },
      {
        "date": "3/1/2010",
        "text": "When a land becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
      },
      {
        "date": "3/1/2010",
        "text": "An attacking or blocking creature that stops being a creature is removed from combat. This can happen if a Zendikon enchanting an attacking or blocking creature leaves the battlefield, for example. The permanent that was removed from combat neither deals nor is dealt combat damage. Any attacking creature that the land creature was blocking remains blocked, however."
      },
      {
        "date": "3/1/2010",
        "text": "An ability that turns a land into a creature also sets that creature’s power and toughness. If the land was already a creature, this will overwrite the previous effect that set its power and toughness. Effects that modify its power or toughness, such as the effects of Disfigure or Glorious Anthem, will continue to apply, no matter when they started to take effect. The same is true for counters that change its power or toughness (such as +1/+1 counters) and effects that switch its power and toughness."
      },
      {
        "date": "3/1/2010",
        "text": "If a Zendikon and the land it’s enchanting are destroyed at the same time (due to Akroma’s Vengeance, for example), the Zendikon’s last ability will still trigger."
      },
      {
        "date": "3/1/2010",
        "text": "If a Zendikon’s last ability triggers, but the land card it refers to leaves the graveyard before it resolves, it will resolve but do nothing."
      }
    ]
  },
  {
    "name": "Vines of the Recluse",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "78",
    "illustrator": "Dan Scott",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "G",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Target creature gets +1/+2 and gains reach until end of turn. Untap it. (A creature with reach can block creatures with flying.)"
    ],
    "flavor_text": "\"The most elegant solutions are found in nature. You just have to know where to look.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430617,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "1/22/2016",
        "text": "You can target an untapped creature with Vines of the Recluse. It will still get the other bonuses."
      }
    ]
  },
  {
    "name": "Woodborn Behemoth",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "79",
    "illustrator": "Matt Stewart",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Uncommon",
    "mana_cost": "3GG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "As long as you control eight or more lands, Woodborn Behemoth gets +4/+4 and has trample. (It can deal excess combat damage to the player or planeswalker it's attacking.)"
    ],
    "flavor_text": "It carries the hopes of Zendikar's embattled wilds on its mighty boughs.",
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 430618,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Baleful Strix",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "80",
    "illustrator": "Nils Hamm",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Bird"
    ],
    "rarity": "Uncommon",
    "mana_cost": "UB",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Flying, deathtouch",
      "When Baleful Strix enters the battlefield, draw a card."
    ],
    "flavor_text": "Its beak rends flesh and bone, exposing the tender marrow of dream.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 430619,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Blood Tyrant",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "81",
    "illustrator": "Karl Kopinski",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Vampire"
    ],
    "rarity": "Rare",
    "mana_cost": "4UBR",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Flying, trample",
      "At the beginning of your upkeep, each player loses 1 life. Put a +1/+1 counter on Blood Tyrant for each 1 life lost this way.",
      "Whenever a player loses the game, put five +1/+1 counters on Blood Tyrant."
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 430620,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2009",
        "text": "Blood Tyrant’s second ability causes each player to lose 1 life, including you. Blood Tyrant will count each player’s life loss, including yours, when determining how many +1/+1 counters it gets."
      },
      {
        "date": "2/1/2009",
        "text": "Blood Tyrant’s third ability will trigger no matter how a player loses the game: due to a state-based action (as a result of having a life total of 0 or less, trying to draw a card from an empty library, or having ten poison counters), a spell or ability that says that player loses the game, a concession, or a game loss awarded by a judge."
      },
      {
        "date": "2/1/2009",
        "text": "In a multiplayer game using the limited range of influence option (such as a Grand Melee game), if a spell or ability says that you win the game, it instead causes all of your opponents within your range of influence to lose the game. This is another way by which Blood Tyrant’s third ability can trigger."
      }
    ]
  },
  {
    "name": "Cruel Ultimatum",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "82",
    "illustrator": "Todd Lockwood",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "UUBBBRR",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Target opponent sacrifices a creature, discards three cards, then loses 5 life. You return a creature card from your graveyard to your hand, draw three cards, then gain 5 life."
    ],
    "flavor_text": "There is always a greater power.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430621,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/14/2017",
        "text": "Cruel Ultimatum’s only target is an opponent. You don’t choose which creature card in your graveyard you’ll return to your hand until Cruel Ultimatum resolves."
      },
      {
        "date": "3/14/2017",
        "text": "All of the actions for Cruel Ultimatum are performed sequentially, in the order listed. Earlier actions may affect how you perform later actions. For example, if the opponent sacrifices a creature that they control but you own, it will end up in your graveyard. When Cruel Ultimatum lets you return a creature card from your graveyard to your hand, you can choose that one."
      },
      {
        "date": "3/14/2017",
        "text": "If, as Cruel Ultimatum begins to resolve, your opponent’s life total is 5 or less and you have two or fewer cards in your library, the game will result in a draw. Your opponent’s life total will drop to 0 or less, but Cruel Ultimatum must finish resolving completely before state-based actions are performed. You’ll then be forced to draw three cards and fail to draw one. When state-based actions are finally performed, you and your opponent will both lose the game at the same time, which means the game is a draw."
      }
    ]
  },
  {
    "name": "Dreadbore",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "83",
    "illustrator": "Wayne Reynolds",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "BR",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Destroy target creature or planeswalker."
    ],
    "flavor_text": "In Rakdos-controlled neighborhoods, everyone is part of the show.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430622,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Extract from Darkness",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "84",
    "illustrator": "Dallas Williams",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "3UB",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Each player puts the top two cards of their library into their graveyard. Then you put a creature card from a graveyard onto the battlefield under your control."
    ],
    "flavor_text": "If you want to wreak havoc above, sometimes it's best to look below.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430623,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/8/2016",
        "text": "Extract from Darkness doesn’t target a creature card. You choose which card you’re putting onto the battlefield as it resolves. You can choose any creature card in a graveyard at that time, including one just put into a graveyard by Extract from Darkness. If there are no creature cards in graveyards at that time, Extract from Darkness simply finishes resolving."
      }
    ]
  },
  {
    "name": "Nicol Bolas, Planeswalker",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "85",
    "illustrator": "Chris Rahn",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Bolas"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4UBBR",
    "converted_mana_cost": 8,
    "oracle_text": [
      "+3: Destroy target noncreature permanent.",
      "−2: Gain control of target creature.",
      "−9: Nicol Bolas, Planeswalker deals 7 damage to target player or planeswalker. That player or that planeswalker's controller discards seven cards, then sacrifices seven permanents."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "5",
    "multiverse_id": 430624,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2009",
        "text": "The control-change effect has no duration. It will last until the game ends or the affected creature leaves the battlefield. It may be superseded by a later control-change effect."
      },
      {
        "date": "7/1/2012",
        "text": "If the damage from Nicol Bolas’s third ability is prevented or redirected, the rest of the effect will still happen. Specifically, the number of cards discarded and permanents sacrificed isn’t tied to the amount of damage dealt."
      },
      {
        "date": "7/1/2012",
        "text": "For the third ability, if the player is an illegal target when the ability tries to resolve, the ability doesn’t resolve and none of its effects will happen. No damage will be dealt, no cards will be discarded, and no permanents will be sacrificed."
      }
    ]
  },
  {
    "name": "Slave of Bolas",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "86",
    "illustrator": "Steve Argyle",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "3{U/R}B",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Gain control of target creature. Untap that creature. It gains haste until end of turn. Sacrifice it at the beginning of the next end step."
    ],
    "flavor_text": "Nicol Bolas doesn't distinguish between servants and victims.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430625,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "You may target a creature you already control."
      },
      {
        "date": "5/1/2009",
        "text": "If you don’t control the targeted creature when the “at end of turn” ability resolves, it won’t be sacrificed. If it’s still on the battlefield but under another player’s control, the ability won’t try to have you sacrifice it again at the end of the turn after that."
      }
    ]
  },
  {
    "name": "Soul Ransom",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "87",
    "illustrator": "Steve Argyle",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Uncommon",
    "mana_cost": "2UB",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Enchant creature",
      "You control enchanted creature.",
      "Discard two cards: Soul Ransom's controller sacrifices it, then draws two cards. Only any opponent may activate this ability."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430626,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/14/2017",
        "text": "In most cases, you’ll enchant a creature controlled by an opponent, which will cause you to gain control of that creature. Any of your opponents can activate the last ability of Soul Ransom by discarding two cards. When that ability resolves, you’ll sacrifice Soul Ransom and draw two cards."
      },
      {
        "date": "3/14/2017",
        "text": "You’ll draw two cards even if you can’t sacrifice Soul Ransom, perhaps because it left the battlefield in response to Soul Ransom’s ability."
      }
    ]
  },
  {
    "name": "Obelisk of Grixis",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "88",
    "illustrator": "Nils Hamm",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": "3",
    "converted_mana_cost": 3,
    "oracle_text": [
      "{T}: Add {U}, {B}, or {R}."
    ],
    "flavor_text": "Like most features of Grixis, the obelisks that remain from the time of Alara now exist only for dark exploitation.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430627,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Sword of the Animist",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "89",
    "illustrator": "Daniel Ljunggren",
    "types": [
      "Artifact"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Equipment"
    ],
    "rarity": "Rare",
    "mana_cost": "2",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Equipped creature gets +1/+1.",
      "Whenever equipped creature attacks, you may search your library for a basic land card, put it onto the battlefield tapped, then shuffle your library.",
      "Equip {2}"
    ],
    "flavor_text": "The blade glows only for Zendikar's chosen.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430628,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Talisman of Dominance",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "90",
    "illustrator": "Mike Dringenberg",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "2",
    "converted_mana_cost": 2,
    "oracle_text": [
      "{T}: Add {C}.",
      "{T}: Add {U} or {B}. Talisman of Dominance deals 1 damage to you."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430629,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Talisman of Indulgence",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "91",
    "illustrator": "Mike Dringenberg",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": "2",
    "converted_mana_cost": 2,
    "oracle_text": [
      "{T}: Add {C}.",
      "{T}: Add {B} or {R}. Talisman of Indulgence deals 1 damage to you."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430630,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Crumbling Necropolis",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "92",
    "illustrator": "Dave Kendall",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Uncommon",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Crumbling Necropolis enters the battlefield tapped.",
      "{T}: Add {U}, {B}, or {R}."
    ],
    "flavor_text": "\"They say the ruins of Sedraxis were once a shining capital in Vithia. Now it is a blight, a place to be avoided by the living.\"\n—Olcot, Rider of Joffik",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430631,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Dragonskull Summit",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "93",
    "illustrator": "Jon Foster",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Dragonskull Summit enters the battlefield tapped unless you control a Swamp or a Mountain.",
      "{T}: Add {B} or {R}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430632,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "This checks for lands you control with the land type Swamp or Mountain, not for lands named Swamp or Mountain. The lands it checks for don’t have to be basic lands. For example, if you control Stomping Ground (a nonbasic land with the land types Mountain and Forest), Dragonskull Summit will enter the battlefield untapped."
      },
      {
        "date": "10/1/2009",
        "text": "As this is entering the battlefield, it checks for lands that are already on the battlefield. It won’t see lands that are entering the battlefield at the same time (due to Warp World, for example)."
      }
    ]
  },
  {
    "name": "Drowned Catacomb",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "94",
    "illustrator": "Dave Kendall",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Drowned Catacomb enters the battlefield tapped unless you control an Island or a Swamp.",
      "{T}: Add {U} or {B}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430633,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "This checks for lands you control with the land type Island or Swamp, not for lands named Island or Swamp. The lands it checks for don’t have to be basic lands. For example, if you control Blood Crypt (a nonbasic land with the land types Swamp and Mountain), Drowned Catacomb will enter the battlefield untapped."
      },
      {
        "date": "10/1/2009",
        "text": "As this is entering the battlefield, it checks for lands that are already on the battlefield. It won’t see lands that are entering the battlefield at the same time (due to Warp World, for example)."
      }
    ]
  },
  {
    "name": "Grixis Panorama",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "95",
    "illustrator": "Nils Hamm",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "{T}: Add {C}.",
      "{1}, {T}, Sacrifice Grixis Panorama: Search your library for a basic Island, Swamp, or Mountain card and put it onto the battlefield tapped. Then shuffle your library."
    ],
    "flavor_text": "There is no height above Grixis that is free from the stench of death.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430634,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Smoldering Spires",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "96",
    "illustrator": "Rob Alexander",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Common",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Smoldering Spires enters the battlefield tapped.",
      "When Smoldering Spires enters the battlefield, target creature can't block this turn.",
      "{T}: Add {R}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430635,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Plains",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "97",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Plains"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {W}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430636,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Plains",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "102",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Plains"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {W}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430641,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Island",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "98",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Island"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {U}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430637,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Island",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "103",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Island"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {U}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430642,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Swamp",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "99",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Swamp"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {B}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430638,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Swamp",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "104",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Swamp"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {B}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430643,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Mountain",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "100",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Mountain"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {R}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430639,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Mountain",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "105",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Mountain"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {R}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430644,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Forest",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "101",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Forest"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {G}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430640,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Forest",
    "set_name": "Archenemy: Nicol Bolas",
    "collector_num": "106",
    "illustrator": "Christine Choi",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Basic"
    ],
    "subtypes": [
      "Forest"
    ],
    "rarity": "Land",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "({T}: Add {G}.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 430645,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  }
]
