[
  {
    "name": "Elspeth, Knight-Errant",
    "set_name": "Guilds of Ravnica Mythic Edition",
    "collector_num": "1",
    "illustrator": "Zack Stella",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Elspeth"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2WW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "+1: Create a 1/1 white Soldier creature token.",
      "+1: Target creature gets +3/+3 and gains flying until end of turn.",
      "−8: You get an emblem with \"Artifacts, creatures, enchantments, and lands you control have indestructible.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "4",
    "multiverse_id": 456589,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "1/1/2011",
        "text": "Emblems behave similarly to enchantments: They have an ability that, in a general sense, continually affects the game. The primary difference between them is that emblems aren’t permanents and don’t exist on the battlefield. Nothing in the game can remove an emblem, simply because no other spell or ability references them. Once you get an emblem, you keep it for the rest of the game. Emblems have no color, name, card type, or other characteristics beyond the listed ability."
      },
      {
        "date": "7/1/2013",
        "text": "Lethal damage and effects that say “destroy” won’t cause a permanent with indestructible to be put into the graveyard. However, a permanent with indestructible can be put into the graveyard for a number of reasons. The most likely reasons are if it’s sacrificed, if it’s a creature whose toughness is 0 or less, or if it’s an Aura that’s either unattached or attached to something illegal."
      }
    ]
  },
  {
    "name": "Liliana, the Last Hope",
    "set_name": "Guilds of Ravnica Mythic Edition",
    "collector_num": "2",
    "illustrator": "Kieran Yanner",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Liliana"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "1BB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "+1: Up to one target creature gets -2/-1 until your next turn.",
      "−2: Mill two cards, then you may return a creature card from your graveyard to your hand.",
      "−7: You get an emblem with \"At the beginning of your end step, create X 2/2 black Zombie creature tokens, where X is two plus the number of Zombies you control.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "3",
    "multiverse_id": 456590,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/13/2016",
        "text": "You can activate Liliana’s first ability without any targets just to add a loyalty counter to her."
      },
      {
        "date": "7/13/2016",
        "text": "Liliana’s second ability doesn’t target the card to return to your hand. After putting the top two cards of your library into your graveyard, you may choose from among any creature cards there."
      },
      {
        "date": "7/13/2016",
        "text": "While resolving the triggered ability of Liliana’s emblem, if you control zero Zombies, you’ll get two Zombie tokens."
      }
    ]
  },
  {
    "name": "Daretti, Ingenious Iconoclast",
    "set_name": "Guilds of Ravnica Mythic Edition",
    "collector_num": "3",
    "illustrator": "Svetlin Velinov",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Daretti"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "1BR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "+1: Create a 1/1 colorless Construct artifact creature token with defender.",
      "−1: You may sacrifice an artifact. If you do, destroy target artifact or creature.",
      "−6: Choose target artifact card in a graveyard or artifact on the battlefield. Create three tokens that are copies of it."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "3",
    "multiverse_id": 456591,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "8/23/2016",
        "text": "For the second ability, you choose the target artifact or creature as you activate the ability. You choose whether to sacrifice an artifact and which artifact to sacrifice as the ability resolves."
      },
      {
        "date": "8/23/2016",
        "text": "For the last ability, if you choose an artifact on the battlefield as the target, and that artifact is no longer on the battlefield as the ability tries to resolve, the ability won’t resolve and none of its effects will happen. You won’t get any tokens. This is true even if the card that represented that artifact is now in a graveyard. That card will be a different object than it was on the battlefield."
      }
    ]
  },
  {
    "name": "Nicol Bolas, Planeswalker",
    "set_name": "Guilds of Ravnica Mythic Edition",
    "collector_num": "4",
    "illustrator": "Slawomir Maniak",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Bolas"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4UBBR",
    "converted_mana_cost": 8,
    "oracle_text": [
      "+3: Destroy target noncreature permanent.",
      "−2: Gain control of target creature.",
      "−9: Nicol Bolas, Planeswalker deals 7 damage to target player or planeswalker. That player or that planeswalker's controller discards seven cards, then sacrifices seven permanents."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "5",
    "multiverse_id": 456592,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2009",
        "text": "The control-change effect has no duration. It will last until the game ends or the affected creature leaves the battlefield. It may be superseded by a later control-change effect."
      },
      {
        "date": "7/1/2012",
        "text": "If the damage from Nicol Bolas’s third ability is prevented or redirected, the rest of the effect will still happen. Specifically, the number of cards discarded and permanents sacrificed isn’t tied to the amount of damage dealt."
      },
      {
        "date": "7/1/2012",
        "text": "For the third ability, if the player is an illegal target when the ability tries to resolve, the ability doesn’t resolve and none of its effects will happen. No damage will be dealt, no cards will be discarded, and no permanents will be sacrificed."
      }
    ]
  },
  {
    "name": "Ral, Izzet Viceroy",
    "set_name": "Guilds of Ravnica Mythic Edition",
    "collector_num": "5",
    "illustrator": "Daniel Ljunggren",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Ral"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3UR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "+1: Look at the top two cards of your library. Put one of them into your hand and the other into your graveyard.",
      "−3: Ral, Izzet Viceroy deals damage to target creature equal to the total number of instant and sorcery cards you own in exile and in your graveyard.",
      "−8: You get an emblem with \"Whenever you cast an instant or sorcery spell, this emblem deals 4 damage to any target and you draw two cards.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "5",
    "multiverse_id": 456593,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/5/2018",
        "text": "If you have only one card in your library, Ral’s first ability puts it into your hand. Nothing is put into your graveyard."
      },
      {
        "date": "10/5/2018",
        "text": "If any exiled cards you own are face down, they have no characteristics. If they’re normally instants or sorceries, they won’t be counted for Ral’s second ability."
      },
      {
        "date": "10/5/2018",
        "text": "The emblem created by Ral’s last ability is colorless. The damage it deals is from a colorless source."
      },
      {
        "date": "10/5/2018",
        "text": "The triggered ability of Ral’s emblem resolves before the spell that caused it to trigger. It resolves even if that spell is countered."
      },
      {
        "date": "10/5/2018",
        "text": "If the target permanent or player becomes an illegal target for the triggered ability of Ral’s emblem, the ability doesn’t resolve. You don’t draw two cards."
      }
    ]
  },
  {
    "name": "Teferi, Hero of Dominaria",
    "set_name": "Guilds of Ravnica Mythic Edition",
    "collector_num": "6",
    "illustrator": "Yongjae Choi",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Teferi"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3WU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "+1: Draw a card. At the beginning of the next end step, untap up to two lands.",
      "−3: Put target nonland permanent into its owner's library third from the top.",
      "−8: You get an emblem with \"Whenever you draw a card, exile target permanent an opponent controls.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "4",
    "multiverse_id": 456594,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "4/27/2018",
        "text": "You don’t decide which two lands to untap until the next end step."
      },
      {
        "date": "4/27/2018",
        "text": "You choose the target for the triggered ability of Teferi’s emblem after you’ve seen the card you drew."
      }
    ]
  },
  {
    "name": "Tezzeret, Agent of Bolas",
    "set_name": "Guilds of Ravnica Mythic Edition",
    "collector_num": "7",
    "illustrator": "Aleksi Briclot",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Tezzeret"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2UB",
    "converted_mana_cost": 4,
    "oracle_text": [
      "+1: Look at the top five cards of your library. You may reveal an artifact card from among them and put it into your hand. Put the rest on the bottom of your library in any order.",
      "−1: Target artifact becomes an artifact creature with base power and toughness 5/5.",
      "−4: Target player loses X life and you gain X life, where X is twice the number of artifacts you control."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "3",
    "multiverse_id": 456595,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/1/2011",
        "text": "The artifact targeted by the second ability will retain any types, subtypes, or supertypes it has. Notably, if an Equipment becomes an artifact creature, it can’t be attached to another creature. If it was attached to a creature, it becomes unattached."
      },
      {
        "date": "6/1/2011",
        "text": "If the target of the second ability is already an artifact creature, its power and toughness will each become 5. This overwrites all previous effects that set the creature’s power and toughness to specific values. Any power- or toughness-setting effects that start to apply after this ability resolves will overwrite this effect."
      },
      {
        "date": "6/1/2011",
        "text": "Effects that modify that creature’s power or toughness, such as the effects of Giant Growth, will apply to it no matter when they started to take effect. The same is true for counters that change the creature’s power or toughness (such as -1/-1 counters) and effects that switch its power and toughness."
      },
      {
        "date": "6/1/2011",
        "text": "The number of artifacts you control is counted when the last ability resolves, not when it is activated."
      }
    ]
  },
  {
    "name": "Vraska, Golgari Queen",
    "set_name": "Guilds of Ravnica Mythic Edition",
    "collector_num": "8",
    "illustrator": "Livia Prima",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Vraska"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2BG",
    "converted_mana_cost": 4,
    "oracle_text": [
      "+2: You may sacrifice another permanent. If you do, you gain 1 life and draw a card.",
      "−3: Destroy target nonland permanent with converted mana cost 3 or less.",
      "−9: You get an emblem with \"Whenever a creature you control deals combat damage to a player, that player loses the game.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "4",
    "multiverse_id": 456596,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/5/2018",
        "text": "You choose whether to sacrifice a permanent (and which one to sacrifice) while Vraska’s first ability is resolving. No player may take actions between the time you choose which permanent to sacrifice and the time you do so."
      },
      {
        "date": "10/5/2018",
        "text": "Tokens that aren’t a copy of something else don’t have a mana cost. Anything without a mana cost normally has a converted mana cost of 0."
      },
      {
        "date": "10/5/2018",
        "text": "If a permanent has {X} in its mana cost, X is considered to be 0."
      }
    ]
  }
]
