[
  {
    "name": "Karn, Scion of Urza",
    "set_name": "Ravnica Allegiance Mythic Edition",
    "collector_num": "1",
    "illustrator": "Adam Paquette",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Karn"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4",
    "converted_mana_cost": 4,
    "oracle_text": [
      "+1: Reveal the top two cards of your library. An opponent chooses one of them. Put that card into your hand and exile the other with a silver counter on it.",
      "−1: Put a card you own with a silver counter on it from exile into your hand.",
      "−2: Create a 0/0 colorless Construct artifact creature token with \"This creature gets +1/+1 for each artifact you control.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "5",
    "multiverse_id": 460122,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "4/27/2018",
        "text": "A token created by Karn’s last ability will count itself, so it’ll be at least 1/1."
      },
      {
        "date": "4/27/2018",
        "text": "Karn is colorless but not an artifact. The Construct tokens created by Karn’s last ability don’t count Karn."
      }
    ]
  },
  {
    "name": "Tamiyo, the Moon Sage",
    "set_name": "Ravnica Allegiance Mythic Edition",
    "collector_num": "2",
    "illustrator": "Lius Lasahido",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Tamiyo"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3UU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "+1: Tap target permanent. It doesn't untap during its controller's next untap step.",
      "−2: Draw a card for each tapped creature target player controls.",
      "−8: You get an emblem with \"You have no maximum hand size\" and \"Whenever a card is put into your graveyard from anywhere, you may return it to your hand.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "4",
    "multiverse_id": 460123,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2012",
        "text": "Tamiyo’s first ability tracks the permanent, but not its controller. If the permanent changes controllers before its first controller’s next untap step has come around, then it won’t untap during its new controller’s next untap step."
      },
      {
        "date": "5/1/2012",
        "text": "The number of tapped creatures the player controls is determined when Tamiyo’s second ability resolves."
      },
      {
        "date": "5/1/2012",
        "text": "Tamiyo’s third ability creates one emblem with two abilities."
      },
      {
        "date": "5/1/2012",
        "text": "If you activate Tamiyo’s third ability when she has eight loyalty counters on her, she’ll be put into your graveyard before the emblem is created. She won’t return to your hand."
      },
      {
        "date": "5/1/2012",
        "text": "Cards that are put into your graveyard can be returned to your hand by the emblem’s ability even if they were never in your hand."
      },
      {
        "date": "7/1/2013",
        "text": "The ability can target a tapped permanent. If the targeted permanent is already tapped when it resolves, that permanent just remains tapped and doesn’t untap during its controller’s next untap step."
      }
    ]
  },
  {
    "name": "Sorin Markov",
    "set_name": "Ravnica Allegiance Mythic Edition",
    "collector_num": "3",
    "illustrator": "Kieran Yanner",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Sorin"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3BBB",
    "converted_mana_cost": 6,
    "oracle_text": [
      "+2: Sorin Markov deals 2 damage to any target and you gain 2 life.",
      "−3: Target opponent's life total becomes 10.",
      "−7: You control target player during that player's next turn."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "4",
    "multiverse_id": 460124,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "If the targeted permanent or player is an illegal target by the time Sorin’s first ability resolves, the entire ability doesn’t resolve. You won’t gain life."
      },
      {
        "date": "10/1/2009",
        "text": "For a player’s life total to become 10, what actually happens is that the player gains or loses the appropriate amount of life. For example, if the targeted opponent’s life total is 4 when this ability resolves, it will cause that player to gain 6 life; alternately, if the targeted player’s life total is 17 when this ability resolves, it will cause that player to lose 7 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."
      },
      {
        "date": "10/1/2009",
        "text": "Sorin’s third ability allows you to control another player. This effect applies to the next turn that the affected player actually takes."
      },
      {
        "date": "10/1/2009",
        "text": "The player who is being controlled is still the active player."
      },
      {
        "date": "10/1/2009",
        "text": "While controlling another player, you also continue to make your own choices and decisions."
      },
      {
        "date": "10/1/2009",
        "text": "While controlling another player, you make all choices and decisions that player is allowed to make or is told to make during that turn. For example:\r\n    -- You choose which lands the other player plays.\r\n    -- You choose which spells the other player casts, and make all decisions as those spells are cast and as they resolve. For example, you choose the value of X for that player's Earthquake, the target for that player's Lightning Bolt, what mana that player spends to cast Day of Judgment, and what card that player gets with Diabolic Tutor.\r\n    -- You choose which activated abilities the other player activates, and make all decisions as those abilities are activated and as they resolve. For example, you can have your opponent sacrifice their creatures to their Vampire Aristocrat or have your opponent's Caller of Gales give one of your creatures flying.\r\n    -- You make all decisions for the other player's triggered abilities, including what they target and any decisions made when they resolve.\r\n    -- You choose which creatures controlled by the other player attack, who or what they attack, and how they assign their combat damage.\r\n    -- You make any choices and decisions that player would make for any other reason. For example, you could cast Fact or Fiction, choose that player to divide the revealed cards into piles, and thus divide those cards into piles yourself."
      },
      {
        "date": "10/1/2009",
        "text": "You can’t make the affected player concede. That player may choose to concede at any time, even while you’re controlling their turn."
      },
      {
        "date": "10/1/2009",
        "text": "You can’t make any illegal decisions or illegal choices — you can’t do anything that player couldn’t do. You can’t make choices or decisions for that player that aren’t called for by the game rules or by any cards, permanents, spells, abilities, and so on. If an effect causes another player to make decisions that the affected player would normally make (such as Master Warcraft does), that effect takes precedence. (In other words, if the affected player wouldn’t make a decision, you wouldn’t make that decision on their behalf.) You also can’t make any choices or decisions for the player that would be called for by the tournament rules (such as whether to take an intentional draw or whether to call a judge)."
      },
      {
        "date": "10/1/2009",
        "text": "You can use only the affected player’s resources (cards, mana, and so on) to pay costs for that player; you can’t use your own. Similarly, you can use the affected player’s resources only to pay that player’s costs; you can’t spend them on your costs."
      },
      {
        "date": "10/1/2009",
        "text": "You only control the player. You don’t control any of the other player’s permanents, spells, or abilities."
      },
      {
        "date": "10/1/2009",
        "text": "If the player affected by Sorin’s third ability skips their next turn, the ability will wait. You’ll control the next turn the affected player actually takes."
      },
      {
        "date": "10/1/2009",
        "text": "Multiple player-controlling effects that affect the same player overwrite each other. The last one to be created is the one that works."
      },
      {
        "date": "10/1/2009",
        "text": "You could gain control of yourself using Sorin’s third ability, but unless you do so to overwrite someone else’s player-controlling effect, this doesn’t do anything."
      },
      {
        "date": "6/15/2010",
        "text": "In a Two-Headed Giant game, Sorin’s second ability causes the targeted opponent’s team’s life total to become 10. Only the targeted player is actually considered to have actually gained or lost life."
      },
      {
        "date": "7/13/2016",
        "text": "While controlling another player, you can see all cards in the game that player can see. This includes cards in that player’s hand, face-down cards that player controls, and any cards in that player’s library the player may look at."
      },
      {
        "date": "7/13/2016",
        "text": "Controlling a player doesn’t allow you to look at that player’s sideboard. If an effect instructs that player to choose a card from outside the game, you can’t have that player choose any card."
      }
    ]
  },
  {
    "name": "Jaya Ballard",
    "set_name": "Ravnica Allegiance Mythic Edition",
    "collector_num": "4",
    "illustrator": "Kieran Yanner",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Jaya"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2RRR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "+1: Add {R}{R}{R}. Spend this mana only to cast instant or sorcery spells.",
      "+1: Discard up to three cards, then draw that many cards.",
      "−8: You get an emblem with \"You may cast instant and sorcery cards from your graveyard. If a card cast this way would be put into your graveyard, exile it instead.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "5",
    "multiverse_id": 460125,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "4/27/2018",
        "text": "Mana produced by Jaya’s first ability can be spent among any number of instant and/or sorcery spells."
      },
      {
        "date": "4/27/2018",
        "text": "You choose how many cards to discard while Jaya’s second ability is resolving. You can choose to discard zero cards this way (and then draw zero cards) if you wish."
      },
      {
        "date": "4/27/2018",
        "text": "Jaya’s emblem doesn’t grant you permission to do anything with instant and sorcery cards in your graveyard except cast them. For example, you can’t cycle instant or sorcery cards with cycling from your graveyard."
      },
      {
        "date": "6/8/2018",
        "text": "Because it’s a loyalty ability, Jaya’s first ability isn’t a mana ability. It can be activated only any time you could cast a sorcery. It uses the stack and can be responded to."
      }
    ]
  },
  {
    "name": "Ajani, Mentor of Heroes",
    "set_name": "Ravnica Allegiance Mythic Edition",
    "collector_num": "5",
    "illustrator": "Bram Sels",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Ajani"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3GW",
    "converted_mana_cost": 5,
    "oracle_text": [
      "+1: Distribute three +1/+1 counters among one, two, or three target creatures you control.",
      "+1: Look at the top four cards of your library. You may reveal an Aura, creature, or planeswalker card from among them and put it into your hand. Put the rest on the bottom of your library in any order.",
      "−8: You gain 100 life."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "4",
    "multiverse_id": 460126,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "4/26/2014",
        "text": "You announce how many counters will be placed on each target creature as you activate Ajani’s first ability. Each target must receive at least one counter."
      },
      {
        "date": "4/26/2014",
        "text": "If one or more, but not all, of the targets of the first ability are illegal when that ability tries to resolve, no counters will be placed on illegal targets. You can’t change the distribution you announced when you activated the ability; the excess counters are just lost."
      }
    ]
  },
  {
    "name": "Dack Fayden",
    "set_name": "Ravnica Allegiance Mythic Edition",
    "collector_num": "6",
    "illustrator": "Jason Rainville",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Dack"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "1UR",
    "converted_mana_cost": 3,
    "oracle_text": [
      "+1: Target player draws two cards, then discards two cards.",
      "−2: Gain control of target artifact.",
      "−6: You get an emblem with \"Whenever you cast a spell that targets one or more permanents, gain control of those permanents.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "3",
    "multiverse_id": 460127,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/8/2016",
        "text": "The targeted player draws two cards and discards two cards all while Dack’s first ability is resolving. Nothing can happen between the two, and no player may choose to take actions."
      },
      {
        "date": "6/8/2016",
        "text": "The ability of Dack’s emblem will resolve before the spell that caused it to trigger."
      },
      {
        "date": "6/8/2016",
        "text": "The effect of Dack’s second ability and the effect of the emblem’s ability last indefinitely. You won’t lose control of the permanents if Dack leaves the battlefield."
      },
      {
        "date": "6/8/2016",
        "text": "If you gain control of a permanent, and you leave the game, the control-changing effect will end. Unless there’s another control-changing effect affecting that permanent, it will return to its owner’s control."
      },
      {
        "date": "6/8/2016",
        "text": "If you gain control of a permanent another player owns, and that player leaves the game, the permanent will also leave the game."
      }
    ]
  },
  {
    "name": "Domri, Chaos Bringer",
    "set_name": "Ravnica Allegiance Mythic Edition",
    "collector_num": "7",
    "illustrator": "Jason Rainville",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Domri"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2RG",
    "converted_mana_cost": 4,
    "oracle_text": [
      "+1: Add {R} or {G}. If that mana is spent on a creature spell, it gains riot. (It enters the battlefield with your choice of a +1/+1 counter or haste.)",
      "−3: Look at the top four cards of your library. You may reveal up to two creature cards from among them and put them into your hand. Put the rest on the bottom of your library in a random order.",
      "−8: You get an emblem with \"At the beginning of each end step, create a 4/4 red and green Beast creature token with trample.\""
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "5",
    "multiverse_id": 460128,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "1/25/2019",
        "text": "Because it’s a loyalty ability, Domri’s first ability isn’t a mana ability. It can be activated only any time you could cast a sorcery. It uses the stack and can be responded to."
      },
      {
        "date": "1/25/2019",
        "text": "Riot is a replacement effect. Players can’t respond to your choice of +1/+1 counter or haste, and they can’t take actions while the creature is on the battlefield without one or the other."
      },
      {
        "date": "1/25/2019",
        "text": "If a creature entering the battlefield has riot but can’t have a +1/+1 counter put onto it, it gains haste."
      },
      {
        "date": "1/25/2019",
        "text": "If you choose for the creature to gain haste, it gains haste indefinitely. It won’t lose it as the turn ends or as another player gains control of it."
      },
      {
        "date": "1/25/2019",
        "text": "If a creature enters the battlefield with two instances of riot, you may choose to have it get two +1/+1 counters, one +1/+1 counter and haste, or two instances of haste. Multiple instances of haste on the same creature are redundant, but we’re not going to tell the Gruul how to live their lives."
      }
    ]
  },
  {
    "name": "Kaya, Orzhov Usurper",
    "set_name": "Ravnica Allegiance Mythic Edition",
    "collector_num": "8",
    "illustrator": "Chris Rallis",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Kaya"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "1WB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "+1: Exile up to two target cards from a single graveyard. You gain 2 life if at least one creature card was exiled this way.",
      "−1: Exile target nonland permanent with converted mana cost 1 or less.",
      "−5: Kaya, Orzhov Usurper deals damage to target player equal to the number of cards that player owns in exile and you gain that much life."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "3",
    "multiverse_id": 460129,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "1/25/2019",
        "text": "If a permanent has {X} in its mana cost, X is considered to be 0."
      },
      {
        "date": "1/25/2019",
        "text": "Tokens that aren’t a copy of something else don’t have a mana cost. Anything without a mana cost normally has a converted mana cost of 0."
      },
      {
        "date": "1/25/2019",
        "text": "Kaya’s last ability causes you to gain life equal to the number of cards the target player owns in exile, even if an effect causes her to deal more or less than that amount of damage to that player."
      }
    ]
  }
]
