[
  {
    "name": "Gideon Jura",
    "set_name": "Signature Spellbook: Gideon",
    "collector_num": "1",
    "illustrator": "Aleksi Briclot",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Gideon"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3WW",
    "converted_mana_cost": 5,
    "oracle_text": [
      "+2: During target opponent's next turn, creatures that player controls attack Gideon Jura if able.",
      "−2: Destroy target tapped creature.",
      "0: Until end of turn, Gideon Jura becomes a 6/6 Human Soldier creature that's still a planeswalker. Prevent all damage that would be dealt to him this turn."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "6",
    "multiverse_id": 470539,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/15/2010",
        "text": "Gideon Jura’s first ability doesn’t lock in what it applies to. That’s because the effect states a true thing about a set of creatures, but doesn’t actually change the characteristics of those creatures. As a result, whatever creatures the targeted opponent controls during the declare attackers step of their next turn must attack Gideon Jura if able. This includes creatures that come under that player’s control after the ability has resolved and creatures that have lost all abilities."
      },
      {
        "date": "6/15/2010",
        "text": "Gideon Jura’s first ability causes creatures to attack him if able. If, during the affected player’s declare attackers step, a creature they control is tapped, is affected by a spell or ability that says it can’t attack, or is affected by “summoning sickness,” then that creature doesn’t attack. If there’s a cost associated with having a creature attack, the player isn’t forced to pay that cost, so the creature doesn’t have to attack in that case either."
      },
      {
        "date": "6/15/2010",
        "text": "If a creature controlled by the affected player can’t attack Gideon Jura (because he’s no longer on the battlefield, for example), that player may have it attack you, another one of your planeswalkers, or nothing at all."
      },
      {
        "date": "6/15/2010",
        "text": "Gideon Jura’s first ability applies during each combat phase of the affected player’s next turn (as opposed to applying during the affected player’s next combat phase). The distinction is relevant if there are no combat phases during that turn (due to Fatespinner’s effect, for example) or there are multiples (due to World at War, for example)."
      },
      {
        "date": "6/15/2010",
        "text": "If Gideon Jura becomes a creature due to his third ability, that doesn’t count as having a creature enter the battlefield. Gideon Jura was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
      },
      {
        "date": "6/15/2010",
        "text": "If Gideon Jura becomes a creature, he may be affected by “summoning sickness.” You can’t attack with him or use any of his {T} abilities (if he gains any) unless he began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when Gideon Jura came under your control, not when he became a creature."
      },
      {
        "date": "6/15/2010",
        "text": "Gideon Jura’s third ability causes him to become a creature with the creature types Human Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: Gideon is just a planeswalker type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."
      },
      {
        "date": "6/15/2010",
        "text": "If you activate Gideon Jura’s third ability and then unpreventable damage is dealt to him (due to Unstable Footing, for example), that damage has all applicable results: specifically, the damage is marked on Gideon Jura (since he’s a creature) and that damage causes that many loyalty counters to be removed from him (since he’s a planeswalker). If the total amount of damage marked on Gideon Jura is lethal damage, he’s destroyed as a state-based action. If Gideon Jura has no loyalty counters on him, he’s put into his owner’s graveyard as a state-based action."
      },
      {
        "date": "6/15/2010",
        "text": "Say you activate Gideon Jura’s third ability, then an opponent gains control of him before combat. You may have any of your creatures attack Gideon Jura (since he’s still a planeswalker). Then Gideon Jura may block (since he’s a creature). He may block any eligible attacking creature, including one that’s attacking him! During combat, he behaves as an attacked planeswalker and/or a blocking creature, as appropriate. For example, he deals combat damage to any creatures he’s blocking, but he doesn’t deal combat damage to any unblocked creatures that are attacking him."
      },
      {
        "date": "1/22/2011",
        "text": "The first ability only affects the declaration of attackers. If a creature is put onto the battlefield attacking (thanks to Hero of Bladehold, Preeminent Captain, or the Ninjutsu ability, for example), that creature’s controller may choose the defending player or planeswalker that it will be attacking in the normal way."
      }
    ]
  },
  {
    "name": "Martyr's Bond",
    "set_name": "Signature Spellbook: Gideon",
    "collector_num": "2",
    "illustrator": "Seb McKinnon",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "4WW",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Whenever Martyr's Bond or another nonland permanent you control is put into a graveyard from the battlefield, each opponent sacrifices a permanent that shares a card type with it."
    ],
    "flavor_text": "\"One life at a time. That is how the world will be saved.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 470540,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "9/22/2011",
        "text": "If Martyr’s Bond and other nonland permanents are put into the graveyard from the battlefield at the same time, Martyr’s Bond will trigger for itself and each of those other nonland permanents."
      },
      {
        "date": "9/22/2011",
        "text": "Each opponent must sacrifice only one permanent for each trigger, even if the nonland permanent you controlled that went to the graveyard had multiple types. For example, if an artifact creature you control is put into a graveyard from the battlefield, each opponent sacrifices exactly one artifact or creature, and that permanent doesn’t need to be an artifact creature."
      }
    ]
  },
  {
    "name": "Path to Exile",
    "set_name": "Signature Spellbook: Gideon",
    "collector_num": "3",
    "illustrator": "Daarken",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "W",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Exile target creature. Its controller may search their library for a basic land card, put that card onto the battlefield tapped, then shuffle their library."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 470541,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/14/2017",
        "text": "If the targeted creature becomes an illegal target by the time Path to Exile would resolve, the entire spell doesn’t resolve. The creature’s controller won’t search for a basic land card."
      },
      {
        "date": "3/14/2017",
        "text": "The controller of the exiled creature isn’t required to search their library for a basic land. If that player doesn’t, the player won’t shuffle their library."
      }
    ]
  },
  {
    "name": "Rest in Peace",
    "set_name": "Signature Spellbook: Gideon",
    "collector_num": "4",
    "illustrator": "Jason Rainville",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "1W",
    "converted_mana_cost": 2,
    "oracle_text": [
      "When Rest in Peace enters the battlefield, exile all cards from all graveyards.",
      "If a card or token would be put into a graveyard from anywhere, exile it instead."
    ],
    "flavor_text": "\"I will keep watch.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 470542,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/16/2018",
        "text": "While Rest in Peace is on the battlefield, abilities that trigger whenever a creature dies won’t trigger because cards and tokens are never put into a player’s graveyard."
      },
      {
        "date": "3/16/2018",
        "text": "If Rest in Peace is destroyed by a spell, Rest in Peace will be exiled and then the spell will be put into its owner’s graveyard."
      },
      {
        "date": "3/16/2018",
        "text": "If a card is discarded while Rest in Peace is on the battlefield, abilities that function when a card is discarded (such as madness) still work, even though that card never reaches a graveyard. In addition, spells or abilities that check the characteristics of a discarded card (such as Chandra Ablaze’s first ability) can find that card in exile."
      }
    ]
  },
  {
    "name": "Shielded by Faith",
    "set_name": "Signature Spellbook: Gideon",
    "collector_num": "5",
    "illustrator": "Zack Stella",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Aura"
    ],
    "rarity": "Rare",
    "mana_cost": "1WW",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Enchant creature",
      "Enchanted creature has indestructible.",
      "Whenever a creature enters the battlefield, you may attach Shielded by Faith to that creature."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 470543,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "True Conviction",
    "set_name": "Signature Spellbook: Gideon",
    "collector_num": "6",
    "illustrator": "Ekaterina Burmak",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "3WWW",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Creatures you control have double strike and lifelink."
    ],
    "flavor_text": "\"Heroism is more than a single act; it is hundreds of small decisions, made every day, in pursuit of a heroic cause.\"",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 470544,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Worship",
    "set_name": "Signature Spellbook: Gideon",
    "collector_num": "7",
    "illustrator": "Matt Stewart",
    "types": [
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Rare",
    "mana_cost": "3W",
    "converted_mana_cost": 4,
    "oracle_text": [
      "If you control a creature, damage that would reduce your life total to less than 1 reduces it to 1 instead."
    ],
    "flavor_text": "Even after all that befell Amonkhet, Gideon never believed that his trust in Oketra was misplaced.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 470545,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "It reduces your life total to 1, not the damage to 1."
      },
      {
        "date": "10/4/2004",
        "text": "Worship does not prevent damage. It causes some damage to be unable to lower your life total. So any damage rendered useless by Worship was still dealt and is counted by effects that track the amount of damage done to a player. In addition, Worship does not prevent loss of life, so loss of life bypasses Worship."
      }
    ]
  },
  {
    "name": "Blackblade Reforged",
    "set_name": "Signature Spellbook: Gideon",
    "collector_num": "8",
    "illustrator": "Richard Kane Ferguson",
    "types": [
      "Artifact"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Equipment"
    ],
    "rarity": "Rare",
    "mana_cost": "2",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Equipped creature gets +1/+1 for each land you control.",
      "Equip legendary creature {3}",
      "Equip {7}"
    ],
    "flavor_text": "A weapon of evil, redeemed in Gideon's hand.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 470546,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "4/27/2018",
        "text": "“Equip [quality] creature” is a variant of the equip keyword. “Equip [quality] creature [cost]” means “[Cost]: Attach this Equipment to target [quality] creature you control. Activate this ability only any time you could cast a sorcery.”"
      },
      {
        "date": "4/27/2018",
        "text": "Whether the target creature is legendary is checked only as Blackblade Reforged’s first equip ability is activated and as that ability resolves. If the creature somehow becomes nonlegendary later, Blackblade Reforged remains attached to it."
      }
    ]
  }
]
