[
  {
    "name": "Emrakul, the Aeons Torn",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "1",
    "illustrator": "Mark Tedin",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Eldrazi"
    ],
    "rarity": "Special",
    "mana_cost": "15",
    "converted_mana_cost": 15,
    "oracle_text": [
      "This spell can't be countered.",
      "When you cast this spell, take an extra turn after this one.",
      "Flying, protection from colored spells, annihilator 6",
      "When Emrakul, the Aeons Torn is put into a graveyard from anywhere, its owner shuffles their graveyard into their library."
    ],
    "flavor_text": null,
    "power": "15",
    "toughness": "15",
    "loyalty": null,
    "multiverse_id": 457105,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/15/2010",
        "text": "Annihilator abilities trigger and resolve during the declare attackers step. The defending player chooses and sacrifices the required number of permanents before they declare blockers. Any creatures sacrificed this way won’t be able to block."
      },
      {
        "date": "6/15/2010",
        "text": "If a creature with annihilator is attacking a planeswalker, and the defending player chooses to sacrifice that planeswalker, the attacking creature continues to attack. It may be blocked. If it isn’t blocked, it simply won’t deal combat damage to anything."
      },
      {
        "date": "12/7/2018",
        "text": "Emrakul’s second ability triggers as you cast it, and that ability resolves before the spell itself. It resolves even if that spell is somehow removed from the stack."
      },
      {
        "date": "12/7/2018",
        "text": "Emrakul can be targeted by spells that try to counter it (such as Ionize). Those spells will resolve, but the part of their effect that would counter Emrakul won’t do anything. Any other effects those spells have will work as normal."
      },
      {
        "date": "12/7/2018",
        "text": "“Colored spells” is not synonymous with “colored cards.” For example, even though creatures are spells when they’re cast, they’re not spells when they’re on the battlefield and can block Emrakul; and triggered abilities of permanents entering the battlefield (such as that of Banishing Light) can target it."
      },
      {
        "date": "12/7/2018",
        "text": "Emrakul can’t be the target of colored Aura spells, but colored Auras can be put onto the battlefield enchanting it."
      }
    ]
  },
  {
    "name": "Karn Liberated",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "2",
    "illustrator": "Jason Chan",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Karn"
    ],
    "rarity": "Special",
    "mana_cost": "7",
    "converted_mana_cost": 7,
    "oracle_text": [
      "+4: Target player exiles a card from their hand.",
      "−3: Exile target permanent.",
      "−14: Restart the game, leaving in exile all non-Aura permanent cards exiled with Karn Liberated. Then put those cards onto the battlefield under your control."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "6",
    "multiverse_id": 457106,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "A game that restarts immediately ends the preceding game. The players in that game then immediately begin a new game. No player wins, loses, or draws the original game as a result of Karn’s ability."
      },
      {
        "date": "12/7/2018",
        "text": "Players can’t move cards between their deck and sideboard before the new game."
      },
      {
        "date": "12/7/2018",
        "text": "The player who controlled the ability that restarted the game is the starting player in the new game. The new game starts like a game normally does: Each player shuffles their deck (except the cards left in exile by Karn’s ability). Each player’s life total becomes 20 (or the starting life total for whatever format you’re playing). Players draw a hand of seven cards. Players may take mulligans. Players may take actions based on cards in their opening hands, such as those of Leylines."
      },
      {
        "date": "12/7/2018",
        "text": "Karn’s first and third abilities are linked. Similarly, Karn’s second and third abilities are linked. Only non-Aura permanent cards exiled by either of Karn’s first two abilities will remain in exile when the game restarts."
      },
      {
        "date": "12/7/2018",
        "text": "After the pregame procedure is complete but before the new game’s first turn, Karn’s ability finishes resolving and the cards left in exile are put onto the battlefield. If this causes any triggered abilities to trigger, those abilities are put onto the stack at the beginning of the first upkeep step."
      },
      {
        "date": "12/7/2018",
        "text": "Permanents put onto the battlefield due to Karn’s ability will have been under the starting controller’s control continuously since the beginning of that player’s first turn. Creatures among them can attack and their activated abilities with {T} in the cost can be activated."
      },
      {
        "date": "12/7/2018",
        "text": "Any permanents put onto the battlefield with Karn’s ability that entered the battlefield tapped will untap during their controller’s first untap step."
      },
      {
        "date": "12/7/2018",
        "text": "No actions taken in the game that was restarted apply to the new game. For example, if you were dealt damage by Stigma Lasher in the original game, the effect that states you can’t gain life doesn’t carry over to the new game."
      },
      {
        "date": "12/7/2018",
        "text": "Players won’t have any counters or emblems they had in the original game."
      },
      {
        "date": "12/7/2018",
        "text": "In a multiplayer game, any player who left the game before it was restarted with Karn’s ability won’t be involved in the new game."
      },
      {
        "date": "12/7/2018",
        "text": "If a player leaves the game, all cards that player owns leave as well. If you leave the game, the permanents you control from Karn’s ability are exiled."
      },
      {
        "date": "12/7/2018",
        "text": "In a Commander game, each player puts their commander into the command zone before shuffling their deck, unless it was exiled with Karn. In that case, the commander remains in exile and will be put onto the battlefield when Karn’s ability finishes resolving."
      },
      {
        "date": "12/7/2018",
        "text": "The number of times a player has cast their commander from the command zone resets to zero. The amount of combat damage dealt to players by each commander is reset to 0."
      }
    ]
  },
  {
    "name": "Kozilek, Butcher of Truth",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "3",
    "illustrator": "Michael Komarck",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Eldrazi"
    ],
    "rarity": "Special",
    "mana_cost": "10",
    "converted_mana_cost": 10,
    "oracle_text": [
      "When you cast this spell, draw four cards.",
      "Annihilator 4 (Whenever this creature attacks, defending player sacrifices four permanents.)",
      "When Kozilek, Butcher of Truth is put into a graveyard from anywhere, its owner shuffles their graveyard into their library."
    ],
    "flavor_text": null,
    "power": "12",
    "toughness": "12",
    "loyalty": null,
    "multiverse_id": 457107,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/15/2010",
        "text": "Annihilator abilities trigger and resolve during the declare attackers step. The defending player chooses and sacrifices the required number of permanents before they declare blockers. Any creatures sacrificed this way won’t be able to block."
      },
      {
        "date": "6/15/2010",
        "text": "If a creature with annihilator is attacking a planeswalker, and the defending player chooses to sacrifice that planeswalker, the attacking creature continues to attack. It may be blocked. If it isn’t blocked, it simply won’t deal combat damage to anything."
      },
      {
        "date": "12/7/2018",
        "text": "Kozilek’s first ability triggers as you cast it, and that ability resolves before the spell itself. It resolves even if the spell is countered."
      }
    ]
  },
  {
    "name": "Ulamog, the Infinite Gyre",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "4",
    "illustrator": "Aleksi Briclot",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Eldrazi"
    ],
    "rarity": "Special",
    "mana_cost": "11",
    "converted_mana_cost": 11,
    "oracle_text": [
      "When you cast this spell, destroy target permanent.",
      "Indestructible",
      "Annihilator 4 (Whenever this creature attacks, defending player sacrifices four permanents.)",
      "When Ulamog, the Infinite Gyre is put into a graveyard from anywhere, its owner shuffles their graveyard into their library."
    ],
    "flavor_text": null,
    "power": "10",
    "toughness": "10",
    "loyalty": null,
    "multiverse_id": 457108,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/15/2010",
        "text": "Annihilator abilities trigger and resolve during the declare attackers step. The defending player chooses and sacrifices the required number of permanents before they declare blockers. Any creatures sacrificed this way won’t be able to block."
      },
      {
        "date": "6/15/2010",
        "text": "If a creature with annihilator is attacking a planeswalker, and the defending player chooses to sacrifice that planeswalker, the attacking creature continues to attack. It may be blocked. If it isn’t blocked, it simply won’t deal combat damage to anything."
      },
      {
        "date": "7/1/2013",
        "text": "Lethal damage and effects that say “destroy” won’t cause a creature with indestructible to be put into the graveyard. However, a creature with indestructible can be put into the graveyard for a number of reasons. The most likely reasons are if it’s sacrificed, if it’s legendary and another legendary creature with the same name is controlled by the same player, or if its toughness is 0 or less."
      },
      {
        "date": "12/7/2018",
        "text": "Ulamog’s ability triggers as you cast it, and that ability resolves before the spell itself. It resolves even if that spell is countered."
      }
    ]
  },
  {
    "name": "Snapcaster Mage",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "5",
    "illustrator": "Ryan Alexander Lee",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Special",
    "mana_cost": "1U",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Flash",
      "When Snapcaster Mage enters the battlefield, target instant or sorcery card in your graveyard gains flashback until end of turn. The flashback cost is equal to its mana cost. (You may cast that card from your graveyard for its flashback cost. Then exile it.)"
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 457109,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "4/18/2017",
        "text": "For split cards, the flashback cost you pay is determined by the half you cast."
      },
      {
        "date": "12/7/2018",
        "text": "If you cast a spell from a graveyard using its flashback ability, you can’t pay other alternative costs (such as that of Foil)."
      },
      {
        "date": "12/7/2018",
        "text": "If you cast an instant or sorcery with {X} in its mana cost this way, you still choose the value of X as part of casting the spell and pay that cost."
      },
      {
        "date": "12/7/2018",
        "text": "If an instant or sorcery card in your graveyard already has flashback, you may use either flashback ability to cast it from your graveyard."
      },
      {
        "date": "12/7/2018",
        "text": "You may pay any optional additional costs the spell has, such as kicker costs. You must pay any mandatory additional costs the spell has, such as that of Tormenting Voice."
      }
    ]
  },
  {
    "name": "Temporal Manipulation",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "6",
    "illustrator": "Franz Vohwinkel",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": "3UU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Take an extra turn after this one."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457110,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "If multiple “extra turn” effects resolve in the same turn, take them in the reverse of the order that the effects resolved."
      }
    ]
  },
  {
    "name": "Bitterblossom",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "7",
    "illustrator": "Jesper Ejsing",
    "types": [
      "Tribal",
      "Enchantment"
    ],
    "supertypes": [],
    "subtypes": [
      "Faerie"
    ],
    "rarity": "Special",
    "mana_cost": "1B",
    "converted_mana_cost": 2,
    "oracle_text": [
      "At the beginning of your upkeep, you lose 1 life and create a 1/1 black Faerie Rogue creature token with flying."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457111,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "4/1/2008",
        "text": "The effect is mandatory. You’ll lose 1 life even if you have only 1 life left."
      },
      {
        "date": "4/1/2008",
        "text": "The life loss isn’t a payment. You’ll get a token even if you had 0 life (and another effect is stopping you from losing the game)."
      }
    ]
  },
  {
    "name": "Demonic Tutor",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "8",
    "illustrator": "Zack Stella",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": "1B",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Search your library for a card, put that card into your hand, then shuffle your library."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457112,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "You pick a card on resolution."
      },
      {
        "date": "10/4/2004",
        "text": "You don’t reveal the card to your opponent."
      },
      {
        "date": "10/4/2004",
        "text": "This card is put directly into your hand. It is not drawn."
      }
    ]
  },
  {
    "name": "Goryo's Vengeance",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "9",
    "illustrator": "Randy Vargas",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [
      "Arcane"
    ],
    "rarity": "Special",
    "mana_cost": "1B",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Return target legendary creature card from your graveyard to the battlefield. That creature gains haste. Exile it at the beginning of the next end step.",
      "Splice onto Arcane {2}{B} (As you cast an Arcane spell, you may reveal this card from your hand and pay its splice cost. If you do, add this card's effects to that spell.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457113,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/7/2013",
        "text": "You reveal all cards you intend to splice at the same time. Each individual card can be spliced only once onto any one spell."
      },
      {
        "date": "6/7/2013",
        "text": "A card with a splice ability can’t be spliced onto itself because the spell is on the stack (and not in your hand) when you reveal the cards you want to splice onto it."
      },
      {
        "date": "6/7/2013",
        "text": "You choose all targets for the spell after revealing cards you want to splice, including any targets required by the text of any of those cards. You may choose a different target for each instance of the word “target” on the resulting spell."
      },
      {
        "date": "6/7/2013",
        "text": "If all of the spell’s targets are illegal when the spell tries to resolve, it won’t resolve and none of its effects will happen."
      },
      {
        "date": "12/7/2018",
        "text": "If the returned creature leaves the battlefield before the end step, it will remain in its current zone. It won’t be exiled."
      }
    ]
  },
  {
    "name": "Liliana of the Veil",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "10",
    "illustrator": "Steve Argyle",
    "types": [
      "Planeswalker"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Liliana"
    ],
    "rarity": "Special",
    "mana_cost": "1BB",
    "converted_mana_cost": 3,
    "oracle_text": [
      "+1: Each player discards a card.",
      "−2: Target player sacrifices a creature.",
      "−6: Separate all permanents target player controls into two piles. That player sacrifices all permanents in the pile of their choice."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": "3",
    "multiverse_id": 457114,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "You can activate Liliana’s first ability even if some or all players will be unable to discard a card."
      },
      {
        "date": "12/7/2018",
        "text": "When Liliana’s first ability resolves, first the player whose turn it is chooses a card in hand without revealing it, then each other player in turn order does the same. Then all the chosen cards are discarded at the same time."
      },
      {
        "date": "12/7/2018",
        "text": "When Liliana’s third ability resolves, you put each permanent the player controls into one of the two piles. For example, you could put a creature into one pile and an Aura enchanting that creature into the other pile."
      },
      {
        "date": "12/7/2018",
        "text": "A pile can be empty. If the player chooses an empty pile, no permanents will be sacrificed."
      }
    ]
  },
  {
    "name": "Mikaeus, the Unhallowed",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "11",
    "illustrator": "Chris Rahn",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Zombie",
      "Cleric"
    ],
    "rarity": "Special",
    "mana_cost": "3BBB",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Intimidate (This creature can't be blocked except by artifact creatures and/or creatures that share a color with it.)",
      "Whenever a Human deals damage to you, destroy it.",
      "Other non-Human creatures you control get +1/+1 and have undying. (When a creature with undying dies, if it had no +1/+1 counters on it, return it to the battlefield under its owner's control with a +1/+1 counter on it.)"
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 457115,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "Any damage dealt to you by a Human will cause Mikaeus’s ability to trigger, including noncombat damage dealt to you by a Human and damage dealt to you by a Human you control."
      },
      {
        "date": "12/7/2018",
        "text": "If a Human deals damage to you at the same time that Mikaeus is dealt lethal damage, Mikaeus’s triggered ability triggers. That Human will be destroyed even though Mikaeus has left the battlefield."
      },
      {
        "date": "12/7/2018",
        "text": "If a non-Human creature you control without a +1/+1 counter dies at the same time as Mikaeus, that creature’s undying ability granted by Mikaeus triggers and will return it to the battlefield."
      },
      {
        "date": "12/7/2018",
        "text": "The +1/+1 bonus that Mikaeus gives to other non-Human creatures you control isn’t a counter. It won’t prevent undying from triggering."
      }
    ]
  },
  {
    "name": "Reanimate",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "12",
    "illustrator": "Johann Bodin",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": "B",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Put target creature card from a graveyard onto the battlefield under your control. You lose life equal to its converted mana cost."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457116,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "If a card in a player’s graveyard has {X} in its mana cost, X is considered to be 0."
      },
      {
        "date": "12/7/2018",
        "text": "The amount of life you lose is determined by the converted mana cost of the card in your graveyard, not the creature once it’s on the battlefield."
      },
      {
        "date": "12/7/2018",
        "text": "You lose life after the creature is already on the battlefield. Any abilities it has that interact with loss of life, such as that of Platinum Emperion, apply to that loss of life."
      },
      {
        "date": "12/7/2018",
        "text": "If any abilities trigger on the creature entering the battlefield, those abilities resolve after you lose life. If losing life results in you losing the game, those abilities won’t resolve."
      },
      {
        "date": "12/7/2018",
        "text": "In a multiplayer game, if a player leaves the game, all cards that player owns leave as well. If you leave the game, the creature you control from Reanimate is exiled."
      }
    ]
  },
  {
    "name": "Tasigur, the Golden Fang",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "13",
    "illustrator": "Igor Kieryluk",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Shaman"
    ],
    "rarity": "Special",
    "mana_cost": "5B",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Delve (Each card you exile from your graveyard while casting this spell pays for {1}.)",
      "{2}{G/U}{G/U}: Put the top two cards of your library into your graveyard, then return a nonland card of an opponent's choice from your graveyard to your hand."
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 457117,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "11/24/2014",
        "text": "You exile cards from your graveyard at the same time you pay the spell’s cost. Exiling a card this way is simply another way to pay that cost."
      },
      {
        "date": "11/24/2014",
        "text": "Delve doesn’t change a spell’s mana cost or converted mana cost. For example, the converted mana cost of Tasigur’s Cruelty (with mana cost {5}{B}) is 6 even if you exile three cards to cast it."
      },
      {
        "date": "11/24/2014",
        "text": "You can’t exile cards to pay for the colored mana requirements of a spell with delve."
      },
      {
        "date": "11/24/2014",
        "text": "You can’t exile more cards than the generic mana requirement of a spell with delve. For example, you can’t exile more than five cards from your graveyard to cast Tasigur’s Cruelty."
      },
      {
        "date": "11/24/2014",
        "text": "Because delve isn’t an alternative cost, it can be used in conjunction with alternative costs."
      },
      {
        "date": "12/7/2018",
        "text": "Tasigur’s last ability doesn’t target any card or player. You choose an opponent as the ability resolves and that player chooses a nonland card after you put the top two cards of your library into your graveyard."
      },
      {
        "date": "12/7/2018",
        "text": "The chosen opponent can choose any nonland card in your graveyard, not just one of the cards that was just put there."
      }
    ]
  },
  {
    "name": "Balefire Dragon",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "14",
    "illustrator": "Eric Deschamps",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Dragon"
    ],
    "rarity": "Special",
    "mana_cost": "5RR",
    "converted_mana_cost": 7,
    "oracle_text": [
      "Flying",
      "Whenever Balefire Dragon deals combat damage to a player, it deals that much damage to each creature that player controls."
    ],
    "flavor_text": null,
    "power": "6",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 457118,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "The damage dealt by Balefire Dragon’s triggered ability isn’t combat damage."
      }
    ]
  },
  {
    "name": "Through the Breach",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "15",
    "illustrator": "Randy Vargas",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [
      "Arcane"
    ],
    "rarity": "Special",
    "mana_cost": "4R",
    "converted_mana_cost": 5,
    "oracle_text": [
      "You may put a creature card from your hand onto the battlefield. That creature gains haste. Sacrifice that creature at the beginning of the next end step.",
      "Splice onto Arcane {2}{R}{R} (As you cast an Arcane spell, you may reveal this card from your hand and pay its splice cost. If you do, add this card's effects to that spell.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457119,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2007",
        "text": "Putting the card onto the battlefield is optional. When the ability resolves, you can choose not to."
      },
      {
        "date": "6/7/2013",
        "text": "You reveal all cards you intend to splice at the same time. Each individual card can be spliced only once onto any one spell."
      },
      {
        "date": "6/7/2013",
        "text": "A card with a splice ability can’t be spliced onto itself because the spell is on the stack (and not in your hand) when you reveal the cards you want to splice onto it."
      },
      {
        "date": "6/7/2013",
        "text": "You choose all targets for the spell after revealing cards you want to splice, including any targets required by the text of any of those cards. You may choose a different target for each instance of the word “target” on the resulting spell."
      },
      {
        "date": "6/7/2013",
        "text": "If all of the spell’s targets are illegal when the spell tries to resolve, it won’t resolve and none of its effects will happen."
      }
    ]
  },
  {
    "name": "Eternal Witness",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "16",
    "illustrator": "Chris Rahn",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Shaman"
    ],
    "rarity": "Special",
    "mana_cost": "1GG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "When Eternal Witness enters the battlefield, you may return target card from your graveyard to your hand."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 457120,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "If an instant or sorcery spell puts Eternal Witness onto the battlefield, its ability can target that card in your graveyard."
      }
    ]
  },
  {
    "name": "Life from the Loam",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "17",
    "illustrator": "Sung Choi",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": "1G",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Return up to three target land cards from your graveyard to your hand.",
      "Dredge 3 (If you would draw a card, instead you may put exactly three cards from the top of your library into your graveyard. If you do, return this card from your graveyard to your hand. Otherwise, draw a card.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457121,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/7/2013",
        "text": "Dredge lets you replace any card draw, not just the one during your draw step."
      },
      {
        "date": "6/7/2013",
        "text": "Once you decide to replace a draw using a card’s dredge ability, that card can’t be removed from your graveyard “in response.” (Replacement effects don’t use the stack.)"
      },
      {
        "date": "6/7/2013",
        "text": "You can’t use dredge unless you’re going to draw a card and the card with dredge is already in your graveyard."
      }
    ]
  },
  {
    "name": "Noble Hierarch",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "18",
    "illustrator": "Mark Zug",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Human",
      "Druid"
    ],
    "rarity": "Special",
    "mana_cost": "G",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Exalted (Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.)",
      "{T}: Add {G}, {W}, or {U}."
    ],
    "flavor_text": null,
    "power": "0",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 457122,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Tarmogoyf",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "19",
    "illustrator": "Filip Burburan",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Lhurgoyf"
    ],
    "rarity": "Special",
    "mana_cost": "1G",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Tarmogoyf's power is equal to the number of card types among cards in all graveyards and its toughness is equal to that number plus 1."
    ],
    "flavor_text": null,
    "power": "*",
    "toughness": "1+*",
    "loyalty": null,
    "multiverse_id": 457123,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "The ability that defines Tarmogoyf’s power and toughness works in all zones, not just the battlefield. If Tarmogoyf is in your graveyard, it will count itself."
      },
      {
        "date": "12/7/2018",
        "text": "Tarmogoyf counts card types, not cards. If the only card in all graveyards is a single artifact creature, Tarmogoyf will be 2/3. If the only cards in all graveyards are ten artifact creatures, Tarmogoyf will still be 2/3."
      },
      {
        "date": "12/7/2018",
        "text": "The card types that can appear on cards in a graveyard are artifact, creature, enchantment, instant, land, planeswalker, sorcery, and tribal. Legendary, basic, and snow are supertypes, not card types."
      },
      {
        "date": "12/7/2018",
        "text": "If an instant or sorcery spell deals damage to Tarmogoyf or lowers its toughness, that spell is put into its owner’s graveyard before state-based actions are performed. If that spell is the first of its type to enter a graveyard, it will raise Tarmogoyf’s toughness before the game checks to see if Tarmogoyf dies."
      }
    ]
  },
  {
    "name": "Vengevine",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "20",
    "illustrator": "Raymond Swanland",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Special",
    "mana_cost": "2GG",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Haste",
      "Whenever you cast a spell, if it's the second creature spell you cast this turn, you may return Vengevine from your graveyard to the battlefield."
    ],
    "flavor_text": null,
    "power": "4",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 457124,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "If you cast your second creature spell in a turn and Vengevine is in your graveyard, Vengevine’s second ability triggers and goes on the stack on top of that spell. The ability will resolve, allowing you to return Vengevine to the battlefield before the creature spell resolves. The ability resolves even if that creature spell is countered."
      },
      {
        "date": "12/7/2018",
        "text": "Vengevine’s triggered ability works only if Vengevine is already in your graveyard as you finish casting your second creature spell in a turn and if it remains there until the ability resolves."
      },
      {
        "date": "12/7/2018",
        "text": "Vengevine’s triggered ability checks the spells you cast over the course of the entire turn, not just the ones you cast while Vengevine is in your graveyard. For example, if you cast a creature spell, then Vengevine is put into your graveyard, then you cast another creature spell, Vengevine’s ability triggers."
      },
      {
        "date": "12/7/2018",
        "text": "Vengevine’s ability triggers only for the second creature spell you cast in a turn. It won’t trigger for the third, fourth, or so on. It also doesn’t matter how many noncreature spells you cast in a turn; the ability counts only the creature spells."
      }
    ]
  },
  {
    "name": "Gaddock Teeg",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "21",
    "illustrator": "Greg Staples",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Kithkin",
      "Advisor"
    ],
    "rarity": "Special",
    "mana_cost": "GW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Noncreature spells with converted mana cost 4 or greater can't be cast.",
      "Noncreature spells with {X} in their mana costs can't be cast."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 457125,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2007",
        "text": "If one half of a split card has a converted mana cost of 3 or less and doesn’t have an {X} in its mana cost, Gaddock Teeg lets you cast that half."
      },
      {
        "date": "12/7/2018",
        "text": "A spell’s converted mana cost is determined only by its mana cost. Alternative costs (including casting a spell “without paying its mana cost”), additional costs, and cost reductions don’t affect a spell’s converted mana cost."
      }
    ]
  },
  {
    "name": "Leovold, Emissary of Trest",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "22",
    "illustrator": "Magali Villeneuve",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Elf",
      "Advisor"
    ],
    "rarity": "Special",
    "mana_cost": "BGU",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Each opponent can't draw more than one card each turn.",
      "Whenever you or a permanent you control becomes the target of a spell or ability an opponent controls, you may draw a card."
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 457126,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "Your opponents can draw a maximum of one card each on each player’s turn. Subsequent card draws during that turn are ignored."
      },
      {
        "date": "12/7/2018",
        "text": "If an opponent hasn’t drawn any cards in a turn and a spell or ability instructs that player to draw multiple cards, that player will just draw one card. However, if the draws are optional, the player can’t choose to draw, even if they could draw one card this way."
      },
      {
        "date": "12/7/2018",
        "text": "Leovold will “see” cards drawn by opponents earlier in the turn before it entered the battlefield, although Leovold can’t affect cards drawn before it entered the battlefield. For example, if an opponent draws two cards, then Leovold enters the battlefield, that opponent can’t draw more cards that turn, but the two drawn cards are unaffected."
      },
      {
        "date": "12/7/2018",
        "text": "Replacement effects (such as that of dredge or Laboratory Maniac’s ability) can’t be used to replace draws that Leovold disallows. However, if an opponent’s first draw is replaced (by a dredge ability, for example), that draw didn’t happen and Leovold won’t stop the next draw."
      },
      {
        "date": "12/7/2018",
        "text": "If you and a permanent you control each become the target of the same spell or ability an opponent controls, Leovold’s ability will trigger twice. The same is true if two permanents you control become the target of the same spell or ability an opponent controls."
      }
    ]
  },
  {
    "name": "Lord of Extinction",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "23",
    "illustrator": "Izzy",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Special",
    "mana_cost": "3BG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Lord of Extinction's power and toughness are each equal to the number of cards in all graveyards."
    ],
    "flavor_text": null,
    "power": "*",
    "toughness": "*",
    "loyalty": null,
    "multiverse_id": 457127,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "The ability that defines Lord of Extinction’s power and toughness works in all zones, not just the battlefield. If Lord of Extinction is in your graveyard, it will count itself."
      },
      {
        "date": "12/7/2018",
        "text": "If an instant or sorcery spell deals damage to Lord of Extinction or lowers its toughness, that spell is put into its owner’s graveyard before state-based actions are performed. That card will raise Lord of Extinction’s toughness before the game checks to see if it dies."
      }
    ]
  },
  {
    "name": "Maelstrom Pulse",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "24",
    "illustrator": "John Avon",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": "1BG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Destroy target nonland permanent and all other permanents with the same name as that permanent."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457128,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2009",
        "text": "A face-down creature has no name, so it doesn’t have the same name as anything else."
      },
      {
        "date": "12/7/2018",
        "text": "Maelstrom Pulse has only one target. Other permanents with the same name will be destroyed even if they have hexproof or protection."
      },
      {
        "date": "12/7/2018",
        "text": "If the target permanent becomes an illegal target for Maelstrom Pulse, the spell doesn’t resolve. Nothing is destroyed."
      },
      {
        "date": "12/7/2018",
        "text": "The name of a creature token is the same as the creature types it was created with unless the token is a copy of another creature or the effect that created the token specifically gives it a different name. For example, a 1/1 red Elemental creature token created by Young Pyromancer and a 4/4 green Elemental creature token created by Walker of the Grove are both named “Elemental.”"
      },
      {
        "date": "12/7/2018",
        "text": "If Maelstrom Pulse resolves but the target permanent isn’t destroyed (perhaps because it regenerates or has indestructible), all other permanents with the same name as it will still be destroyed."
      }
    ]
  },
  {
    "name": "Sigarda, Host of Herons",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "25",
    "illustrator": "Chris Rahn",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Angel"
    ],
    "rarity": "Special",
    "mana_cost": "2GWW",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Flying, hexproof",
      "Spells and abilities your opponents control can't cause you to sacrifice permanents."
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 457129,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "As a spell or ability an opponent controls resolves, if it would force you to sacrifice a permanent, you just don’t. That part of the effect does nothing. If that spell or ability gives you the option to sacrifice a permanent (as Desecration Demon does), you can’t take that option."
      },
      {
        "date": "12/7/2018",
        "text": "If a spell or ability an opponent controls states that something happens unless you sacrifice a permanent (as Mogis, God of Slaughter does), you can’t choose to sacrifice a permanent. On the other hand, if a spell or ability an opponent controls instructs you to sacrifice a permanent unless you perform an action (as Killing Wave does), you can choose whether or not to perform the action. If you don’t perform the action, nothing happens, since you can’t sacrifice any permanents."
      },
      {
        "date": "12/7/2018",
        "text": "Sigarda’s ability affects only sacrifices. It won’t stop a creature from dying due to lethal damage or having 0 toughness, and it won’t stop a permanent from being put into its owner’s graveyard due to the “legend rule.” None of these are sacrifices; they’re the result of game rules."
      }
    ]
  },
  {
    "name": "Fulminator Mage",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "26",
    "illustrator": "Lucas Graciano",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Elemental",
      "Shaman"
    ],
    "rarity": "Special",
    "mana_cost": "1{B/R}{B/R}",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Sacrifice Fulminator Mage: Destroy target nonbasic land."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 457130,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Kitchen Finks",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "27",
    "illustrator": "Kev Walker",
    "types": [
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Ouphe"
    ],
    "rarity": "Special",
    "mana_cost": "1{G/W}{G/W}",
    "converted_mana_cost": 3,
    "oracle_text": [
      "When Kitchen Finks enters the battlefield, you gain 2 life.",
      "Persist (When this creature dies, if it had no -1/-1 counters on it, return it to the battlefield under its owner's control with a -1/-1 counter on it.)"
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 457131,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/7/2013",
        "text": "If a creature with persist stops being a creature, persist will still work."
      },
      {
        "date": "6/7/2013",
        "text": "The persist ability triggers when the permanent is put into a graveyard. Its last known information (that is, how the creature last existed on the battlefield) is used to determine whether it had a -1/-1 counter on it."
      },
      {
        "date": "6/7/2013",
        "text": "If a permanent has multiple instances of persist, they’ll each trigger separately, but the redundant instances will have no effect. If one instance returns the card to the battlefield, the next to resolve will do nothing."
      },
      {
        "date": "6/7/2013",
        "text": "If a token with no -1/-1 counters on it has persist, the ability will trigger when the token is put into the graveyard. However, the token will cease to exist and can’t return to the battlefield."
      },
      {
        "date": "6/7/2013",
        "text": "When a permanent with persist returns to the battlefield, it’s a new object with no memory of or connection to its previous existence."
      },
      {
        "date": "6/7/2013",
        "text": "If multiple creatures with persist are put into the graveyard at the same time (due to combat damage or a spell that destroys all creatures, for example), the active player (the player whose turn it is) puts all of their persist triggers on the stack in any order, then each other player in turn order does the same. The last trigger put on the stack is the first one that resolves. That means that in a two-player game, the nonactive player’s persist creatures will return to the battlefield first, then the active player’s persist creatures do the same. The creatures return to the battlefield one at a time."
      },
      {
        "date": "6/7/2013",
        "text": "If a creature with persist that has +1/+1 counters on it receives enough -1/-1 counters to cause it to be destroyed by lethal damage or put into its owner’s graveyard for having 0 or less toughness, persist won’t trigger and the card won’t return to the battlefield. That’s because persist checks the creature’s existence just before it leaves the battlefield, and it still has all those counters on it at that point."
      }
    ]
  },
  {
    "name": "Engineered Explosives",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "28",
    "illustrator": "Lars Grant-West",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": "X",
    "converted_mana_cost": 0,
    "oracle_text": [
      "Sunburst (This enters the battlefield with a charge counter on it for each color of mana spent to cast it.)",
      "{2}, Sacrifice Engineered Explosives: Destroy each nonland permanent with converted mana cost equal to the number of charge counters on Engineered Explosives."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457132,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/1/2004",
        "text": "If Engineered Explosives had no charge counters on it when you sacrificed it, it won’t destroy an animated land, because that permanent is a land in addition to being a creature."
      },
      {
        "date": "12/7/2018",
        "text": "You can choose any value for X as you cast Engineered Explosives. The value chosen for X doesn’t directly affect the number of charge counters Engineered Explosives enters the battlefield with, but it does let you pay more mana and thus spend more colors of mana to cast it."
      },
      {
        "date": "12/7/2018",
        "text": "Colorless mana won’t give Engineered Explosives another charge counter. Colorless is not a color."
      },
      {
        "date": "12/7/2018",
        "text": "A token has a converted mana cost of 0 unless it is copying something else."
      }
    ]
  },
  {
    "name": "Mana Vault",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "29",
    "illustrator": "Christine Choi",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": "1",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Mana Vault doesn't untap during your untap step.",
      "At the beginning of your upkeep, you may pay {4}. If you do, untap Mana Vault.",
      "At the beginning of your draw step, if Mana Vault is tapped, it deals 1 damage to you.",
      "{T}: Add {C}{C}{C}."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457133,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Platinum Emperion",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "30",
    "illustrator": "Igor Kieryluk",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [],
    "subtypes": [
      "Golem"
    ],
    "rarity": "Special",
    "mana_cost": "8",
    "converted_mana_cost": 8,
    "oracle_text": [
      "Your life total can't change. (You can't gain or lose life. You can't pay any amount of life except 0.)"
    ],
    "flavor_text": null,
    "power": "8",
    "toughness": "8",
    "loyalty": null,
    "multiverse_id": 457134,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "Platinum Emperion’s ability doesn’t prevent damage. Rather, it changes the results of that damage. For example, if a creature with lifelink deals damage to you, you won’t lose any life, but its controller will still gain that much life. Similarly, if a creature you control with lifelink deals damage to another player, that player will lose life but you won’t gain any life."
      },
      {
        "date": "12/7/2018",
        "text": "Abilities that trigger whenever damage is dealt to you will still trigger because that damage is still dealt, even though your life total doesn’t change as a result."
      },
      {
        "date": "12/7/2018",
        "text": "Spells and abilities that would normally cause you to gain or lose life still resolve, but the life-gain or life-loss part simply has no effect."
      },
      {
        "date": "12/7/2018",
        "text": "You can’t pay a cost that includes the payment of any amount of life other than 0 life. However, you can choose to be dealt damage, even though that damage won’t result in your life total changing."
      },
      {
        "date": "12/7/2018",
        "text": "If a cost would include causing you to gain life (like the alternative cost of an opponent’s Invigorate does), that cost can’t be paid."
      },
      {
        "date": "12/7/2018",
        "text": "Effects that would replace having you gain life with some other event won’t be able to be applied because it’s impossible for you to gain life."
      },
      {
        "date": "12/7/2018",
        "text": "Effects that replace an event with having you gain life (like Words of Worship’s effect does) or having you lose life will end up replacing the event with nothing."
      },
      {
        "date": "12/7/2018",
        "text": "If an effect says to set your life total to a certain number, that part of the effect won’t do anything."
      },
      {
        "date": "12/7/2018",
        "text": "If an effect would cause you to exchange life totals with another player, the exchange won’t happen. Neither player’s life total changes."
      },
      {
        "date": "12/7/2018",
        "text": "In a Commander game, the damage dealt to you by commanders will still be counted, even if that damage doesn’t cause you to lose life."
      }
    ]
  },
  {
    "name": "Ancient Tomb",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "31",
    "illustrator": "Yeong-Hao Han",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "{T}: Add {C}{C}. Ancient Tomb deals 2 damage to you."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457135,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Cavern of Souls",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "32",
    "illustrator": "Richard Wright",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "As Cavern of Souls enters the battlefield, choose a creature type.",
      "{T}: Add {C}.",
      "{T}: Add one mana of any color. Spend this mana only to cast a creature spell of the chosen type, and that spell can't be countered."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457136,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "You must choose an existing creature type, such as Human or Warrior. Card types such as artifact can’t be chosen."
      },
      {
        "date": "12/7/2018",
        "text": "The spell can’t be countered if the mana produced by Cavern of Souls is spent to cover any cost of the spell, even an additional cost such as a kicker cost. This is true even if you use the mana to pay an additional cost while casting a spell “without paying its mana cost.”"
      }
    ]
  },
  {
    "name": "Celestial Colonnade",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "33",
    "illustrator": "Eric Deschamps",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Celestial Colonnade enters the battlefield tapped.",
      "{T}: Add {W} or {U}.",
      "{3}{W}{U}: Until end of turn, Celestial Colonnade becomes a 4/4 white and blue Elemental creature with flying and vigilance. It's still a land."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457137,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/1/2010",
        "text": "A land that becomes a creature may be affected by “summoning sickness.” You can’t attack with it or use any of its {T} abilities (including its mana abilities) unless it began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when that permanent came under your control, not when it became a creature."
      },
      {
        "date": "3/1/2010",
        "text": "When a land becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
      },
      {
        "date": "12/7/2018",
        "text": "Once Celestial Colonnade has attacked, tapping it for mana won’t remove it from combat."
      },
      {
        "date": "12/7/2018",
        "text": "If Celestial Colonnade can’t attack unless you pay a cost that includes a mana payment, you may attack with it and tap it to pay for that cost. It will still attack in this case."
      }
    ]
  },
  {
    "name": "Creeping Tar Pit",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "34",
    "illustrator": "Jason Felix",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Creeping Tar Pit enters the battlefield tapped.",
      "{T}: Add {U} or {B}.",
      "{1}{U}{B}: Creeping Tar Pit becomes a 3/2 blue and black Elemental creature until end of turn and can't be blocked this turn. It's still a land."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457138,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/1/2010",
        "text": "A land that becomes a creature may be affected by “summoning sickness.” You can’t attack with it or use any of its {T} abilities (including its mana abilities) unless it began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when that permanent came under your control, not when it became a creature."
      },
      {
        "date": "3/1/2010",
        "text": "When a land becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
      }
    ]
  },
  {
    "name": "Dark Depths",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "35",
    "illustrator": "Mathias Kollros",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Legendary",
      "Snow"
    ],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Dark Depths enters the battlefield with ten ice counters on it.",
      "{3}: Remove an ice counter from Dark Depths.",
      "When Dark Depths has no ice counters on it, sacrifice it. If you do, create Marit Lage, a legendary 20/20 black Avatar creature token with flying and indestructible."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457139,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "Dark Depths really is a land with no mana ability. It doesn’t tap for colorless mana."
      },
      {
        "date": "12/7/2018",
        "text": "The last ability of Dark Depths is a state trigger. It won’t trigger again while the ability is on the stack, but if the ability is countered and Dark Depths is still on the battlefield with no ice counters on it, it will trigger again immediately."
      },
      {
        "date": "12/7/2018",
        "text": "If Dark Depths leaves the battlefield before its triggered ability resolves, you won’t be able to sacrifice it, so you won’t create Marit Lage."
      }
    ]
  },
  {
    "name": "Karakas",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "36",
    "illustrator": "Drew Baker",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "{T}: Add {W}.",
      "{T}: Return target legendary creature to its owner's hand."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457140,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Lavaclaw Reaches",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "37",
    "illustrator": "Véronique Meignaud",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Lavaclaw Reaches enters the battlefield tapped.",
      "{T}: Add {B} or {R}.",
      "{1}{B}{R}: Until end of turn, Lavaclaw Reaches becomes a 2/2 black and red Elemental creature with \"{X}: This creature gets +X/+0 until end of turn.\" It's still a land."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457141,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/1/2010",
        "text": "A land that becomes a creature may be affected by “summoning sickness.” You can’t attack with it or use any of its {T} abilities (including its mana abilities) unless it began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when that permanent came under your control, not when it became a creature."
      },
      {
        "date": "3/1/2010",
        "text": "When a land becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
      }
    ]
  },
  {
    "name": "Raging Ravine",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "38",
    "illustrator": "Todd Lockwood",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Raging Ravine enters the battlefield tapped.",
      "{T}: Add {R} or {G}.",
      "{2}{R}{G}: Until end of turn, Raging Ravine becomes a 3/3 red and green Elemental creature with \"Whenever this creature attacks, put a +1/+1 counter on it.\" It's still a land."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457142,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/1/2010",
        "text": "A land that becomes a creature may be affected by “summoning sickness.” You can’t attack with it or use any of its {T} abilities (including its mana abilities) unless it began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when that permanent came under your control, not when it became a creature."
      },
      {
        "date": "3/1/2010",
        "text": "When a land becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
      },
      {
        "date": "12/7/2018",
        "text": "Each time you activate Raging Ravine’s last ability, it gains an instance of the triggered ability. For example, if you activate the last ability twice and then attack with Raging Ravine, both of the triggered abilities it gained will trigger. It will get a total of two +1/+1 counters."
      },
      {
        "date": "12/7/2018",
        "text": "Any +1/+1 counters put on Raging Ravine remain on it even after it stops being a creature. They’ll have no effect until it becomes a creature again."
      }
    ]
  },
  {
    "name": "Stirring Wildwood",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "39",
    "illustrator": "Eric Deschamps",
    "types": [
      "Land"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Stirring Wildwood enters the battlefield tapped.",
      "{T}: Add {G} or {W}.",
      "{1}{G}{W}: Until end of turn, Stirring Wildwood becomes a 3/4 green and white Elemental creature with reach. It's still a land."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457143,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/1/2010",
        "text": "A land that becomes a creature may be affected by “summoning sickness.” You can’t attack with it or use any of its {T} abilities (including its mana abilities) unless it began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when that permanent came under your control, not when it became a creature."
      },
      {
        "date": "3/1/2010",
        "text": "When a land becomes a creature, that doesn’t count as having a creature enter the battlefield. The permanent was already on the battlefield; it only changed its types. Abilities that trigger whenever a creature enters the battlefield won’t trigger."
      }
    ]
  },
  {
    "name": "Urborg, Tomb of Yawgmoth",
    "set_name": "Ultimate Box Toppers",
    "collector_num": "40",
    "illustrator": "Jung Park",
    "types": [
      "Land"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [],
    "rarity": "Special",
    "mana_cost": null,
    "converted_mana_cost": 0,
    "oracle_text": [
      "Each land is a Swamp in addition to its other land types."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 457144,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "12/7/2018",
        "text": "Urborg, Tomb of Yawgmoth isn’t a Swamp while it’s not on the battlefield."
      },
      {
        "date": "12/7/2018",
        "text": "Land cards not on the battlefield aren’t Swamps while Urborg is on the battlefield."
      },
      {
        "date": "12/7/2018",
        "text": "Urborg’s ability causes each land on the battlefield to have the land type Swamp. Any land that’s a Swamp has the ability “{T}: Add {B}.” Nothing else changes about those lands, including their names, other subtypes, other abilities, and whether they’re legendary, basic, or snow."
      }
    ]
  }
]
