[
  {
    "name": "Cao Cao, Lord of Wei",
    "set_name": "From the Vault: Legends",
    "collector_num": "1",
    "illustrator": "Gao Jianzhang",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3BB",
    "converted_mana_cost": 5,
    "oracle_text": [
      "{T}: Target opponent discards two cards. Activate this ability only during your turn, before attackers are declared."
    ],
    "flavor_text": null,
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 244670,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "9/20/2013",
        "text": "If a turn has multiple combat phases, the ability can only be activated before the beginning of the declare attackers step of the first combat phase in that turn."
      }
    ]
  },
  {
    "name": "Captain Sisay",
    "set_name": "From the Vault: Legends",
    "collector_num": "2",
    "illustrator": "Ray Lago",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2GW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "{T}: Search your library for a legendary card, reveal that card, and put it into your hand. Then shuffle your library."
    ],
    "flavor_text": "Her leadership forged the Weatherlight's finest crew.",
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 244665,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "Because the “search” requires you to find a card with certain characteristics, you don’t have to find the card if you don’t want to."
      }
    ]
  },
  {
    "name": "Doran, the Siege Tower",
    "set_name": "From the Vault: Legends",
    "collector_num": "3",
    "illustrator": "Mark Zug",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Treefolk",
      "Shaman"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "WBG",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Each creature assigns combat damage equal to its toughness rather than its power."
    ],
    "flavor_text": "\"Each year that passes rings you inwardly with memory and might. Wield your heart, and the world will tremble.\"",
    "power": "0",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 244674,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2007",
        "text": "Doran’s ability means, for example, that a 2/3 creature will assign 3 damage in combat instead of 2."
      },
      {
        "date": "10/1/2007",
        "text": "Doran’s ability doesn’t actually change creatures’ power; it changes only the value of the combat damage they assign. All other rules and effects that check power or toughness use the real values."
      },
      {
        "date": "10/1/2007",
        "text": "This effect is mandatory and affects all creatures."
      }
    ]
  },
  {
    "name": "Kiki-Jiki, Mirror Breaker",
    "set_name": "From the Vault: Legends",
    "collector_num": "4",
    "illustrator": "Steven Belledin",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Goblin",
      "Shaman"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2RRR",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Haste",
      "{T}: Create a token that's a copy of target nonlegendary creature you control, except it has haste. Sacrifice it at the beginning of the next end step."
    ],
    "flavor_text": null,
    "power": "2",
    "toughness": "2",
    "loyalty": null,
    "multiverse_id": 244666,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "11/17/2017",
        "text": "The token copies exactly what was printed on the creature and nothing else (unless that creature was copying something else or was a token; see below). It doesn’t copy whether that creature was tapped or untapped, whether it had any counters on it or Auras and/or Equipment attached to it, or any non-copy effects that changed its power, toughness, types, color, and so on."
      },
      {
        "date": "11/17/2017",
        "text": "If the copied creature had {X} in its mana cost, X is 0."
      },
      {
        "date": "11/17/2017",
        "text": "If the copied creature was copying something else, the tokens enter the battlefield as whatever that creature was copying."
      },
      {
        "date": "11/17/2017",
        "text": "If the copied creature is a token, the tokens created by Kiki-Jiki’s ability copies the original characteristics of that token as stated by the effect that put it onto the battlefield."
      },
      {
        "date": "11/17/2017",
        "text": "Any enters-the-battlefield abilities of the copied creature will trigger when the tokens enter the battlefield. Any “As [this creature] enters the battlefield” or “[This creature] enters the battlefield with” abilities of the copied creature will also work."
      }
    ]
  },
  {
    "name": "Kresh the Bloodbraided",
    "set_name": "From the Vault: Legends",
    "collector_num": "5",
    "illustrator": "Steve Argyle",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Warrior"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2BRG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Whenever another creature dies, you may put X +1/+1 counters on Kresh the Bloodbraided, where X is that creature's power."
    ],
    "flavor_text": "Each of his twenty-two braids is bound with bone and leather from a foe.",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 244672,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "X is equal to the power of the creature as it last existed on the battlefield."
      }
    ]
  },
  {
    "name": "Mikaeus, the Lunarch",
    "set_name": "From the Vault: Legends",
    "collector_num": "6",
    "illustrator": "Steven Belledin",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Cleric"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "XW",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Mikaeus, the Lunarch enters the battlefield with X +1/+1 counters on it.",
      "{T}: Put a +1/+1 counter on Mikaeus.",
      "{T}, Remove a +1/+1 counter from Mikaeus: Put a +1/+1 counter on each other creature you control."
    ],
    "flavor_text": null,
    "power": "0",
    "toughness": "0",
    "loyalty": null,
    "multiverse_id": 259296,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Omnath, Locus of Mana",
    "set_name": "From the Vault: Legends",
    "collector_num": "7",
    "illustrator": "Mike Bierek",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Elemental"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2G",
    "converted_mana_cost": 3,
    "oracle_text": [
      "You don't lose unspent green mana as steps and phases end.",
      "Omnath, Locus of Mana gets +1/+1 for each unspent green mana you have."
    ],
    "flavor_text": "It gathers against the coming storm.",
    "power": "1",
    "toughness": "1",
    "loyalty": null,
    "multiverse_id": 259295,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/1/2010",
        "text": "You can keep green mana in your mana pool indefinitely while Omnath is on the battlefield. That means if you add a green mana to your mana pool during one step or phase, you can spend it during a later step or phase, or even a later turn. Other types of mana will continue to empty from your mana pool as each step and phase ends."
      },
      {
        "date": "3/1/2010",
        "text": "If a green mana you add to your mana pool has certain restrictions or riders associated with it (for example, if it was produced by Ancient Ziggurat), they’ll apply to that mana no matter when you spend it."
      },
      {
        "date": "3/1/2010",
        "text": "Once Omnath leaves the battlefield, you have until the end of the current step or phase to spend whatever green mana is in your mana pool before it too empties as normal. There is no penalty associated with this other than the loss of the mana."
      }
    ]
  },
  {
    "name": "Oona, Queen of the Fae",
    "set_name": "From the Vault: Legends",
    "collector_num": "8",
    "illustrator": "Adam Rex",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Faerie",
      "Wizard"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3{U/B}{U/B}{U/B}",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Flying",
      "{X}{U/B}: Choose a color. Target opponent exiles the top X cards of their library. For each card of the chosen color exiled this way, create a 1/1 blue and black Faerie Rogue creature token with flying."
    ],
    "flavor_text": null,
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 244668,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2008",
        "text": "You target the opponent when you activate Oona’s ability. You don’t choose the color until the ability resolves."
      },
      {
        "date": "5/1/2008",
        "text": "The tokens enter the battlefield under your control."
      }
    ]
  },
  {
    "name": "Progenitus",
    "set_name": "From the Vault: Legends",
    "collector_num": "9",
    "illustrator": "Mike Bierek",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Hydra",
      "Avatar"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "WWUUBBRRGG",
    "converted_mana_cost": 10,
    "oracle_text": [
      "Protection from everything",
      "If Progenitus would be put into a graveyard from anywhere, reveal Progenitus and shuffle it into its owner's library instead."
    ],
    "flavor_text": "The Soul of the World has returned.",
    "power": "10",
    "toughness": "10",
    "loyalty": null,
    "multiverse_id": 244675,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2009",
        "text": "“Protection from everything” means the following: Progenitus can’t be blocked, Progenitus can’t be enchanted or equipped, Progenitus can’t be the target of spells or abilities, and all damage that would be dealt to Progenitus is prevented."
      },
      {
        "date": "2/1/2009",
        "text": "Progenitus can still be affected by effects that don’t target it or deal damage to it (such as Day of Judgment)."
      }
    ]
  },
  {
    "name": "Rafiq of the Many",
    "set_name": "From the Vault: Legends",
    "collector_num": "10",
    "illustrator": "Wayne Reynolds",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Knight"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "1GWU",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Exalted (Whenever a creature you control attacks alone, that creature gets +1/+1 until end of turn.)",
      "Whenever a creature you control attacks alone, it gains double strike until end of turn."
    ],
    "flavor_text": "Many sigils, one purpose.",
    "power": "3",
    "toughness": "3",
    "loyalty": null,
    "multiverse_id": 244669,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "If you declare exactly one creature as an attacker, each exalted ability on each permanent you control (including, perhaps, the attacking creature itself) will trigger. The bonuses are given to the attacking creature, not to the permanent with exalted. Ultimately, the attacking creature will wind up with +1/+1 for each of your exalted abilities."
      },
      {
        "date": "10/1/2008",
        "text": "If you attack with multiple creatures, but then all but one are removed from combat, your exalted abilities won’t trigger."
      },
      {
        "date": "10/1/2008",
        "text": "Some effects put creatures onto the battlefield attacking. Since those creatures were never declared as attackers, they’re ignored by exalted abilities. They won’t cause exalted abilities to trigger. If any exalted abilities have already triggered (because exactly one creature was declared as an attacker), those abilities will resolve as normal even though there may now be multiple attackers."
      },
      {
        "date": "10/1/2008",
        "text": "Exalted abilities will resolve before blockers are declared."
      },
      {
        "date": "10/1/2008",
        "text": "Exalted bonuses last until end of turn. If an effect creates an additional combat phase during your turn, a creature that attacked alone during the first combat phase will still have its exalted bonuses in that new phase. If a creature attacks alone during the second combat phase, all your exalted abilities will trigger again."
      },
      {
        "date": "10/1/2008",
        "text": "In a Two-Headed Giant game, a creature “attacks alone” if it’s the only creature declared as an attacker by your entire team. If you control that attacking creature, your exalted abilities will trigger but your teammate’s exalted abilities won’t."
      }
    ]
  },
  {
    "name": "Sharuum the Hegemon",
    "set_name": "From the Vault: Legends",
    "collector_num": "11",
    "illustrator": "Todd Lockwood",
    "types": [
      "Artifact",
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Sphinx"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3WUB",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Flying",
      "When Sharuum the Hegemon enters the battlefield, you may return target artifact card from your graveyard to the battlefield."
    ],
    "flavor_text": "To gain audience with the hegemon, one must bring a riddle she has not heard.",
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 244664,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Sun Quan, Lord of Wu",
    "set_name": "From the Vault: Legends",
    "collector_num": "12",
    "illustrator": "Xu Xiaoming",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Soldier"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "4UU",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Creatures you control have horsemanship. (They can't be blocked except by creatures with horsemanship.)"
    ],
    "flavor_text": "\"One score and four he reigned, the Southland king: / A dragon coiled, a tiger poised below the mighty Yangtze.\"",
    "power": "4",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 244663,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "Despite the similarities between horsemanship and flying, horsemanship doesn’t interact with flying or reach."
      },
      {
        "date": "10/1/2009",
        "text": "Sun Quan’s ability affects Sun Quan itself."
      }
    ]
  },
  {
    "name": "Teferi, Mage of Zhalfir",
    "set_name": "From the Vault: Legends",
    "collector_num": "13",
    "illustrator": "Volkan Baga",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Human",
      "Wizard"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "2UUU",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Flash (You may cast this spell any time you could cast an instant.)",
      "Creature cards you own that aren't on the battlefield have flash.",
      "Each opponent can cast spells only any time they could cast a sorcery."
    ],
    "flavor_text": "To save this plane, he must forsake all others.",
    "power": "3",
    "toughness": "4",
    "loyalty": null,
    "multiverse_id": 244667,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "5/1/2007",
        "text": "If you have Teferi on the battlefield and there’s a Split Second spell on the stack (such as Sudden Death), you can’t Suspend creatures until after the Split Second spell resolves."
      },
      {
        "date": "11/17/2017",
        "text": "Teferi’s last ability means that in order for an opponent to cast a spell, it must be that opponent’s turn, during a main phase, and the stack must be empty. This is true even if the player doesn’t have a sorcery they are able to cast, or if a rule or effect allows a sorcery to be cast at another time."
      },
      {
        "date": "11/17/2017",
        "text": "If you have Teferi on the battlefield, you may exile creature cards in your hand with suspend any time you could cast an instant."
      },
      {
        "date": "11/17/2017",
        "text": "If a spell or ability lets an opponent cast a card as part of its effect (such as suspend and rebound do), that opponent can’t cast that card since the currently resolving ability is still on the stack. This is true even if that card is an instant."
      }
    ]
  },
  {
    "name": "Ulamog, the Infinite Gyre",
    "set_name": "From the Vault: Legends",
    "collector_num": "14",
    "illustrator": "Aleksi Briclot",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Eldrazi"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "11",
    "converted_mana_cost": 11,
    "oracle_text": [
      "When you cast this spell, destroy target permanent.",
      "Indestructible",
      "Annihilator 4 (Whenever this creature attacks, defending player sacrifices four permanents.)",
      "When Ulamog, the Infinite Gyre is put into a graveyard from anywhere, its owner shuffles their graveyard into their library."
    ],
    "flavor_text": null,
    "power": "10",
    "toughness": "10",
    "loyalty": null,
    "multiverse_id": 261321,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/15/2010",
        "text": "Annihilator abilities trigger and resolve during the declare attackers step. The defending player chooses and sacrifices the required number of permanents before they declare blockers. Any creatures sacrificed this way won’t be able to block."
      },
      {
        "date": "6/15/2010",
        "text": "If a creature with annihilator is attacking a planeswalker, and the defending player chooses to sacrifice that planeswalker, the attacking creature continues to attack. It may be blocked. If it isn’t blocked, it simply won’t deal combat damage to anything."
      },
      {
        "date": "7/1/2013",
        "text": "Lethal damage and effects that say “destroy” won’t cause a creature with indestructible to be put into the graveyard. However, a creature with indestructible can be put into the graveyard for a number of reasons. The most likely reasons are if it’s sacrificed, if it’s legendary and another legendary creature with the same name is controlled by the same player, or if its toughness is 0 or less."
      },
      {
        "date": "12/7/2018",
        "text": "Ulamog’s ability triggers as you cast it, and that ability resolves before the spell itself. It resolves even if that spell is countered."
      }
    ]
  },
  {
    "name": "Visara the Dreadful",
    "set_name": "From the Vault: Legends",
    "collector_num": "15",
    "illustrator": "Brad Rigney",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Gorgon"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "3BBB",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Flying",
      "{T}: Destroy target creature. It can't be regenerated."
    ],
    "flavor_text": "\"My eyes are my strongest feature.\"",
    "power": "5",
    "toughness": "5",
    "loyalty": null,
    "multiverse_id": 244677,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  }
]
