[
  {
    "name": "Armageddon",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "1",
    "illustrator": "Chris Rahn",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "3W",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Destroy all lands."
    ],
    "flavor_text": "A bloody dawn broke over a scabbed and tortured world.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386284,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Burning of Xinye",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "2",
    "illustrator": "Yang Hong",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "4RR",
    "converted_mana_cost": 6,
    "oracle_text": [
      "You destroy four lands you control, then target opponent destroys four lands they control. Then Burning of Xinye deals 4 damage to each creature."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386285,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2009",
        "text": "Burning of Xinye targets only an opponent. If that player is an illegal target by the time Burning of Xinye resolves, the entire spell doesn’t resolve."
      },
      {
        "date": "10/1/2009",
        "text": "The lands that will be destroyed aren’t chosen until Burning of Xinye resolves."
      },
      {
        "date": "10/1/2009",
        "text": "A land with a regeneration shield on it will regenerate from Burning of Xinye’s destruction effect. However, the spell or ability that creates that shield must be cast or activated before Burning of Xinye starts to resolve."
      },
      {
        "date": "10/1/2009",
        "text": "In a multiplayer game, only lands controlled by two players (you and the targeted opponent) are destroyed. However, Burning of Xinye will deal 4 damage to each creature, even those controlled by other players."
      },
      {
        "date": "7/1/2013",
        "text": "As Burning of Xinye resolves, first you destroy four lands you control (all at the same time), then the targeted opponent destroys four lands they control (all at the same time). That player chooses which of their lands to destroy. Neither of you can choose to destroy a land with indestructible."
      }
    ]
  },
  {
    "name": "Cataclysm",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "3",
    "illustrator": "Eric Deschamps",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "2WW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Each player chooses from among the permanents they control an artifact, a creature, an enchantment, and a land, then sacrifices the rest."
    ],
    "flavor_text": "\"Keep with you only this much: your mount, your blade, and your wits. The rest you can find, build, or take.\"\n—Horse clans' wisdom",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386286,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "If you control a permanent with more than one type, you can choose that same permanent for more than one of the choices if you want to. This makes it possible to select an artifact creature as both your artifact and creature, and then select a land and thereby keep only two cards."
      },
      {
        "date": "10/4/2004",
        "text": "If you control a permanent with more than one type, you can choose that permanent to be the representative of either type. This makes it possible to have more than one creature (or other permanent type) on the battlefield. For example, if you select a creature for your creature and an artifact creature for your artifact, you get to keep both of these creatures."
      },
      {
        "date": "10/4/2004",
        "text": "The permanents to save are chosen on resolution. You do not choose them when casting the spell."
      },
      {
        "date": "10/4/2004",
        "text": "The current player makes their choices before the other player. After both players make choices, all the sacrifices are done simultaneously."
      },
      {
        "date": "2/1/2014",
        "text": "Each permanent not chosen by a player will be sacrificed. If a permanent has none of the listed types (for example, a Planeswalker with no other types), it can’t be chosen."
      }
    ]
  },
  {
    "name": "Child of Alara",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "4",
    "illustrator": "Steve Argyle",
    "types": [
      "Creature"
    ],
    "supertypes": [
      "Legendary"
    ],
    "subtypes": [
      "Avatar"
    ],
    "rarity": "Mythic Rare",
    "mana_cost": "WUBRG",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Trample",
      "When Child of Alara dies, destroy all nonland permanents. They can't be regenerated."
    ],
    "flavor_text": "The progeny of the Maelstrom shows no allegiance—and no mercy—to any of the five shards.",
    "power": "6",
    "toughness": "6",
    "loyalty": null,
    "multiverse_id": 386287,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Decree of Annihilation",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "5",
    "illustrator": "John Avon",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "8RR",
    "converted_mana_cost": 10,
    "oracle_text": [
      "Exile all artifacts, creatures, and lands from the battlefield, all cards from all graveyards, and all cards from all hands.",
      "Cycling {5}{R}{R} ({5}{R}{R}, Discard this card: Draw a card.)",
      "When you cycle Decree of Annihilation, destroy all lands."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386288,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/1/2008",
        "text": "Cycling is an activated ability. Effects that interact with activated abilities (such as Stifle or Rings of Brighthearth) will interact with cycling. Effects that interact with spells (such as Remove Soul or Faerie Tauntings) will not."
      },
      {
        "date": "10/1/2008",
        "text": "When you cycle this card, first the cycling ability goes on the stack, then the triggered ability goes on the stack on top of it. The triggered ability will resolve before you draw a card from the cycling ability."
      },
      {
        "date": "10/1/2008",
        "text": "The cycling ability and the triggered ability are separate. If the triggered ability doesn’t resolve (due to being countered with Stifle, for example, or if all its targets have become illegal), the cycling ability will still resolve and you’ll draw a card."
      }
    ]
  },
  {
    "name": "Firespout",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "6",
    "illustrator": "Raymond Swanland",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "2{R/G}",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Firespout deals 3 damage to each creature without flying if {R} was spent to cast this spell and 3 damage to each creature with flying if {G} was spent to cast this spell. (Do both if {R}{G} was spent.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386289,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "6/8/2016",
        "text": "This spell cares about what mana was spent to pay its total cost, not just what mana was spent to pay the hybrid mana symbol in its cost."
      },
      {
        "date": "6/8/2016",
        "text": "This spell checks on resolution to see if any mana of the appropriate colors were spent to pay its cost. It doesn’t matter how much mana of that color was spent; the effect isn’t multiplied."
      },
      {
        "date": "6/8/2016",
        "text": "If this spell is copied, the copy will not have had any colors of mana paid for it, no matter what colors were spent on the original spell."
      }
    ]
  },
  {
    "name": "Fracturing Gust",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "7",
    "illustrator": "Michael Sutfin",
    "types": [
      "Instant"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "2{G/W}{G/W}{G/W}",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Destroy all artifacts and enchantments. You gain 2 life for each permanent destroyed this way."
    ],
    "flavor_text": "Elvish dawnhands test a relic's worthiness before collecting it for the safehold. If it can't stand up to a stiff breeze, it's left behind.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386290,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "7/1/2013",
        "text": "If an artifact or enchantment remains on the battlefield because it was regenerated or has indestructible, you won’t gain life for it."
      }
    ]
  },
  {
    "name": "Living Death",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "8",
    "illustrator": "Mark Winters",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "3BB",
    "converted_mana_cost": 5,
    "oracle_text": [
      "Each player exiles all creature cards from their graveyard, then sacrifices all creatures they control, then puts all cards they exiled this way onto the battlefield."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386291,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/16/2018",
        "text": "As Living Death resolves, all players exile their creature cards from graveyards at the same time. Then all players sacrifice all creatures they control at the same time. Then all players put all creatures they exiled onto the battlefield at the same time."
      },
      {
        "date": "3/16/2018",
        "text": "Only cards exiled by Living Death’s first instruction are put onto the battlefield. If a replacement effect (such as that of Leyline of the Void) causes any of the sacrificed creatures to be exiled instead of put into a graveyard, those cards aren’t returned to the battlefield."
      }
    ]
  },
  {
    "name": "Martial Coup",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "9",
    "illustrator": "Greg Staples",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "XWW",
    "converted_mana_cost": 2,
    "oracle_text": [
      "Create X 1/1 white Soldier creature tokens. If X is 5 or more, destroy all other creatures."
    ],
    "flavor_text": "Their war forgotten, the nations of Bant stood united in the face of a common threat.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386292,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "2/1/2009",
        "text": "Martial Coup checks the number you chose for X, not the amount of mana you actually spent."
      },
      {
        "date": "2/1/2009",
        "text": "You do what the spell says in order. If X is 5 or more, you’ll put the Soldier tokens onto the battlefield, then you’ll destroy all other creatures."
      },
      {
        "date": "2/1/2009",
        "text": "No one can cast spells or activate abilities between the time the Soldier tokens are put onto the battlefield and the time all other creatures are destroyed. For example, you can’t sacrifice one of those Soldier tokens to regenerate a Skeletal Kathari."
      }
    ]
  },
  {
    "name": "Rolling Earthquake",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "10",
    "illustrator": "Yang Hong",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "XR",
    "converted_mana_cost": 1,
    "oracle_text": [
      "Rolling Earthquake deals X damage to each creature without horsemanship and each player."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386293,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Smokestack",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "11",
    "illustrator": "Daniel Ljunggren",
    "types": [
      "Artifact"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "4",
    "converted_mana_cost": 4,
    "oracle_text": [
      "At the beginning of your upkeep, you may put a soot counter on Smokestack.",
      "At the beginning of each player's upkeep, that player sacrifices a permanent for each soot counter on Smokestack."
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386294,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "10/4/2004",
        "text": "If a player does not have enough permanents, they sacrifice all the ones they have."
      },
      {
        "date": "10/4/2004",
        "text": "Adding a counter is optional. If you forget to add one during your upkeep, you cannot back up and add one later."
      }
    ]
  },
  {
    "name": "Terminus",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "12",
    "illustrator": "James Paick",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "4WW",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Put all creatures on the bottom of their owners' libraries.",
      "Miracle {W} (You may cast this card for its miracle cost when you draw it if it's the first card you drew this turn.)"
    ],
    "flavor_text": null,
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386295,
    "other_part": null,
    "color_indicator": null,
    "rulings": [
      {
        "date": "3/14/2017",
        "text": "Each player chooses the order that creatures they own are put onto the bottom of their library. This order isn’t revealed to other players."
      },
      {
        "date": "7/13/2018",
        "text": "It’s important to reveal a card with miracle before it is mixed with the other cards in your hand."
      },
      {
        "date": "7/13/2018",
        "text": "You can reveal and cast a card with miracle on any turn, not just your own, if it’s the first card you’ve drawn that turn."
      },
      {
        "date": "7/13/2018",
        "text": "Multiple card draws are always treated as a sequence of individual card draws. For example, if you haven’t drawn any cards yet during a turn and cast a spell that instructs you to draw three cards, you’ll draw them one at a time. Only the first card drawn this way may be revealed and cast using its miracle ability."
      },
      {
        "date": "7/13/2018",
        "text": "If an effect puts a card into your hand without using the word “draw,” the card wasn’t drawn."
      },
      {
        "date": "7/13/2018",
        "text": "You don’t have to reveal a drawn card with miracle if you don’t wish to cast it at that time."
      },
      {
        "date": "7/13/2018",
        "text": "You can cast a card for its miracle cost only as the miracle triggered ability resolves. If you don’t want to cast it at that time (or you can’t cast it, perhaps because there are no legal targets available), you won’t be able to cast it later for the miracle cost."
      },
      {
        "date": "7/13/2018",
        "text": "You cast the card with miracle during the resolution of the triggered ability. Ignore any timing rules based on the card’s type."
      },
      {
        "date": "7/13/2018",
        "text": "Miracle is an alternative cost to cast the spell with miracle. It can’t be combined with other alternative costs, such as casting a spell “without paying its mana cost.”"
      },
      {
        "date": "7/13/2018",
        "text": "To determine the total cost of a spell, start with the mana cost or alternative cost (such as a miracle cost) you’re paying, add any cost increases, then apply any cost reductions. The converted mana cost of the spell remains unchanged, no matter what the total cost to cast it was."
      },
      {
        "date": "7/13/2018",
        "text": "If the card with miracle leaves your hand before the triggered ability resolves, you won’t be able to cast it using its miracle ability."
      },
      {
        "date": "7/13/2018",
        "text": "You still draw the card, whether you use the miracle ability or not. Any ability that triggers whenever you draw a card, for example, will trigger. If you don’t cast the card using its miracle ability, it will remain in your hand."
      }
    ]
  },
  {
    "name": "Upheaval",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "13",
    "illustrator": "Kev Walker",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "4UU",
    "converted_mana_cost": 6,
    "oracle_text": [
      "Return all permanents to their owners' hands."
    ],
    "flavor_text": "The calm comes after the storm.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386296,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Virtue's Ruin",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "14",
    "illustrator": "Mike Dringenberg",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "2B",
    "converted_mana_cost": 3,
    "oracle_text": [
      "Destroy all white creatures."
    ],
    "flavor_text": "All must fall, and those who stand highest fall hardest.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386297,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  },
  {
    "name": "Wrath of God",
    "set_name": "From the Vault: Annihilation",
    "collector_num": "15",
    "illustrator": "Willian Murai",
    "types": [
      "Sorcery"
    ],
    "supertypes": [],
    "subtypes": [],
    "rarity": "Mythic Rare",
    "mana_cost": "2WW",
    "converted_mana_cost": 4,
    "oracle_text": [
      "Destroy all creatures. They can't be regenerated."
    ],
    "flavor_text": "Legend speaks of the lost coastal polis of Olantin, whose inhabitants' hubris enraged the sun god Heliod.",
    "power": null,
    "toughness": null,
    "loyalty": null,
    "multiverse_id": 386298,
    "other_part": null,
    "color_indicator": null,
    "rulings": []
  }
]
