{
  "992": [
    {
      "content": "This was first artifact that could prevent damage both from creatures and the player. And Oasis could only affect creatures.",
      "posted_by": "tavaritz",
      "posted_at": "4/29/2011 12:31:22 PM",
      "rating": 10
    },
    {
      "content": "It did almost nothing for its time, though it let any color prevent damage, hence the excessive cost.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:30:06 AM",
      "rating": 10
    },
    {
      "content": "This card is far too slow, especially with Oasis so easily available during the same period, as well of the COPS...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 9:44:29 AM",
      "rating": 7
    },
    {
      "content": "A sad victim of power creep. Not many people are going to want to play a card which only prevents one damage per turn, never mind paying two mana a pop for it. Compare to Shield of the Ages or any of the Circles of Protection for a start...",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 9:38:27 AM",
      "rating": 7
    },
    {
      "content": "It feels so cleric-ish but it's not nearly as good.",
      "posted_by": "thaviel",
      "posted_at": "3/1/2009 8:08:53 PM",
      "rating": 5
    },
    {
      "content": "This card is bad and it should feal bad!1/5 Stars",
      "posted_by": "Hunter06",
      "posted_at": "2/5/2013 6:40:02 PM",
      "rating": 1
    },
    {
      "content": "Hey, they misspelled \"Organ-Kean\" on the card.",
      "posted_by": "Kirbster",
      "posted_at": "12/5/2012 9:59:49 AM",
      "rating": 0
    }
  ],
  "1064": [
    {
      "content": "Nowadays a 1/1 for 3 mana generally has to offer something special to be considered playable, but I contend that this still is fairly special in its own regard. It's pretty innocuous and can affect the board strongly. Of course once an opponent cottons on, it's toast. And Goblin Welder is better, natch.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 9:42:12 AM",
      "rating": 10
    },
    {
      "content": "This is actually a pretty good card, and could serve as a budget alternative to Goblin Welder...But still I'd feel weird if I said \"Summon Archaeologist\"...That sounds far too nerdy, even in Magic",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 9:54:18 AM",
      "rating": 10
    },
    {
      "content": "I love the art. The guy's clothing is way too contemporary for the typical Magic setting.",
      "posted_by": "TDL",
      "posted_at": "11/2/2010 5:25:45 PM",
      "rating": 10
    },
    {
      "content": "@Evil The thing is, this guy bring artifacts back, which means one's you have to sac to get their effect, whereis Metallurgeon regenerates artifacts, which is normally only helpful to Artifact Creatures.",
      "posted_by": "Request",
      "posted_at": "5/24/2010 9:37:51 AM",
      "rating": 9
    },
    {
      "content": "the more i use this guy in play, the more i love him. my friends hate this card because i keep digging up my ivory towers and winter orb. definitely not a 5/5, but he's still pretty darn good. 4/5!!!!!",
      "posted_by": "gasimakos1",
      "posted_at": "5/6/2011 1:04:57 PM",
      "rating": 9
    },
    {
      "content": "Compare to Hanna, ship's navigator",
      "posted_by": "Kryptnyt",
      "posted_at": "5/13/2011 3:37:19 PM",
      "rating": 9
    },
    {
      "content": "He's was always good at digging up a Black Lotus",
      "posted_by": "nORMAL00",
      "posted_at": "12/7/2009 10:00:58 PM",
      "rating": 8
    },
    {
      "content": "Wow.A permanent that enables artifact recursion on a regular basis.That's awesome.5/5",
      "posted_by": "AmericanVigor",
      "posted_at": "11/29/2010 11:30:12 PM",
      "rating": 8
    },
    {
      "content": "There are no comments yet for this card (or rating). Be the first!",
      "posted_by": "evenblackerlotus",
      "posted_at": "10/23/2009 11:53:33 PM",
      "rating": 1
    },
    {
      "content": "How about Metallurgeon. Waaay better isn't it? Or am I not seeing something. Obviously Goblin Welder is amazing, but as in the same exact effect, by tapping mana, Metallurgeon kills the competition.",
      "posted_by": "EvilCleavage",
      "posted_at": "5/2/2010 7:42:35 PM",
      "rating": 1
    },
    {
      "content": "More powerful cards have been printed, but he's still good since he can keep bringing artifacts back.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:31:19 AM",
      "rating": 0
    },
    {
      "content": "This card was insanely powerful at the time of printing. Antiquities was not called age of the artificers for nothing! My most successful deck of all time was built around this card. It was essentially an artifact deck which included Mishra's Workshop, Urza's lands, artifact creatures and 4 Divine offerings. The usual mode of operation was to pull out a Triskellion, use up the counters, sac it for life, then return it to play with the Archaeologist. P.S. Always wondered why this card was represented by a male as storywise the archaeologist Tocasia was a woman.",
      "posted_by": "Gamalgoth",
      "posted_at": "1/16/2012 11:40:39 AM",
      "rating": 0
    },
    {
      "content": "EvilCleavage, Metallurgeon's effect only allows to protect an artifact. If it's already destroyed, the Archaeologist is what you need.",
      "posted_by": "Arachnos",
      "posted_at": "1/14/2013 10:22:16 PM",
      "rating": 0
    },
    {
      "content": "Powerful card when combined with sacrifice artifact effects. Of course it has a giant removal target, but most good cards do.",
      "posted_by": "TheWrathofShane",
      "posted_at": "6/21/2013 5:37:18 AM",
      "rating": 0
    }
  ],
  "1065": [
    {
      "content": "So glad they gave it Artificer.",
      "posted_by": "mrredhatter",
      "posted_at": "10/2/2009 2:53:17 PM",
      "rating": 10
    },
    {
      "content": "This has got to be one of the few old cards that has actually gotten better over time, since Mirrodin block and all that.  2.5/5",
      "posted_by": "themicronaut",
      "posted_at": "1/17/2010 5:35:10 AM",
      "rating": 10
    },
    {
      "content": "@ stygimolochWish granted",
      "posted_by": "SIlverSkyz",
      "posted_at": "12/18/2010 5:19:36 AM",
      "rating": 10
    },
    {
      "content": "Pretty cool idea. Another card concept which the game could do with revisiting someday. Between Esper and Scarecrows, it'd probably alright in some casual formats today, maybe with that colourless mana shaved off and/or being an artifact creature itself.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 9:44:04 AM",
      "rating": 9
    },
    {
      "content": "I agree although this type of ability historically usually goes unused...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 9:55:27 AM",
      "rating": 8
    },
    {
      "content": "Too specific and expensive to use. Though the flavor is nice.",
      "posted_by": "Weretarrasque",
      "posted_at": "7/25/2009 9:18:33 AM",
      "rating": 6
    },
    {
      "content": "errr Abuna Acolyte",
      "posted_by": "use643",
      "posted_at": "8/13/2011 10:28:53 AM",
      "rating": 0
    }
  ],
  "1050": [
    {
      "content": "Possibly the only Magic card to have \"rape\" in its flavor text... awkward.",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/20/2012 10:35:05 PM",
      "rating": 10
    },
    {
      "content": "This can be equipped however...This was used as a anti-Juggernaut tech for quite a bit...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 9:57:34 AM",
      "rating": 9
    },
    {
      "content": "It can still be targeted by artifacts, like Tawnos' Weaponry, so it isn't protection from artifacts.",
      "posted_by": "Bouchart",
      "posted_at": "9/6/2009 7:40:49 PM",
      "rating": 8
    },
    {
      "content": "Should really just read 'Protection from artifacts'. But then I guess that's the point of Tel-Jilad Chosen and Nacatl Savage, isn't it?",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 9:46:09 AM",
      "rating": 4
    },
    {
      "content": "Wait, where are the- Oh! I see them! Ithought it was one of those old green sorceries that just show plants for no particular reason.\nWhat about the card itself? Mediocre!\nIt also proves that Wizards is definitely NOT going to give green creatures flying unless they have to or it's Planar Chaos.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/14/2009 7:01:00 AM",
      "rating": 1
    },
    {
      "content": "Strange how they didn't just give it \"protection from artifacts\" - after all, they had already created cards that had \"protection from Deserts\" so it wasn't that new a concept. Anyway, superior versions have been created in later years.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:32:52 AM",
      "rating": 0
    },
    {
      "content": "Plus, this is often better than Prot artifacts! You can equip the Pixies and target them with your own artifacts.  They're still mediocre at best, but it's an interesting design space, and one which has become more so with the advent of equipment.",
      "posted_by": "Corey_bayoudragonfly",
      "posted_at": "5/6/2012 7:22:51 PM",
      "rating": 0
    }
  ],
  "1051": [
    {
      "content": "Strange how they didn't just give it \"protection from artifacts\" - after all, they had already created cards that had \"protection from Deserts\" so it wasn't that new a concept.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:33:21 AM",
      "rating": 10
    },
    {
      "content": "ummm... hmmm.  Well, you could block Bosh, Iron Golem I guess?\nObviously a shout-out from the days of Antiquities.  Useful back then becuase of cheap artifact creatures, clearly a bit out-classed now.\n1.5/5",
      "posted_by": "Gaussgoat",
      "posted_at": "1/11/2010 10:44:23 AM",
      "rating": 10
    },
    {
      "content": "It's an Ironroot Treefolk plus the anti-Artifact clause...Give me Erhnam Djinn anytime...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:00:08 AM",
      "rating": 9
    },
    {
      "content": "Even with the better and more straightforward protection from artifacts, this wouldn't be a star. As it is, there are just far too many better things green can be doing for five mana.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 10:27:16 AM",
      "rating": 8
    }
  ],
  "993": [
    {
      "content": "Looks to be about 11:55",
      "posted_by": "desolation_masticore",
      "posted_at": "5/18/2011 8:58:40 AM",
      "rating": 10
    },
    {
      "content": "Circle of Protection: Artifacts; pay 2 mana a turn:  prevent any damage the Armageddon Clock would do to you, just keep paying 2 mana a turn and watch your opponent cringe as the The clock counts up and his life ticks down.",
      "posted_by": "IceRapture",
      "posted_at": "4/10/2010 11:13:42 AM",
      "rating": 10
    },
    {
      "content": "If only this card had been errata'd to use charge counters instead of doom counters. Flavourwise, it's great, but it takes away from the cards interaction.",
      "posted_by": "Exilyth",
      "posted_at": "1/6/2011 7:06:13 PM",
      "rating": 10
    },
    {
      "content": "Animate Artifact & Spirit Link = Old School Win.Edit: @TasPap--yeah, back in the day we/some would spend 11 mana for a 6/6 lifelink \"deals damage and gains life every turn outside of attacking\" creature.  It was 1994, you had to be there man.",
      "posted_by": "themicronaut",
      "posted_at": "3/6/2014 1:17:37 AM",
      "rating": 10
    },
    {
      "content": "@TasPap: In the old days, Aladdin's Lamp got played. Just for Animate Artifact. Besides, giving an animated Clock lifelink wouldn't just be a 6/6 with lifelink; it would also drain your opponent and gain life for you each turn.",
      "posted_by": "ScissorsLizard",
      "posted_at": "8/19/2011 12:26:18 PM",
      "rating": 9
    },
    {
      "content": "Nifty effect, but it was always on the pricey side, and certainly not worth six mana in this day and age considering both the symmetrical effect and the symmetrical get-out clause.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 11:50:04 AM",
      "rating": 8
    },
    {
      "content": "I always thought that this effect was interesting, however this is far too pricey to be used...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:01:02 AM",
      "rating": 7
    },
    {
      "content": "Not bad but Copper Tablet is cheaper and easier to control.",
      "posted_by": "UNBAN_SHAHRAZAD",
      "posted_at": "9/16/2009 10:18:17 PM",
      "rating": 6
    },
    {
      "content": "@themicronaut so at the \"old school\"  they spend around 10 mana for a 6/6 lifelink creature?",
      "posted_by": "TasPap",
      "posted_at": "9/14/2010 6:14:29 AM",
      "rating": 5
    },
    {
      "content": "Combo with Doubling Season and Clockspinning.",
      "posted_by": "A3Kitsune",
      "posted_at": "1/27/2010 2:25:34 AM",
      "rating": 0
    },
    {
      "content": "I love the art and flavour, but powerwise the card sucks. It's like a jinxed choker costing twice as much while beeing several times slower.",
      "posted_by": "majinara",
      "posted_at": "9/16/2011 12:19:40 AM",
      "rating": 0
    },
    {
      "content": "I wonder if this ever caused a draw?",
      "posted_by": "TheWrathofShane",
      "posted_at": "12/21/2012 1:49:04 AM",
      "rating": 0
    },
    {
      "content": "DETHKLOK",
      "posted_by": "car2n",
      "posted_at": "3/17/2014 3:23:38 PM",
      "rating": 0
    },
    {
      "content": "According to the books:Mishra built these destructive engines to destroy territory-and therefore resources-that he didn't want Urza to be able to utilize against him. This card embodies that by punishing players who do not sink their resources into keeping the clock offline.As long as you have the upper hand, you can safely ignore paying the price and accept the damage knowing your opponent will be sinking all his resources into disabling it or outright destroying it.",
      "posted_by": "N03y3D33R",
      "posted_at": "4/10/2014 9:03:17 PM",
      "rating": 0
    }
  ],
  "1057": [
    {
      "content": "I miss the days of red being the second-best colour for countering! That said, Artifact Blast isn't a great example of a decent red counter anyway. I'd rather have Shatter, and there's a load of cards I'd rather have over Shatter in turn.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 11:53:54 AM",
      "rating": 10
    },
    {
      "content": "Great red sideboard. This could work as a little artifact defense for any red deck really considering that it only costs one red.",
      "posted_by": "niallcmurray86",
      "posted_at": "8/1/2010 1:46:03 PM",
      "rating": 10
    },
    {
      "content": "I love that this takes care of indestructible artifacts, though. It's the one advantage over shatter.",
      "posted_by": "themlsna",
      "posted_at": "11/15/2010 3:45:59 PM",
      "rating": 10
    },
    {
      "content": "Definately useable against artificers. It's cheaper that Shatter and anyways you need more than just four anti-artifact spells and furthermore: the minute you need Shatterstorm, you've prabably have lost already.",
      "posted_by": "tavaritz",
      "posted_at": "5/1/2011 4:28:59 AM",
      "rating": 10
    },
    {
      "content": "While not that powerful, it is a red counterspell and it does stop silly cards before they enter play.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:34:07 AM",
      "rating": 10
    },
    {
      "content": "Not bad as a sideboard.",
      "posted_by": "troji2",
      "posted_at": "11/23/2011 3:22:43 AM",
      "rating": 10
    },
    {
      "content": "The flavor text reflects your comments perfectly stygimoloch....I wouldn't play this as well...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:24:25 AM",
      "rating": 7
    },
    {
      "content": "This card has become more and more valuable as time goes on. Back when it was printed there weren't many artifacts that you couldn't shatter to deal with. Now with so many artifacts and artifact creatures with abilities like indestructible, hexproof and shroud floating about this card has become infinitely more valuable for sideboarding.",
      "posted_by": "N03y3D33R",
      "posted_at": "4/7/2014 6:32:34 PM",
      "rating": 0
    }
  ],
  "1036": [
    {
      "content": "Ah, yes. Thraxodemons. I know what those are.*googles.*A person on OKCupid and Myspace? Wut? Only other mention of \"Thraxodemon\" is right on this card here. Yet the flavor text is trying to make it out to be the black mage's common tool.",
      "posted_by": "Kryptnyt",
      "posted_at": "1/22/2012 11:14:11 PM",
      "rating": 10
    },
    {
      "content": "The reason it's so crappy is that it's one of the only black cards that can deal with artifacts in any way. Mono-colored decks were much more common back then.",
      "posted_by": "achilleselbow",
      "posted_at": "8/16/2010 1:34:27 AM",
      "rating": 10
    },
    {
      "content": "Wimpy, but black has such a hard time with artifacts, so that is not surprising.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:34:59 AM",
      "rating": 10
    },
    {
      "content": "Eep. Clunky wording. One of the forgotten victims of the rules being made to actually work. That said, while Artifact Possession does have its uses, it's not exactly a power card which anyone's likely to lose sleep over the fact they can't grok it.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 11:57:38 AM",
      "rating": 9
    },
    {
      "content": "One of the many narrow artifact-based cards in Antiquities, this one far too overcosted...The flavor text also suggests that this card should have been reworked as a creature...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:26:51 AM",
      "rating": 6
    },
    {
      "content": "Very limited use, but would be quite funny to slap on a Rocket Launcher or goblin Cannon, and heck, why not Rakalite.",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 6:28:46 AM",
      "rating": 0
    },
    {
      "content": "The card has a narrow effect AND it has a low power level.I really like the card art though :)",
      "posted_by": "Pollinosis",
      "posted_at": "5/7/2013 12:43:45 PM",
      "rating": 0
    },
    {
      "content": "This was how black dealt with artifacts back then, \"cursing\" them.  The concept actually made a comeback in the Mirrodin block.Curse ArtifactWarp ArtifactRelic PutrescenceRelic Bane",
      "posted_by": "NobuTheBard",
      "posted_at": "11/28/2013 5:09:19 AM",
      "rating": 0
    }
  ],
  "1066": [
    {
      "content": "Looks like our Benalish Hero has learned a new trick!",
      "posted_by": "Kryptnyt",
      "posted_at": "3/10/2011 8:19:55 AM",
      "rating": 10
    },
    {
      "content": "use full in the deck that i'm making.  i use a card that makes evrything an artifact (i don't remember what it's called)  exept that evrything i have already hase pro artifact. and so it dosent relly help at all.",
      "posted_by": "bijart_dauth",
      "posted_at": "3/29/2010 7:21:37 PM",
      "rating": 10
    },
    {
      "content": "Superllama12: Technically not, if there were an artifact enchantment. And with Mycosynth Lattice I guess there is.",
      "posted_by": "EternalLurker",
      "posted_at": "3/4/2011 9:26:31 AM",
      "rating": 10
    },
    {
      "content": "Uh... Of course the effect doesn't remove Artifact Ward! It's not an artifact! At least it's cheap Protection but I'd use more useful cards.",
      "posted_by": "Weretarrasque",
      "posted_at": "7/25/2009 9:45:44 AM",
      "rating": 7
    },
    {
      "content": "Sweet so I can turn the enchant creature into an artifact for some reason?",
      "posted_by": "DerekH",
      "posted_at": "8/10/2009 1:54:29 PM",
      "rating": 7
    },
    {
      "content": "So is this the same as protection from artifacts?",
      "posted_by": "Superllama12",
      "posted_at": "2/23/2011 3:27:42 PM",
      "rating": 6
    },
    {
      "content": "Only good Vs Memnarch. So what if you no longer control this Aura, your creature still gets the buff.",
      "posted_by": "mrredhatter",
      "posted_at": "10/4/2009 12:54:28 PM",
      "rating": 5
    },
    {
      "content": "Wards all don't ward of anything cuz they suck.",
      "posted_by": "Duskdale_Wurm",
      "posted_at": "6/8/2010 11:02:58 PM",
      "rating": 2
    },
    {
      "content": "Just as useless as the rest of the Wards...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:28:33 AM",
      "rating": 1
    },
    {
      "content": "Decent way to protect a creature from artifact sorces. Or add it to an Enchantress deck as just another 1-mana aura.",
      "posted_by": "A3Kitsune",
      "posted_at": "3/21/2010 2:25:49 AM",
      "rating": 0
    },
    {
      "content": "Rod of Ruin.HOSED!",
      "posted_by": "gman92",
      "posted_at": "6/13/2012 9:32:42 PM",
      "rating": 0
    },
    {
      "content": "I find this card missing one ability Enchanted by Artifact, then it would basically be Enchanted creature has Protection from artifacts. As it stands having 3 abilities against Artifacts isn't bad at all. Its too bad they never reprinted this in Mirrodin. It would be a 3.5/5 if it was in a block that was useful.",
      "posted_by": "vantha",
      "posted_at": "6/19/2012 2:44:03 PM",
      "rating": 0
    },
    {
      "content": "This would be good with something intimidate or fear (Assuming your opponent doesn't have black creatures or is the same colour as you.  Dross Golem comes to mind, to be they never reprinted this.",
      "posted_by": "Cidiuous",
      "posted_at": "12/31/2012 1:30:10 PM",
      "rating": 0
    },
    {
      "content": "Stick it on someone's unruly Stuffy Doll",
      "posted_by": "Liquidprism",
      "posted_at": "4/11/2013 8:25:36 PM",
      "rating": 0
    },
    {
      "content": "Is this protection from artifacts?",
      "posted_by": "FiveSecondPose",
      "posted_at": "11/30/2013 4:57:33 PM",
      "rating": 0
    }
  ],
  "994": [
    {
      "content": "sliver queen+heart stone+ashnods alter= massive pile of slivers. My friend used to spank me with that combo in the 90's",
      "posted_by": "Androx",
      "posted_at": "2/16/2011 9:56:07 AM",
      "rating": 10
    },
    {
      "content": "Don't you only need two karmic guides?Have an altar out, cast a guide with one in your gy, put the trigger on the stack targeting the one in the gy. Then sacrifice her to the altar (2 mana floating). The trigger resolves, returning a guide. Trigger on the stack, targeting the first one, then sacrifice it to the altar (more mana). Ability resolves. Rinse and repeat for infinite mana (and 2 guides, like anyone cares at that point).",
      "posted_by": "channelblaze",
      "posted_at": "8/9/2010 3:08:34 PM",
      "rating": 10
    },
    {
      "content": "Such a great card, there's way too many combos too list.",
      "posted_by": "Pontiac",
      "posted_at": "4/11/2011 12:09:21 PM",
      "rating": 10
    },
    {
      "content": "Can't forget the infinite creature loop with 2 Myr Retrievers for your lethal Grapeshot. Don't forget your Disciple of the Vault for a second win, or throw in an Etherium Sculptor to win with your Banefire. The combos with this card are brutal.",
      "posted_by": "Ritius",
      "posted_at": "11/14/2009 12:11:53 AM",
      "rating": 9
    },
    {
      "content": "Still a fine mana engine to this day, and far, far better than the utter dreck which is Blood Funnel.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 11:58:48 AM",
      "rating": 8
    },
    {
      "content": "Got army of saprolings?\nGot Blaze?\nGood.\nI can see this having the most use in a Jund deck with Sprouting Thrinaxes, Disintegrates, Dragon Appeasements, and Ivy Elemental, for good measure.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/21/2009 7:13:43 AM",
      "rating": 8
    },
    {
      "content": "This is a great artifact, not as good as Krark-Clan Ironworks is with Artifacts, but still an excellent card...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:31:54 AM",
      "rating": 7
    },
    {
      "content": "Infinite colorless mana with Ashnod's Altar, and three Karmic Guides, thow in a Farrelite Priest if you want white mana.",
      "posted_by": "mrredhatter",
      "posted_at": "10/2/2009 4:02:38 PM",
      "rating": 6
    },
    {
      "content": "So many silly things can be done with this card.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:36:00 AM",
      "rating": 0
    },
    {
      "content": "See timmyforever's comment on this card.",
      "posted_by": "twiddleman12",
      "posted_at": "10/13/2012 4:18:29 PM",
      "rating": 0
    }
  ],
  "995": [
    {
      "content": "Lol, check out Iron Man.",
      "posted_by": ".Fighter.",
      "posted_at": "2/21/2010 11:17:05 AM",
      "rating": 10
    },
    {
      "content": "It used to be surprisingly decent, but in the post-equipment age it's looking pretty obsolete.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 12:01:48 PM",
      "rating": 10
    },
    {
      "content": "One of the ancestors of Equipment, and a good piece of Equipment at that...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:33:05 AM",
      "rating": 10
    },
    {
      "content": "yeah it seems like this would have been overpowered back in antiquities",
      "posted_by": "metalevolence",
      "posted_at": "11/3/2009 11:23:09 PM",
      "rating": 10
    },
    {
      "content": "This blows some modern equipment out of the water because you can fire it off at instant speed.",
      "posted_by": "FragNutMK1",
      "posted_at": "9/9/2010 9:10:55 PM",
      "rating": 10
    },
    {
      "content": "@supershawn: By turning it sideways. It's a mono artifact. Mono artifacts tap when their ability is used.",
      "posted_by": "tavaritz",
      "posted_at": "4/30/2011 12:35:23 AM",
      "rating": 10
    },
    {
      "content": "uhhh how do you tap it?",
      "posted_by": "supershawn",
      "posted_at": "6/29/2010 2:42:56 AM",
      "rating": 1
    },
    {
      "content": "This artifact has mono. Don't kiss it.",
      "posted_by": "Salient",
      "posted_at": "3/26/2013 8:13:45 PM",
      "rating": 0
    },
    {
      "content": "cue Iron man theme.",
      "posted_by": "Pigfish99",
      "posted_at": "4/1/2013 10:57:31 PM",
      "rating": 0
    }
  ],
  "996": [
    {
      "content": "pretty solid in Shandalar.",
      "posted_by": "Kryptnyt",
      "posted_at": "5/22/2010 11:44:00 AM",
      "rating": 10
    },
    {
      "content": "This + Shatter used to Tech. Ah, good times...",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 12:13:01 PM",
      "rating": 8
    },
    {
      "content": "One of the most flavorful cards in Chronicles. It's not that bad either. It avoids Terror, adds to Affinity, helps Simic, and gives Memnarch a target.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/21/2009 7:16:56 AM",
      "rating": 7
    },
    {
      "content": "LOL, I also love the flavor text, Artifacts=Power???",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:34:58 AM",
      "rating": 5
    }
  ],
  "1058": [
    {
      "content": "He's just so iconic, I can't not give 'im 5 stars. He was Magic's first real posterboy.",
      "posted_by": "Kirbster",
      "posted_at": "7/1/2010 5:23:52 PM",
      "rating": 10
    },
    {
      "content": "oracle text pwns the original wording",
      "posted_by": "ubii",
      "posted_at": "7/22/2010 11:55:28 AM",
      "rating": 10
    },
    {
      "content": "Am I the only one reminded of one of the monsters from The Nightmare Before Christmas?",
      "posted_by": "niceguygreensboro",
      "posted_at": "2/20/2011 10:55:53 PM",
      "rating": 10
    },
    {
      "content": "Card of the Day - Monday, February 11, 2002  \n  For a period of time following the release of the Revised set in 1994, more copies of Atog existed than any other card beside basic lands.",
      "posted_by": "liir007",
      "posted_at": "8/10/2009 10:39:00 PM",
      "rating": 10
    },
    {
      "content": "This card ran rampant through Antiquities with amount of artifacts around...Who would of thought back in 1993-1994 that this card would spawn an entire tribe...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:36:25 AM",
      "rating": 9
    },
    {
      "content": "Back in the day there was a shit ton of low casting cost arifacts.  You left this guy go unchecked and it was game.  So to you Kajillion I would guess that you would say the same thing about chronotog.  By todays standards the card may not be that good but back in the day it was a pretty good card.  3.0.",
      "posted_by": "Dark_Monkey_316",
      "posted_at": "5/13/2010 8:06:33 PM",
      "rating": 9
    },
    {
      "content": "Classic card, the granddaddy of the atog tribe with his wicked grin.",
      "posted_by": "majinara",
      "posted_at": "2/6/2009 11:27:12 AM",
      "rating": 8
    },
    {
      "content": "Not only the first Atog, but also comfortably one of the best.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 12:18:59 PM",
      "rating": 8
    },
    {
      "content": "Iconic, funny art, progenitor of my first favorite combo (Enduring Renewal and Ornithopter).",
      "posted_by": "sharrah",
      "posted_at": "7/19/2009 7:38:31 AM",
      "rating": 8
    },
    {
      "content": "Wow, the benefits of keywording. \"Sacrifice\", in this case, shaved off 43 words. O_o",
      "posted_by": "OmegaSerris",
      "posted_at": "8/19/2011 10:25:31 PM",
      "rating": 0
    },
    {
      "content": "Fun card, fun art - what more do you want?",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:37:27 AM",
      "rating": 0
    },
    {
      "content": "You're telling me that I have to sacrifice my own artifacts?! And the +2/+2 isn't permanent?! Why would I want to use it? - so many bad players in '94",
      "posted_by": "kajillion",
      "posted_at": "9/27/2012 12:07:18 AM",
      "rating": 0
    },
    {
      "content": "It's funny.  I used to consider this card to be a total waste when I was a kid.  Had a crapload of them and never used them.  Artifacts in general just weren't that great.  Or maybe I just didn't make the connection in sacrificing a crapload of bad artifact 1 drops to make this guy a champion.He'd be pretty fun to use these days in silly decks.  That is, if I didn't give all my cards away and stop playing for a decade.  Ah well.",
      "posted_by": "Quentil",
      "posted_at": "10/18/2012 9:22:11 PM",
      "rating": 0
    },
    {
      "content": "There were songs written about Atog when people started to miss it. Anyone know of one?BTW, atog is an anagram of \"toag\" for the newbs.",
      "posted_by": "car2n",
      "posted_at": "3/29/2014 12:47:22 PM",
      "rating": 0
    }
  ],
  "997": [
    {
      "content": "@ Radagast - that's because back in the early days, not every creature was an undercosted monstrosity with \"flying, deathtouch, first strike, vigilance, and lifelink\".",
      "posted_by": "DrJack",
      "posted_at": "8/23/2012 11:46:34 AM",
      "rating": 10
    },
    {
      "content": "Anybody else think they catch a subtle suggestion in the flavour text?Antiquities was the set that chronicled the Brother's War, which culminated in the defeat of Mishra.Wizards has been saying \"DO NOT USE WALLS\" since 1994!!",
      "posted_by": "SeriouslyFacetious",
      "posted_at": "11/19/2013 10:22:27 PM",
      "rating": 10
    },
    {
      "content": "That's because Walls actually saw play once upon a time...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:38:07 AM",
      "rating": 10
    },
    {
      "content": "It's kind of sad in a way, that this actually used to get played fairly heavily.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 12:23:39 PM",
      "rating": 7
    },
    {
      "content": "A card built purely upon flavor. Not terribly useful, however.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:38:14 AM",
      "rating": 2
    },
    {
      "content": "Changelings cannot block him.  However, he only deals 1 damage so anything else can.  But this card is a great example of the game Magic used to be.",
      "posted_by": "Equinox523",
      "posted_at": "6/17/2011 9:21:37 AM",
      "rating": 0
    },
    {
      "content": "What rolls down stairsalone or in pairs,and over your neighbor's dog?What's great for a snack,And fits on your back?It's log, log, logIt's log, it's log,It's big, it's heavy, it's wood.It's log, it's log, it's better than bad, it's good!\"Everyone wants a log!You're gonna love it, log!Come on and get your log!Everyone needs a log!Log! Log! Log!",
      "posted_by": "car2n",
      "posted_at": "5/28/2014 1:29:00 AM",
      "rating": 0
    }
  ],
  "998": [
    {
      "content": "This cost too much to see play, especially since it's an ante card...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:38:57 AM",
      "rating": 10
    },
    {
      "content": "I wonder if people would let you use this as a \"4, T: exile this and target permanent\" in an EDH game? Would give mono-black a way of dealing with enchantments.",
      "posted_by": "cathode01",
      "posted_at": "8/19/2011 7:08:55 PM",
      "rating": 10
    },
    {
      "content": "@Cathode01I don't see why not; I've heard of people errataing Chaos Orb into an effect like that to use in cube drafts. Just have your friends agree with you beforehand before doing it.They'd probably still have the 10 life payment option too.",
      "posted_by": "Kryptnyt",
      "posted_at": "5/20/2012 6:25:40 PM",
      "rating": 10
    },
    {
      "content": "The ol' 6-4 split.Bronze TabletSerpent GeneratorJoven's ToolsMindslaverContagion Engine",
      "posted_by": "HuntingDrake",
      "posted_at": "5/27/2013 11:12:34 PM",
      "rating": 10
    },
    {
      "content": "No fun even to many of the strange people who actually enjoy playing for ante. That top right corner is ridiculous as well.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 12:26:01 PM",
      "rating": 5
    },
    {
      "content": "Bad art, bad text, bad flavour, no power, no fun.\n0.5",
      "posted_by": "Baconradar",
      "posted_at": "9/9/2010 7:16:58 AM",
      "rating": 0
    },
    {
      "content": "Just curious, if i had four of these in my deck, but never played for ante, would that mean i'd only ever have to play with 56 cards?",
      "posted_by": "BastianQoU",
      "posted_at": "6/27/2011 9:09:26 PM",
      "rating": 0
    },
    {
      "content": "It's not a good card in terms of almost anything, but it -does- let you make your deck 56 cards.",
      "posted_by": "r2d2go",
      "posted_at": "4/22/2014 8:23:52 PM",
      "rating": 0
    }
  ],
  "999": [
    {
      "content": "High tide and this card = lotsa mana",
      "posted_by": "Amsjex",
      "posted_at": "11/16/2010 4:56:46 PM",
      "rating": 10
    },
    {
      "content": "A clear example of how a simple concept can lead to broken silliness after many more cards have been printed.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:39:50 AM",
      "rating": 10
    },
    {
      "content": "cloudpost and this are good friends.",
      "posted_by": "thisisnotmyname",
      "posted_at": "2/23/2011 6:32:12 AM",
      "rating": 10
    },
    {
      "content": "Combo fuel of the highest order.",
      "posted_by": "Tanaka348",
      "posted_at": "8/5/2011 12:52:30 PM",
      "rating": 10
    },
    {
      "content": "This could make a good combo with Maraxus of Keld if you have some non-land mana producers.",
      "posted_by": "Test-Subject_217601",
      "posted_at": "8/23/2010 3:39:55 PM",
      "rating": 10
    },
    {
      "content": "this card kicks butt in any multicolored deck, not to mention it combos extremely well with other cards like library of alexandria, lake of the dead, stasis, etc... it's not good enough to merit restriction, but it's still pretty mean.",
      "posted_by": "gasimakos1",
      "posted_at": "5/13/2011 3:59:14 PM",
      "rating": 10
    },
    {
      "content": "RE: \"It doesn't say \"tap\" on the card\" No, but it's a \"Mono Artifact\" which does indeed require tapping it to use it's ability. In the old days, Artifacts were Mono (tap to use) , Poly (doesn't tap, but has an activation), or Continuous (always on effect). In the Revised set, they changed the terminology and added the 'tap symbol'.",
      "posted_by": "PastProphet",
      "posted_at": "9/25/2009 7:31:45 AM",
      "rating": 10
    },
    {
      "content": "1-of in Enchantress for use with Utopia Sprawl/Wild Growth and Serra's Sanctum?  Thoughts?",
      "posted_by": "KrosanGardener",
      "posted_at": "7/30/2009 6:15:08 PM",
      "rating": 8
    },
    {
      "content": "lol, Urzatron. Also Tolarian Academy and Mishra's Workshop.",
      "posted_by": "stygimoloch",
      "posted_at": "12/2/2008 5:41:18 AM",
      "rating": 8
    },
    {
      "content": "Ravnica lands + this = Pew Pew.",
      "posted_by": "Joseph_Leito",
      "posted_at": "4/4/2010 7:22:37 PM",
      "rating": 8
    },
    {
      "content": "Stasis decks love this card...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:40:26 AM",
      "rating": 7
    },
    {
      "content": "And by changing the terminology they opened a can of worms.The artifacts don't work if they are tapped worked only on poly and continous artifacts. So Mana Vault never stopped you getting hurt if it was tapped until they changed the mono, poly and continous distinction.Because of this blunder WoTC changed the rule so that artifacts work while tapped and errated a bunch of old cards like Howling Mine to get the effect they used to have.",
      "posted_by": "tavaritz",
      "posted_at": "6/10/2011 11:33:35 AM",
      "rating": 6
    },
    {
      "content": "wow, they attempted to change the card's abilit... check out what it says the card does next to the picture... It doesn't say \"tap\" on the card (for example how strip mine says tap, and that is from the same set)",
      "posted_by": "Megrimage",
      "posted_at": "9/24/2009 9:33:27 PM",
      "rating": 1
    },
    {
      "content": "Separate lands?  Aww, but I wanted to double-untap one of my lands...",
      "posted_by": "kazenpaus",
      "posted_at": "11/25/2012 2:26:45 PM",
      "rating": 0
    },
    {
      "content": "Remember kids, when this card was printed, the only cards you could combo with this for extra mana were:Gauntlet of MightMana FlareWild GrowthMishra's WorkshopUrza's Mine, Urza's Power Plant, and Urza's Tower (if all three were out).That's not actually a lot of utility.  Aside from that, all you could do with it is little tricks like small amounts of color-fixing (like turning a Mountain and a Swamp into two Swamps for the turn) or getting multiple uses out of a nonbasic with a non-mana activation (like Bazaar of Baghdad), of which there were about 10.In that context, is this a great card?  In the right deck, I guess.  In most decks, it was just okay.",
      "posted_by": "Zetan",
      "posted_at": "5/17/2013 9:09:31 PM",
      "rating": 0
    }
  ],
  "1067": [
    {
      "content": "to activate? I'd rather throw a Pariah on an Angelic Curator.",
      "posted_by": "mrredhatter",
      "posted_at": "10/4/2009 6:49:45 PM",
      "rating": 10
    },
    {
      "content": "The worst COP ever printed...2 to activate really does kill it...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:41:14 AM",
      "rating": 8
    },
    {
      "content": "It is rendered completely moot by Rune of Protection: Artifacts. One of the few cases in which a card is strictly better.",
      "posted_by": "blindthrall",
      "posted_at": "6/13/2011 3:12:31 PM",
      "rating": 7
    },
    {
      "content": "Hmm. Already less effective than the other Circles by virtue of artifacts being less common than any other colour - even around the time of Antiquities, there were few which really did substantial amounts of damage - they went and made it still worse by sticking an extra mana on the activation cost. Baffling.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 12:33:14 PM",
      "rating": 5
    },
    {
      "content": "Are we forgetting Armageddon Clock? This definitely had it's advantages back then, and it still does against decks that are based around things like master of etherium Arcbound Crusher and the like. Not a bad card, but very situational. Worth a side deck if you often play against people who use arti-pump decks.",
      "posted_by": "OpenSeasonNoobs",
      "posted_at": "3/5/2010 12:26:27 AM",
      "rating": 5
    },
    {
      "content": "At least the art would make for a bitchin' T-shirt.",
      "posted_by": "car2n",
      "posted_at": "3/6/2014 4:38:12 AM",
      "rating": 0
    }
  ],
  "1052": [
    {
      "content": "possible something nice to side in against affinity",
      "posted_by": "Havens",
      "posted_at": "6/25/2010 9:44:39 AM",
      "rating": 10
    },
    {
      "content": "Should have been reprinted numerous times. Not overpowered or overcosted. 3.5/5",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 6:56:36 AM",
      "rating": 10
    },
    {
      "content": "Imagine this in Mirrodin...The Lunatic Druid (anagram) didn't see too much play when it was printed however...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:42:16 AM",
      "rating": 9
    },
    {
      "content": "Card of the Day - Tuesday, March 26, 2002  \n Citanul Druids were \"driven mad by the fall of Argoth,\" and it's evident in their name: \"Citanul\" is \"Lunatic\" spelled backwards.",
      "posted_by": "liir007",
      "posted_at": "8/21/2009 3:45:54 PM",
      "rating": 8
    },
    {
      "content": "I wouldn't be hurt to see this come back in Magic 2012, as it should thrive in this Mirrodin/Phyrexia cycle. The Antiquities set was sort of like the Mirrodin of its day, FWIW.",
      "posted_by": "jfre81",
      "posted_at": "6/9/2011 7:37:16 PM",
      "rating": 0
    },
    {
      "content": "It's actually somewhat playable. And it's a creature from Antiquities. And it's green. Huh.",
      "posted_by": "boneclub",
      "posted_at": "9/10/2011 2:21:11 PM",
      "rating": 0
    },
    {
      "content": "Reasonably costed for its ability - surprised this fella hasn't been reprinted in an artifact heavy environment.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:40:46 AM",
      "rating": 0
    },
    {
      "content": "Nowadays this could get REAL brutal, fast!",
      "posted_by": "Mike-C",
      "posted_at": "12/31/2011 3:21:47 AM",
      "rating": 0
    },
    {
      "content": "I think this would be balanced as a 2/2",
      "posted_by": "TheWrathofShane",
      "posted_at": "3/13/2013 5:26:06 AM",
      "rating": 0
    },
    {
      "content": "My mind was blown by the 'lunatiC' thing, lol3/5 Stars",
      "posted_by": "Hunter06",
      "posted_at": "9/17/2013 2:17:04 PM",
      "rating": 0
    }
  ],
  "1000": [
    {
      "content": "I won a draft with this guy.",
      "posted_by": "inmypants22",
      "posted_at": "8/24/2009 8:44:51 PM",
      "rating": 5
    },
    {
      "content": "An annoying creature when it saw play, its costs render it relatively unplayable...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:43:16 AM",
      "rating": 3
    },
    {
      "content": "Maybe it was good back in the day. Isn't now.  Unplayable. 1/5",
      "posted_by": "docstorm",
      "posted_at": "12/8/2012 3:51:07 PM",
      "rating": 0
    },
    {
      "content": "It was a useful card in 4th and 5th edition draft, since a lot of people would have trouble dealing with it and it had enough power to be a threat.  Not really useful anywhere else, though.",
      "posted_by": "Aquillion",
      "posted_at": "6/17/2013 9:17:25 AM",
      "rating": 0
    },
    {
      "content": "Seems legit back in the olden days.",
      "posted_by": "Szalen",
      "posted_at": "11/29/2013 6:42:11 AM",
      "rating": 0
    }
  ],
  "1001": [
    {
      "content": "That tapping is a killer. If not for that it'd probably still be fairly good.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 1:08:19 PM",
      "rating": 10
    },
    {
      "content": "Exactly, 5 CMC for a 4/4 flyer has always been a good cost...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:44:30 AM",
      "rating": 10
    },
    {
      "content": "Weak by today's standards, but back than a 4/4 flyer for any color was pretty good, even if it did wind down.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:41:25 AM",
      "rating": 10
    },
    {
      "content": "LOL @ Discard a Counter.",
      "posted_by": "Rishadan_Man",
      "posted_at": "5/5/2013 7:57:58 AM",
      "rating": 10
    },
    {
      "content": "looks like cyberdragon",
      "posted_by": "ttian",
      "posted_at": "3/24/2009 8:39:39 AM",
      "rating": 4
    },
    {
      "content": "it just seems stupidly weak, but then I guess the drawback theoretically shouldn't effect much.......shouldn't...",
      "posted_by": "Burningsickle",
      "posted_at": "4/10/2014 3:32:41 PM",
      "rating": 0
    }
  ],
  "1002": [
    {
      "content": "These days I'd usually go for Phyrexian Colossus over this as a big stompy artifact creature, but I used to like Colossus of Sardia a lot. It's just as excellent as the Phyrexian with Voltaic Key of course.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 1:21:45 PM",
      "rating": 10
    },
    {
      "content": "Phyrexian Colossus doesn't have trample!",
      "posted_by": "Nocturno",
      "posted_at": "1/8/2010 1:52:24 PM",
      "rating": 10
    },
    {
      "content": "I personally think that Phyrexian Colossus is equal to Colossus of Sardia. The one can only be blocked by three creatures and that is a great evasion tactic. But sometimes Sardia's trample really makes the difference. And with all the ways to untap creatures and artifacts it easy to get past their drawbacks, plus now we have Master Transmuter too. Great Card 4/5.",
      "posted_by": "niallcmurray86",
      "posted_at": "8/1/2010 2:07:58 PM",
      "rating": 10
    },
    {
      "content": "Without an easy method to untap this monster, he's pretty useless...He's still pretty vulnerable as an artifact as well...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:49:26 AM",
      "rating": 10
    },
    {
      "content": "A situational 9/9 trample for 9 is nowhere near a great card, power wise.\nBut it's certainly flavoursome and fun.",
      "posted_by": "Baconradar",
      "posted_at": "9/16/2010 3:52:36 PM",
      "rating": 10
    },
    {
      "content": "Decent back in the day: any deck could use it (in theory) and untap tricks could get around its drawback (unlike the drawbacks of the other huge beasts of the time.)\nPoor by today's standards, though still playable in a deck devoted to silly artifact untapping tricks.",
      "posted_by": "Radagast",
      "posted_at": "12/19/2010 3:24:43 PM",
      "rating": 10
    },
    {
      "content": "@stygimoloch Dude have you even read Phyrexian Colossus?? It can only be blocked by three or more creatures. He's a game finisher man you're tripping!",
      "posted_by": "EvilCleavage",
      "posted_at": "5/2/2010 7:53:21 PM",
      "rating": 9
    },
    {
      "content": "My coworker Mark has this in his all artifact deck which has tons of awesome cards in it (Black Lotus, tons of duel lands, etc.)",
      "posted_by": "WotC_EricB",
      "posted_at": "2/5/2009 3:24:28 PM",
      "rating": 7
    },
    {
      "content": "Move over, Colossus of Sardia, the Akroans did you one better:Colossus of Akros",
      "posted_by": "Lord_of_Tresserhorn",
      "posted_at": "9/14/2013 1:29:21 PM",
      "rating": 0
    },
    {
      "content": "[autocard]Colossus of Sardia[/autocard] is the best Colossus that's not from a plane made of metal....and flesh...and oil. \nColossus of Sardia \n1) has Trample. really important as you can see in the Elder Dragon Legends cycle from the next set, if your fatty doesn't come with trample, it's really hard justifying spending a card to give it to them (unless it's some kind of magnificent aura that gives them 3 or 4 keywords and trample is one of them.)\n2) By the time you play Phyrexian Colossus or this, back in the day the opponent could easily have 3 weenie blockers for the Phyrexian, and in the now day even if you're [autocard]Tinker[/autocard]-ing that's still possible with [autocard]Aether Vial[/autocard].\n3) Basically all the Colossi in MTG are designed to attack ONCE. Maybe Twice. They're supposed to have enough power that that just outright wins. Given that, they are often worth casting 'fairly' (on the 8th or 9th turn) and could still win you the game. Sardia's Untap clause only costs repaying the mana. It basically has \"Echo\". Phyrexia causes you to pay almost half your life (or more than half, probably) just to untap a creature. Damage comes on instants and tap abilities, even old cards and definitely later sets. \nVerdict: Phyrexian Colossus has all the advantages of a Colossus and if you fast-mana him out, he's way way better than [autocard]Juggernaut[/autocard] in Mercadian Masques-Invasion-Odyssey Kitchen Table- but- he is a lot more risky to use than Sardia in \"Whatever's in your Boxes.KitchenTable\" because that life payment is no longer the only way to have a Colossus. \nIf Phyrexian Colossus is like the third biggest creature you own, go ahead and run him. \nColossus of Sardia costs more for more power and safety. In Colossus terms, that means it's better. \nBlightsteel Colossus costs even more, has WAY more power, and is safe from destruction.",
      "posted_by": "DarthParallax",
      "posted_at": "10/30/2013 5:11:43 AM",
      "rating": 0
    }
  ],
  "1003": [
    {
      "content": "This card would still be useful if the discard wasn't random...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 10:56:01 AM",
      "rating": 7
    },
    {
      "content": "I kind of like this. It's not really an equipment as it can affect any creature you control and its a colorless pump source and its a madness enabler.",
      "posted_by": "UNBAN_SHAHRAZAD",
      "posted_at": "4/7/2010 3:10:56 PM",
      "rating": 7
    },
    {
      "content": "One of the many victims of equipment. We've no shortage of colourless ways to pump creatures these days, so this is really only left to the niche of creature-based decks which can generate arbitrary amounts of mana and/or can take advantage of the random discard.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 1:27:28 PM",
      "rating": 7
    },
    {
      "content": "Random card is random... strange activation cost, strange name for what it does... yeah.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:42:36 AM",
      "rating": 0
    },
    {
      "content": "+2/+2 is pretty good. Losing the Griselbrand I've been ramping too is not. .5/5",
      "posted_by": "docjarvisd09",
      "posted_at": "1/28/2014 8:53:13 PM",
      "rating": 0
    }
  ],
  "1053": [
    {
      "content": "Another example of the bizarre nature of Wizards' relative power level policy early on. Even if it removed the artifact from the game, it'd still not be as good as Swords to Plowshares. I guess that's what comes of each set being designed more or less independently. That said, Crumble is still a pretty good card.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 1:32:05 PM",
      "rating": 10
    },
    {
      "content": "Funny how StP is universally regarded as one of the best cards ever printed, while players have remained relatively indifferent to the Artifact spell that is equivalent, I guess Shatter has spoiled us...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:25:25 PM",
      "rating": 10
    },
    {
      "content": "Not bad. It's one of the few ways Green could destroy artifacts back in the day.",
      "posted_by": "UNBAN_SHAHRAZAD",
      "posted_at": "8/22/2009 8:44:10 PM",
      "rating": 10
    },
    {
      "content": "Nowadays if you would only use crumble to destroy opponent's artifacts Oxidize from mirrodin is a much better choice.",
      "posted_by": "person1234",
      "posted_at": "9/5/2009 4:57:22 PM",
      "rating": 10
    },
    {
      "content": "Nature's Claim is the latest card to obsolete this one.",
      "posted_by": "GainsBanding",
      "posted_at": "10/26/2010 3:58:50 PM",
      "rating": 0
    },
    {
      "content": "Obsolete by today's standards, but back than this was green's only way to get rid of artifacts aside from Desert Twister. Still not terrible since it does bury the target.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:43:52 AM",
      "rating": 0
    }
  ],
  "1004": [
    {
      "content": "This card needed to cost 2 or 3 to be really relevant...Control decks, the only decks that you would want to play this against, will easily, even now, to be able to counter it...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:26:53 PM",
      "rating": 9
    },
    {
      "content": "Meh. I have seen this card work, but not tremendously well. It's too narrow for the cost to really justify a sideboard slot despite absolutely crippling some decks. By the time you can play it, barring accel, a lot more decks won't have hand sizes bigger than four anyway.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 1:42:22 PM",
      "rating": 8
    },
    {
      "content": "think having a rack is pretty good",
      "posted_by": "ttian",
      "posted_at": "3/27/2009 9:48:07 AM",
      "rating": 7
    },
    {
      "content": "Useful in a Deck focusing on draw damage/discard damage (Megrim, Underworld Dreams) so you can put in Howling Mine and Font of Mythos and have a way to diminish some of the card advantage.",
      "posted_by": "Arcane-Denial",
      "posted_at": "6/22/2010 1:55:00 AM",
      "rating": 0
    },
    {
      "content": "Humorous, but it rarely wins games.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:44:24 AM",
      "rating": 0
    },
    {
      "content": "Easily countered, but it does have its uses.",
      "posted_by": "TheWrathofShane",
      "posted_at": "11/4/2013 12:57:42 PM",
      "rating": 0
    }
  ],
  "1068": [
    {
      "content": "It's funny how they tried to port iconic Alpha cards into Artifact-based cards, with the majority failing to see much play, like this one, which costs 1 more mana than Smoke and Winter Orb...Also that is a weird piece of art...it looks like it's affecting the man more than the artifact...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:30:18 PM",
      "rating": 10
    },
    {
      "content": "\"Their own\" is strange to see on the printed text. It reads like it's okay to untap as many as you like during your opponent's upkeep, which in turn suggests that you're not allowed to use some sort of Shenanigans during your own upkeep to untap more than one artifact. I know that's not what it means, it just reads bizarrely.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 1:45:15 PM",
      "rating": 10
    },
    {
      "content": "killer combo, dampening field + triangle of war+Telim'Tor's Darts= insta win",
      "posted_by": "Androx",
      "posted_at": "2/16/2011 9:52:26 AM",
      "rating": 10
    },
    {
      "content": "NAKED MAN SCARED OF STUBBY DAGGERS!",
      "posted_by": "Kryptnyt",
      "posted_at": "10/12/2011 7:46:28 PM",
      "rating": 10
    },
    {
      "content": "old Imi Statue",
      "posted_by": "HuntingDrake",
      "posted_at": "11/3/2011 6:33:30 PM",
      "rating": 10
    },
    {
      "content": "Annoying back when everyone had piles of Moxes instead of lands. Today, this wouldn't see much play.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:45:33 AM",
      "rating": 10
    },
    {
      "content": "is it damp in here?",
      "posted_by": "ttian",
      "posted_at": "3/24/2009 9:36:19 AM",
      "rating": 1
    },
    {
      "content": "I can't think of a decent combo.",
      "posted_by": "mrredhatter",
      "posted_at": "10/5/2009 1:13:06 PM",
      "rating": 0
    }
  ],
  "1059": [
    {
      "content": "at the Guest, your forgeting that it deals damage to the player, shatter can't say that.",
      "posted_by": "bijart_dauth",
      "posted_at": "6/21/2010 7:54:58 PM",
      "rating": 10
    },
    {
      "content": "What's not to like here? Yes, it's a sorcery and can be expensive to cast, but it feels great to blow something up in your opponent's face with this. A fantastic cross of flavor and functionality. 4/5",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 6:47:00 AM",
      "rating": 10
    },
    {
      "content": "This is an decent artifact destruction spell, but Shatter already existed, so why would anyone want to play this...The only advantage of this spell is that regen isn't possible...and Disintegrate is better in most cases for that functionality...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:32:12 PM",
      "rating": 1
    },
    {
      "content": "Yeah, it is more costly and a sorcery vs. Shatter, but it buries the target AND blows it up. A good card, in flavor for red, and quite frankly I'm surprised this one hasn't seen a reprint lately.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:46:47 AM",
      "rating": 0
    },
    {
      "content": "Reprint, please? Would be pretty cool.",
      "posted_by": "Doaj",
      "posted_at": "7/6/2012 3:13:38 AM",
      "rating": 0
    }
  ],
  "1037": [
    {
      "content": "its also funny to cast this on an opponent with 8 artifacts in the graveyard right after you Armageddon.",
      "posted_by": "Twylyght",
      "posted_at": "5/3/2012 8:18:28 PM",
      "rating": 10
    },
    {
      "content": "A solid artifact recovery spell for just a single U.",
      "posted_by": "vh_2k",
      "posted_at": "1/18/2011 3:29:43 PM",
      "rating": 10
    },
    {
      "content": "Can be used both offensively and defensively and it's stupidly cheap to cast - great stuff!",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:47:30 AM",
      "rating": 10
    },
    {
      "content": "This is a pretty good card, especially when it's creature counterparts (Bone Harvest) cost at least 3 CMC. However there are better way to recur artifacts...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:34:05 PM",
      "rating": 9
    },
    {
      "content": "this is great AGAINST affinity. Just put a couple of ornithopters and a land or two on top of their library, and make their next couple turns useless!",
      "posted_by": "channelblaze",
      "posted_at": "8/25/2010 8:48:10 PM",
      "rating": 8
    },
    {
      "content": "I casted Shatterstorm on a guy and followed up with this, I put 3 moxes, Sol Ring, Mana Vault and Mana Crypt on top his library.\n3 turns later I top decked Time Walk for extra added insault.",
      "posted_by": "Pontiac",
      "posted_at": "4/12/2011 11:50:35 AM",
      "rating": 7
    },
    {
      "content": "Whats ment as artifact recoursion is instead used to hose draws.\n4/5",
      "posted_by": "Hunter06",
      "posted_at": "11/23/2012 8:26:10 AM",
      "rating": 0
    }
  ],
  "1005": [
    {
      "content": "This isn't that bad of a creature, if only the firebreathing ability was 1 mana, this would have seen more play...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:35:04 PM",
      "rating": 10
    },
    {
      "content": "The card isn't absolutely terrible, but I wish it was as powerful and menacing as the ones in The Brothers' War novel. :(",
      "posted_by": "Bluecash",
      "posted_at": "8/20/2010 5:10:22 PM",
      "rating": 10
    },
    {
      "content": "The artwork is awesome and its an O-K card, but I think the rare status is undeserved. It is common in Antiquities. Why's it rare in other sets????",
      "posted_by": "MichaelSG",
      "posted_at": "10/24/2010 12:08:44 AM",
      "rating": 10
    },
    {
      "content": "I actually played this back in the days. :P I assumed \"a normal 3 mana creatures is 2/2. This is 1/3 and pumpable and can be played with any mana. Man this is great!\". Where has powercreep brought us? :(A pity this is just a construct in matters of creature type, and not a dragon construct.",
      "posted_by": "majinara",
      "posted_at": "7/29/2009 7:57:32 AM",
      "rating": 8
    },
    {
      "content": "Back in the day, this was pretty menacing due to colorlessness.  Remember, Sol Ring and Mana Vault meant this could come out pretty soon, and the Urzatron (Urza's Tower, Urza's Power Plant, and Urza's Mine) meant he would often be pumped to a pretty nasty size.  Blue has always been buddy-buddy with artifacts, and Reconstruction meant that he could come back if killed.  Yes, he dies to Lightning Bolt, but you can protect him with counters and other things that give invulnerability or healing as he swings fatally.",
      "posted_by": "Equinox523",
      "posted_at": "6/22/2011 11:09:23 AM",
      "rating": 8
    },
    {
      "content": "this dragon belonged to Mishra when he was the raqi from the fallaji people of the desert... This creature killed several fallaji when it appeared from the sand and the qadir itself included.",
      "posted_by": "ederchan",
      "posted_at": "6/22/2009 10:47:27 AM",
      "rating": 7
    },
    {
      "content": "This fella was never that good. Had the firebreathing been cheaper, it would have seen some play. Too bad it doesn't count as a Dragon.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:48:28 AM",
      "rating": 0
    },
    {
      "content": "Outdone, in similar flavor, by Moltensteel Dragon.",
      "posted_by": "MattLynn",
      "posted_at": "5/17/2013 1:07:10 PM",
      "rating": 0
    }
  ],
  "1060": [
    {
      "content": "Curse that upkeep restriction! I'd consider this card for some decks without it. With, it's all so... meh. It can't even get a last use from dying artifacts, which as 2-mana 1/1 would not have been problematic.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 2:53:15 PM",
      "rating": 8
    },
    {
      "content": "One line of text ruins this card...and it doesn't make sense flavorfully at all!!!",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:36:47 PM",
      "rating": 8
    },
    {
      "content": "weak",
      "posted_by": "LivingFoul",
      "posted_at": "1/4/2010 8:31:04 AM",
      "rating": 4
    },
    {
      "content": "He's effectively a reuseable Forge Armor on legs. Only much worse.",
      "posted_by": "Test-Subject_217601",
      "posted_at": "8/28/2010 5:34:30 PM",
      "rating": 0
    },
    {
      "content": "Yeah, the last line ruins this card. It really isn't needed - you'd be nuts to fill a deck full of artifacts that were only there to be sacrificed one a turn to make a creature larger. Early Magic sets had tons of restrictions like this one, which ruined perfectly good cards.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:49:46 AM",
      "rating": 0
    }
  ],
  "1038": [
    {
      "content": "Take that, Tempered Steel decks.",
      "posted_by": "Enemy_Tricolor",
      "posted_at": "2/24/2011 9:26:56 PM",
      "rating": 10
    },
    {
      "content": "Has a lot of uses today. Ichor Wellspring, Perilous Myr, has the potential to get rid of darksteel stuff.",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 6:23:32 AM",
      "rating": 10
    },
    {
      "content": "A sweep against any deck that is using mostly artifacts as mana sources, and nasty against any deck with artifacts. Good card.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:50:28 AM",
      "rating": 10
    },
    {
      "content": "An older version of Kataki, War's Wage, if only this had been printed in Mirrodin...It wasn't played much when it was originally printed though...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:37:56 PM",
      "rating": 10
    },
    {
      "content": "i wonder which came first. this or the Legendary Pictures logo?",
      "posted_by": "bluemaxx",
      "posted_at": "5/18/2012 8:56:00 AM",
      "rating": 0
    }
  ],
  "1006": [
    {
      "content": "The first defense against milling.The card that stretched a million 20 minute games into 2 hours.The card that went from $300 uncommon to $.25 common overnight.Such an innocent card these days, this card did WAY too much for the game when it was printed.  5/5 then, 3.5/5 now.",
      "posted_by": "Psychrates",
      "posted_at": "3/23/2012 12:00:30 PM",
      "rating": 10
    },
    {
      "content": "A great card, allows you to reuse your graveyard...This was a long-time tourney staple...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:38:59 PM",
      "rating": 7
    },
    {
      "content": "The cheapest way to get a Loaming Shaman effect. Good for the paranoid Golgari user.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/21/2009 7:30:06 AM",
      "rating": 0
    },
    {
      "content": "Graveyards are too important a resource now, but back in the 90's, this was defensive tech against Tormod's Crypt in casual play.",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 7:02:54 AM",
      "rating": 0
    },
    {
      "content": "@BinniePrinceCharlieThis was more of a defense against Millstone, and Tormod's Crypt was the response to this.  Back then there wasn't much you could do with your graveyard, so in most cases having it removed from the game wasn't a big deal.",
      "posted_by": "helluin",
      "posted_at": "5/8/2011 7:47:10 PM",
      "rating": 0
    },
    {
      "content": "Vastly outclassed by Elixer of Immortality, but this fella was the cheapest graveyard recursion in the game for many years. It was also a sort of 'poor man's Timetwister\" for those who thought it was cool to bring back their graveyard.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:51:33 AM",
      "rating": 0
    }
  ],
  "1054": [
    {
      "content": "It's also a fairly buff looking tree. Why it needs armor, however, is beyond me.",
      "posted_by": "DoctorKenneth",
      "posted_at": "11/20/2009 9:24:25 AM",
      "rating": 10
    },
    {
      "content": "Play with Mycosynth Lattice. If you're playing multiplayer, you can start wiping opponents one by one~",
      "posted_by": "Daikoru",
      "posted_at": "10/5/2010 2:46:25 PM",
      "rating": 10
    },
    {
      "content": "A forgotten little multiplayer gem. In a standard chaos game it should have no trouble being a 4/4 or 5/5  for 3 mana, which is pretty damn swish when you compare it to most creatures printed around the same time.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 3:11:10 PM",
      "rating": 10
    },
    {
      "content": "I wouldn't dare play this in a duel...but yes in Multiplayer this would shine...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:41:01 PM",
      "rating": 10
    },
    {
      "content": "viable in EDH",
      "posted_by": "metalevolence",
      "posted_at": "6/22/2010 3:09:51 PM",
      "rating": 10
    },
    {
      "content": "This is great sideboard material. You'll realize this when you run into that guy with the swarms of Pests and other artifacts.",
      "posted_by": "Horsemanship",
      "posted_at": "7/8/2010 9:26:42 AM",
      "rating": 10
    },
    {
      "content": "Sideboard against artifact heavy decks.",
      "posted_by": "Test-Subject_217601",
      "posted_at": "9/30/2010 12:20:27 PM",
      "rating": 10
    },
    {
      "content": "It's great against artifact decks...until you realize it can be chump blocked infinitely due to lack of trample.",
      "posted_by": "Equinox523",
      "posted_at": "6/7/2011 12:28:30 PM",
      "rating": 10
    },
    {
      "content": "I would still refrain from playing this in EDH. Cards that get stupidly-big are plentiful, and most often come with additional bonuses. The low cost matters much less in that format, as it's not suited to all-out aggro plans.",
      "posted_by": "scumbling1",
      "posted_at": "3/28/2011 5:00:49 PM",
      "rating": 0
    },
    {
      "content": "Gaea's Avenger vs MOX deck",
      "posted_by": "Skulisk",
      "posted_at": "9/26/2011 3:37:11 PM",
      "rating": 0
    },
    {
      "content": "Could still see some play in Commander, though the lack of Trample or a similar ability is disappointing.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:52:25 AM",
      "rating": 0
    },
    {
      "content": "\"You blasted kids these days and your fancy-schmancy gizmos!\"",
      "posted_by": "Raibys",
      "posted_at": "3/11/2013 7:35:58 PM",
      "rating": 0
    },
    {
      "content": "Seeing as thing and urza's colossus of sardia killed each other in the brother's war, urza's army must have only consisted of 8 artifacts, no wonder he had a hard time beating mishra",
      "posted_by": "omni8000",
      "posted_at": "4/10/2013 10:42:43 AM",
      "rating": 0
    },
    {
      "content": "nice flavor, even from just the name!",
      "posted_by": "Burningsickle",
      "posted_at": "4/17/2014 6:19:53 AM",
      "rating": 0
    }
  ],
  "1039": [
    {
      "content": "ARG! Another one! Whoever designed Antiquities clearly had a bizarre fetish for playing abilities in the upkeep. I agree with Mode, it flows much better the way you worded it than as an activated ability.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 3:13:45 PM",
      "rating": 10
    },
    {
      "content": "Why the Upkeep got so much attention during Antiquities will forever be unknown, this like the Dwarven Weaponsmith probably would have seen more play had the upkeep restriction been removed...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:42:28 PM",
      "rating": 10
    },
    {
      "content": "Underrated card. With Bitterblossom one could potentially destroy an artifact a turn.Funny how black used to have access to artifact destruction back in the day. It actually makes perfect sense given Yawgmoth's hatred of artificers.",
      "posted_by": "makochman",
      "posted_at": "11/4/2009 1:48:21 PM",
      "rating": 10
    },
    {
      "content": "Phyrexian Tribute is the only other monoblack artifact destruction that I know of and still requires sacrificing creatures.Well, there's Rats of Rath, but only if you want to destroy your own stuff.",
      "posted_by": "Etregan",
      "posted_at": "11/20/2009 2:07:41 AM",
      "rating": 10
    },
    {
      "content": "Even if it wasn't the only playable artifact removal in its color, it would still be great. GATE TO PHYREXIA WE LOVE YOU",
      "posted_by": "metalevolence",
      "posted_at": "1/9/2011 12:51:14 AM",
      "rating": 10
    },
    {
      "content": "I've never understood really why Black cannot handle artifacts. Okay, I know in the first few sets how Black focused more on the manipulation of life-force, and artifacts lack lifeforce (much like enchantments), so they could not be affected.\nHowever, the moment it was clear that Black was the color of Phyrexia - a twisted world of evil artifacts - that restriction stopped making any real sense to me.\nI'm not saying Black should be able to destroy artifacts easily or get a lot of cards that can do it, but still, I think there only about 2 Black cards in the whole game that can destroy a specific non-creature artifact. That just seems odd to me.\nOh, well. This card is hard to use, but very unique, which makes it worthwhile.",
      "posted_by": "Radagast",
      "posted_at": "1/16/2011 3:00:18 PM",
      "rating": 10
    },
    {
      "content": "@Mode;They word it the way it is, I believe, to give the defender a chance to respond after you sacrifice, rather than before you choose to sacrifice.World Queller works much in the opposite way as this card. A good card to point out where this would matter is Sensei's Divining Top.Assume the Top is the only artifact in play. World Queller's controller puts his triggered ability on the stack. The top controller has no way of knowing he is going to pick artifact, and has to make a decision of whether or not to put the Top on his library and draw a card. If this card worked the way you describe, Gate's controller would target the top, and if the top's controller drew a card instead, wouldn't have to sacrifice a creature.Not that I think that would be such a bad thing, though. I agree with you. They made Sylvan Library a triggered rather than activated ability. Why not this?",
      "posted_by": "Kryptnyt",
      "posted_at": "3/21/2011 1:32:42 PM",
      "rating": 10
    },
    {
      "content": "i love the flavor of this card. especially the name \"gate to phyrexia.\" reminds me of some crazy HP lovecraft story where there's a dimension of pure chaos that one can travel to via fell magic. send a thrull on a suicide mission to steal an artifact and dive into the inter-dimensional gate with it in tow, ultimately destroying both. so awesome.",
      "posted_by": "gasimakos1",
      "posted_at": "5/4/2011 7:59:52 AM",
      "rating": 10
    },
    {
      "content": "Ah, nostalgia time. Here we have the first ever glimmer of Phyrexia, the big bads of the Magic universe.",
      "posted_by": "The_Stray",
      "posted_at": "8/3/2011 6:13:48 PM",
      "rating": 10
    },
    {
      "content": "the only black card i'm aware of that has any sort of artifact destruction. Too bad it requires a creature and the deck i need it for runs only 7 creatures.  Still a decent card, I just wish black had more artifact destruction.",
      "posted_by": "AgesofThunder",
      "posted_at": "11/4/2009 9:04:39 PM",
      "rating": 8
    },
    {
      "content": "Wow. Black artifact destruction. MONO-black artifact destruction. This is sick.",
      "posted_by": "Selez",
      "posted_at": "11/5/2009 8:33:43 PM",
      "rating": 7
    },
    {
      "content": "why did they change this card's effect actually in the oracle to an activated ability?sounds much more like a triggered ability to me:\"During your upkeep, you may sacrifice a creature. If you do, destroy target artifact.\"",
      "posted_by": "Mode",
      "posted_at": "1/2/2009 9:47:13 AM",
      "rating": 6
    },
    {
      "content": "To the Gate to Phyrexia rides the Knight Exemplar, her War Hawk perched on her wrist, her Attended Knight bearing a proud Capashen Standard, fluttering in the breeze as she surveys the Tainted Field before her. The Ring of Thune she wears glints in the Serene Sunset as she hefts her Loxodon Warhammer and shoulders her Angelic Armaments, gifts from Avacyn herself.\"Rally!\" she cries to her Elite Vanguard. \"Rally the Troops, and alert General Jarkeld that this Foul Presence will soon be Purged from the Living Lands!\"\"Death or Glory!\"",
      "posted_by": "Morgaledh",
      "posted_at": "9/13/2012 3:08:56 PM",
      "rating": 0
    }
  ],
  "1061": [
    {
      "content": "Thats wrong. The Rules Text is:This card's ability targets an artifact spell on the stack. You can't play the ability unless you have an artifact spell you control on the stack to target. It does not target permanents in play.",
      "posted_by": "Sveni1980",
      "posted_at": "5/22/2009 5:13:46 AM",
      "rating": 10
    },
    {
      "content": "The wording is fine, you guys just don't understand the fundamental rules of the game. For the most part, the guys saying you can't activate without a legal target are right.",
      "posted_by": "NeoKoda",
      "posted_at": "9/1/2011 8:41:45 PM",
      "rating": 10
    },
    {
      "content": "Practically speaking, they aren't worth much, but they are a 1/1 Goblin for R with an ability that sometimes matters. Back then, this was pretty good.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:54:22 AM",
      "rating": 10
    },
    {
      "content": "@NeoKoda While the wording may be right, it isn't every player who reads the entire rule set and understands all of it completely. The average casual player does nothing close, that is why there are rulings and oracle rewrites.",
      "posted_by": "Speednat",
      "posted_at": "4/21/2012 11:28:00 AM",
      "rating": 10
    },
    {
      "content": "Hum artifact deck withGaea's HeraldVexing Shusher:D I wonder how a green/blue/red artifact deck would do?",
      "posted_by": "ICEFANG13",
      "posted_at": "9/14/2011 8:34:38 AM",
      "rating": 10
    },
    {
      "content": "The templating on this card needs to be fixed, if only for clarity...I can see many players agreeing with stygimoloch's interpretation of the card...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:45:27 PM",
      "rating": 8
    },
    {
      "content": "Sveni's right. You can't cast a spell or activate an ability without choosing all targets for it first. Since the oracle text reads \"Counter target artifact spell\", you can never activate this ability without targeting an artifact spell, even if there's only a 50/50 chance it will be relevant. It's the same reason you can't cast a Counterspell if there aren't any spells on the stack. (fun story there- I once beat a guy with my rebel deck because I never played any spells, I just used Lin-Sivvi a lot. This meant my opponent couldn't empty his hand of counterspells, which meant I could attack in under his Ensnaring Bridge and kill him.)That said, the text is deceptive. It wouldn't hurt to add some reminder text clarifying.",
      "posted_by": "ScissorsLizard",
      "posted_at": "5/2/2010 11:16:45 AM",
      "rating": 8
    },
    {
      "content": "Yeah, the wording simply needs one line on the end \"Use this ability only when casting an artifact spell.\"Problem solved, and Goblin Artisans go back to being a useless and weak creature.",
      "posted_by": "Dr_Draco",
      "posted_at": "8/22/2009 12:57:29 PM",
      "rating": 8
    },
    {
      "content": "The comments on this card go to show that in some cases, Oracle updates can actually serve to make a card's intended function [b]less clear[/b].  Sveni and ScissorsLizard are 100% correct, but the confusion is understandable since the wording as written seems like the target is only relevant if you are losing the flip.  \nRules questions aside, I like these little guys!  They are filled with delicious flavour: put your artifact into the hands of some goblins and you've got a 50/50 chance of having them improve it or ruin it entirely (though by looking at the art, you'd really expect them to ruin it).  \nThey are also one of the earliest examples of power creep that I've noticed, considering that [autocard multiverseid=\"507\"]Mons's Goblin Raiders[/autocard] was printed in Beta only 5 months earlier.  Granted, neither of these goblins would be considered strong nowadays, but Goblin Artisans at time of printing did everything that Mons's Goblin Raiders did - and more!  \nAside from their new, more ambiguously-worded ability, Oracle updates have also made these little guys into an Artificer.  Right now that's not a terribly relevant creature type, but for anyone who's curious, it turns out that Goblins are the tribe with the second-greatest number of artificers - [b][i]twice[/i][/b] as many as Vedalken have, as of [u]Scars of Mirrodin[/u]!  It makes goblins feel surprisingly brainy, until you actually look at how many of these goblin artificers are breaking the artifacts they interact with (hint: it's all of them).",
      "posted_by": "Leshrac_Nightwalker",
      "posted_at": "11/19/2010 6:40:29 AM",
      "rating": 8
    },
    {
      "content": "The Oracle wording here is dodgy. Since the artifact-countering is listed as part of the effect rather than the cost, this becomes a one-drop, in a card-advantage-weak colour, which has a 50/50 chance of drawing you an extra card each turn, with effectively no drawback. That's pretty much changed one of the most mocked and useless creatures ever printed to a certifiable star.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 3:17:53 PM",
      "rating": 6
    },
    {
      "content": "Yes, if you take the Oracle text word for word, you can activate the ability any time, because there's no line at the end saying, \"You can only use this ability when your opponent casts an artifact spell.\"So, if you go by the Oracle text, this card is a diamond in the rough, and a card that would definitely be used today.If you go by the original, it's very lacking because it requires that your opponent plays an artifact for it to do anything.",
      "posted_by": "Weretarrasque",
      "posted_at": "9/25/2009 8:14:02 AM",
      "rating": 4
    },
    {
      "content": "This card needs a ruling or better wording to make clear how it currently works. The current wording has no requirement for a spell (artifact or otherwise) to be on the stack, and only targets after the coin flip has been resolved (and only if you lose the flip).",
      "posted_by": "A3Kitsune",
      "posted_at": "2/15/2010 3:07:40 AM",
      "rating": 4
    },
    {
      "content": "...so whos side were they fighting on in the brothers war?",
      "posted_by": "omni8000",
      "posted_at": "5/2/2012 2:12:08 PM",
      "rating": 0
    },
    {
      "content": "It is a well known fact that at the bottom of the goblin food pyramid is paste.",
      "posted_by": "SarcasmElemental",
      "posted_at": "9/30/2013 11:57:05 AM",
      "rating": 0
    }
  ],
  "1007": [
    {
      "content": "This card belongs in a MUSEUM!!",
      "posted_by": "SarcasmElemental",
      "posted_at": "7/19/2012 8:41:06 AM",
      "rating": 10
    },
    {
      "content": "Useless if judged by its printed abilities... horrifyingly powerful if one knows its backstory.",
      "posted_by": "Radagast",
      "posted_at": "10/23/2012 1:55:08 PM",
      "rating": 10
    },
    {
      "content": "Notice this is legal in Commander.You will only destroy something with this once in your life. But if you use this to surprise-explode someone's fancy black-border Urzatron... well, let's just say they will never forgive you. And they will never forget....For true badassery, recur this with Reconstruction and Drafna's Restoration.",
      "posted_by": "Salient",
      "posted_at": "4/4/2013 6:45:12 PM",
      "rating": 10
    },
    {
      "content": "The comp rules update for M14 changes how this works.  Now it will destroy every card whose [i]first[/i] printing was in Antiquities:\n109.3\nExpansion symbols are no longer a characteristic. Magic cards are recognized as individual game pieces by their English card names. One of the central tenets of that system is that all cards with the same name are considered the same for deck building and play purposes. This system lets us reprint cards, print promo cards, and have cards appear in many languages. But three older cards referred to cards from a specific expansion, and that runs contrary to the system. The Arabian Nights Bird Maiden and the Fourth Edition version should be the same, but City in a Bottle says they're not. In fact, it makes the original version worse!\nSo, cards will no longer refer to expansion symbol as a characteristic. The three cards that used to do this (City in a Bottle, Golgothian Sylex, and Apocalypse Chime) will receive errata in a future update to refer to cards \"originally printed\" in the Arabian Nights, Antiquities, and Homelands sets, respectively). This means that City in a Bottle no longer affects any cards named Mountain. It also means that those three cards can affect cards that were in the appropriate set and then reprinted. City in a Bottle will affect the aforementioned Fourth Edition Bird Maiden.\nReferences to expansion symbol being a characteristic were removed in several other rules as well.",
      "posted_by": "Zetan",
      "posted_at": "7/15/2013 7:29:53 AM",
      "rating": 10
    },
    {
      "content": "The original reason for Golgothian Sylex and City in a Bottle was because they wanted players to be able to control the use of cards outside of the core set.Obviously, as the game grew, such cards became completely useless, and really it's good they stopped doing it after Antiquities. Could you imagine if there were cards like this for every expansion?? It'd be insane.Oh... forgot about Apocalypse Chime in Homelands... I think I purposely forgot, lol...",
      "posted_by": "Dr_Draco",
      "posted_at": "9/25/2009 9:50:51 AM",
      "rating": 9
    },
    {
      "content": "This baby loves my opponents Workshops :)",
      "posted_by": "Pontiac",
      "posted_at": "3/18/2011 4:07:29 PM",
      "rating": 9
    },
    {
      "content": "@ Guest57443454: I agree, the card does nothing to explain why it does what it does, but was its significance already decided at the time of print or if it was a later storyline revision?For those who are quite justifiably missing the connection between a ceremonial bowl and mass destruction, the flavour behind this is that it's an ancient artifact of unknown origin which Urza uses to end the Brothers' War, by creating the explosion which kills Mishra, destroys the forest of Argoth and ignites Urza's planewswalker spark. How it works is never really spelt out, although it involves him channelling energy through the bowl of the sylex.",
      "posted_by": "stygimoloch",
      "posted_at": "11/21/2009 7:28:04 AM",
      "rating": 8
    },
    {
      "content": "It doesn't kill reprints.  Only cards that actually have an Antiquities expansion symbol.  What about Chronicles cards?  Nobody seems to know.  If it were costed more efficiently, you could hose Workshop decks with this in Vintage.  Ehhhh.. actually, probably not.",
      "posted_by": "GainsBanding",
      "posted_at": "10/19/2010 12:30:17 AM",
      "rating": 6
    },
    {
      "content": "wish there was one of these for Urza Block",
      "posted_by": "Kryptnyt",
      "posted_at": "3/13/2010 5:09:25 PM",
      "rating": 6
    },
    {
      "content": "Very weak for a card that represents an artifact in the novel (The Brother's War).It should destroy everything on the board (except library).Nevinyrral's Disk is better although it only destroyed the City of Urborg.For an artifact that caused the Ice Age in Dominaria, it's very weakly represented in card.",
      "posted_by": "getz19",
      "posted_at": "6/14/2011 7:30:28 AM",
      "rating": 5
    },
    {
      "content": "@GainsBanding: It actually checks for the expansion symbol that's printed on the card. Chronicles cards with the Antiquities expansion symbol would be sacrificed.206.3. A spell or ability that affects cards from a particular set checks only for that sets expansion symbol. A card reprinted in the core set or another expansion receives that sets expansion symbol. Any reprinted version of the card no longer counts as part of its original set unless it was reprinted with that sets expansion symbol.",
      "posted_by": "Bowshewicz",
      "posted_at": "4/9/2012 10:00:22 AM",
      "rating": 5
    },
    {
      "content": "amazing for EDH",
      "posted_by": "inmypants22",
      "posted_at": "8/18/2009 2:49:34 PM",
      "rating": 4
    },
    {
      "content": "Magic wouldn't exist if these existed in every expansion. Unless they actually did what they should have done years ago and banned these for good. This card functions too similarly to Chaos-Orb - in a way Magic simply shouldn't work.So does this hose reprints off the original set? Are cards of a later block actually worth MORE because of crap like this. Jesus christ.",
      "posted_by": "AlphaNumerical",
      "posted_at": "8/31/2009 11:16:55 AM",
      "rating": 4
    },
    {
      "content": "Why do these cards exist????The flavor of this card needed to be explained some more to make sense of its significance to Dominia...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:47:30 PM",
      "rating": 4
    },
    {
      "content": "The only time cards like this should exist is in un-sets. Period.",
      "posted_by": "Toes_of_Krosa",
      "posted_at": "8/31/2011 8:29:11 AM",
      "rating": 4
    },
    {
      "content": "The mechanics of this card weird me out. 1.5/5.",
      "posted_by": "BongRipper420",
      "posted_at": "6/3/2012 10:27:36 PM",
      "rating": 4
    },
    {
      "content": "Yeah, why are there cards that are set based?",
      "posted_by": "Arachibutyrophobia",
      "posted_at": "7/19/2009 12:56:29 PM",
      "rating": 2
    },
    {
      "content": "Idea for 'build a better Cylex'. The 'hose an expansion' thing is dumb, but this particular one needs more love because it is responsible for....ummm...Magic: the Gathering as we know it, as opposed to every war being technological advances in artifice (basically, the real world).\nUrza's Sylex  CMC 3\nLegendary Artifact- Mythic Rare\n1, T: Add one mana of any color to your mana pool.\nT: Destroy all artifacts, creatures, and lands from antiquity (before the Modern card frame), \nthen exile Urza's Cylex.\nI'm letting Planeswalkers and Enchantments live because: \na) not too many broken enchantments, and a cheap repeatable Obliterate\nis not a card you should want to make. This will still leave you a game to work with, \nbut not much.\nb) I made it cheaper to cast than Disk so it'd be interesting, and Legendary because it's \nobviously Legendary.\nc) It exiles itself, which is a better way of preventing repeated use than leaving open the possibility \nof making it Indestructible.\nd) I choose destroy over exile because I have a strange Vorthos-sense tingling telling me that that's what it does. Exile and Destroy are not just interchangeable, and the things affected should go to the graveyard. If I wanted to design something that blew a hole in TIME, I'd probably make it exile. This merely causes great physical energies to be released. Definitely a 'destroy' effect.\ne) Destroying cards from a setting is...interesting- but too narrow a 'search' and the card is just weak.\nFurther, *nearly* all the Truly Dangerous and Ancient Artifacts of Power come from the before-time, before 8th Edition. SO I am also really liking the flavor of 'This kills every troublesome thing from Mox Sapphire to the Mirari' :)\nf) and lastly, I made it a filter-mana stone, because this is how Urza learned sorcery, and this ability suddenly makes it MUCH more interesting on a number of levels than any comparable artifact. This thing is pretty wierd, but I think not really broken, and definitely not useless. :D",
      "posted_by": "DarthParallax",
      "posted_at": "6/7/2012 1:00:36 AM",
      "rating": 2
    },
    {
      "content": "Fill with mana! Set it then forget it!",
      "posted_by": "@go",
      "posted_at": "6/22/2012 7:05:00 AM",
      "rating": 0
    },
    {
      "content": "WHAT?! one of the weirdest cards ever...does it destroy only cards that were originally printed in antiquities, or cards with the expansion symbol (lands)?",
      "posted_by": "O0oze",
      "posted_at": "11/4/2013 11:14:43 AM",
      "rating": 0
    },
    {
      "content": "Sick anti-Workshop and anti-Tron tech!...Still doesn't make it good, of course.",
      "posted_by": "Continue",
      "posted_at": "3/13/2014 2:21:43 PM",
      "rating": 0
    },
    {
      "content": "To those who suggested they print a set hoser for pre-modern card frame shenanigans, they did. It's called True-name Nemesis and it is partially responsible for a fairly large decline in the popularity of legacy as a format.",
      "posted_by": "Drewskithelegend",
      "posted_at": "5/15/2014 7:48:21 PM",
      "rating": 0
    }
  ],
  "1008": [
    {
      "content": "\"Ain't she a beaut?\"",
      "posted_by": "Trygon_Predator",
      "posted_at": "4/26/2012 8:56:53 AM",
      "rating": 10
    },
    {
      "content": "Another colorless pinger, however this is far too restrictive, I would still go with Tim...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:49:06 PM",
      "rating": 8
    },
    {
      "content": "There was a day...And yes, even them Tim was far better.",
      "posted_by": "Anathame",
      "posted_at": "10/27/2011 12:19:25 AM",
      "rating": 0
    },
    {
      "content": "Way too costly for a limited effect.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:55:07 AM",
      "rating": 0
    },
    {
      "content": "I used to use this guy a bit back in the day.  Dunno if that was a good thing or a bad thing, but I always enjoyed plinking Scryb Sprites with them.  Baha.",
      "posted_by": "Quentil",
      "posted_at": "7/11/2012 3:11:56 PM",
      "rating": 0
    },
    {
      "content": "Grapes are for eating or making jelly with. Why would you shoot them at bats?",
      "posted_by": "car2n",
      "posted_at": "5/9/2014 2:51:16 PM",
      "rating": 0
    }
  ],
  "1040": [
    {
      "content": "This card suffered from needing new Oracle wording (although it obviously did need it). Too clunky to take seriously, unfortunately.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 3:31:08 PM",
      "rating": 10
    },
    {
      "content": "Drop the cost by a mana, and this might of seen play...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:50:11 PM",
      "rating": 10
    },
    {
      "content": "There's just no good wording here, it has to hit attacking artifact critters, while also punishing artifact activations...they did the best they could :/Anyway, it is a bit expensive, but it, against the right deck, can be very punishing :P",
      "posted_by": "izzet_guild_mage",
      "posted_at": "6/2/2010 9:52:02 PM",
      "rating": 10
    },
    {
      "content": "My only combo consideration would be Mycosynth Lattice, then sit back with a few counterspells to protect it.  Since all permanents become artifacts, if they do anything they will take damage.",
      "posted_by": "chiknstu",
      "posted_at": "11/13/2012 7:34:05 PM",
      "rating": 10
    },
    {
      "content": "Oh look, its one of them new-fangled Myr Galvanizer or Myr Battlesphere decks... shucks, too bad for them...",
      "posted_by": "DarkCerberusXX",
      "posted_at": "11/16/2010 3:34:27 PM",
      "rating": 10
    },
    {
      "content": "this thing completely ends an affinity deck.",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 6:35:07 AM",
      "rating": 10
    },
    {
      "content": "Painful wording, but an interesting idea. Also, it is a logical way for black to mess with artifacts... too bad black has basically lost that ability entirely over the years.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:56:02 AM",
      "rating": 10
    },
    {
      "content": "Manabarbs for artifacts.Reverse Powerleech.",
      "posted_by": "HuntingDrake",
      "posted_at": "5/21/2013 8:35:10 PM",
      "rating": 10
    },
    {
      "content": "Flavour's kind of a mess. Some kind of black wind spell that attracts malicious spirits to your opponent's artifacts? Grokable fantasy staples at their finest.",
      "posted_by": "TPmanW",
      "posted_at": "1/27/2014 11:22:57 PM",
      "rating": 0
    }
  ],
  "1041": [
    {
      "content": "\"Such a beautiful child. What will you name her?\"\"Hurkyl. She will be named Hurkyl.\"",
      "posted_by": "Himborg",
      "posted_at": "7/13/2012 8:25:30 PM",
      "rating": 10
    },
    {
      "content": "An incredible card for a low cost - hoses artifact decks, attacking indestructibles, tinkered tricks, colored artifact shenanigans, and stolen artifacts (go back to your hand).  Also works on your own cards for quick mana like Pontiac mentioned.  So versatile, so good, and probably never coming back. :(",
      "posted_by": "Equinox523",
      "posted_at": "6/22/2011 11:13:45 AM",
      "rating": 10
    },
    {
      "content": "Powerful on both offense and defense, as well being a cheap instant - this card is great even in today's environment.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 9:59:18 AM",
      "rating": 10
    },
    {
      "content": "A lot of thirty-somthing guys have nice recall when it comes to Hurkyl...",
      "posted_by": "Lord_of_Tresserhorn",
      "posted_at": "3/3/2012 4:45:43 PM",
      "rating": 10
    },
    {
      "content": "A great card, serves as a anti-affinity or anti-Esper tech, it's also nicely costed so that other decks can use it as well, one of the better Antiquities cards...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:52:16 PM",
      "rating": 9
    },
    {
      "content": "Bewbs.",
      "posted_by": "boneclub",
      "posted_at": "9/10/2011 2:18:32 PM",
      "rating": 8
    },
    {
      "content": "A heck of a lot of power for 1B. 4/5",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "3/30/2011 3:18:03 AM",
      "rating": 6
    },
    {
      "content": "Wait a minute... Are those boobs? On a magic card? FANSERVICE!",
      "posted_by": "God_Of_The_Smurfs",
      "posted_at": "2/10/2011 5:21:31 PM",
      "rating": 5
    },
    {
      "content": "Play with Moxen, Solring, Mana Vault, Grim Monolith and Mana Crypt for shocking mana generation.",
      "posted_by": "Pontiac",
      "posted_at": "3/24/2011 11:00:34 AM",
      "rating": 4
    },
    {
      "content": "This card + Mycosynth Lattice = WOW!",
      "posted_by": "Voltin",
      "posted_at": "2/5/2012 5:15:11 PM",
      "rating": 0
    },
    {
      "content": "So good, especially in a vintage storm deck where you can generate stupid mana by bouncing then re casting all your busted mana rocks (moxen, sol ring,mana crypt,mana vault) and then using the mana and storm count to win. Also just good in vintage in general, where workshop decks run rampant.",
      "posted_by": "Lazrbeams",
      "posted_at": "4/28/2014 7:48:35 PM",
      "rating": 0
    }
  ],
  "1009": [
    {
      "content": "Beautiful artwork. I'd put a print of that on my wall.Oh and also, a classic and powerful card.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 3:41:06 PM",
      "rating": 10
    },
    {
      "content": "You'll never see another card like this, Wizards does not like to encourage players to hoard spells in their hand...control has loved this card for years...This is also a great piece of artwork...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:53:45 PM",
      "rating": 9
    },
    {
      "content": "I have this card...it's just so...EPIC to put in my deck...*tears* I mean, look at that ART!!",
      "posted_by": "Jokergius",
      "posted_at": "8/29/2009 9:56:59 PM",
      "rating": 7
    },
    {
      "content": "Amazing c.l.a.s.s.i.c. Ass that censor.",
      "posted_by": "Duskdale_Wurm",
      "posted_at": "6/26/2010 7:58:53 PM",
      "rating": 5
    },
    {
      "content": "Broken. 5/5",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 7:05:06 AM",
      "rating": 3
    },
    {
      "content": "It's totally not restricted...",
      "posted_by": "SirDoom",
      "posted_at": "8/3/2009 9:11:08 PM",
      "rating": 2
    },
    {
      "content": "@Guest: I don't know if Venser's Journal proves you wrong or right.",
      "posted_by": "ClockworkSwordfish",
      "posted_at": "11/6/2010 5:09:29 PM",
      "rating": 0
    },
    {
      "content": "god... when i was a kid i *** hated this card. now i play them constantly. makes me all teary-eyed.",
      "posted_by": "gasimakos1",
      "posted_at": "5/13/2011 4:06:19 PM",
      "rating": 0
    },
    {
      "content": "Now who ever said life gain was crap? Play against someone who has this in play from turn 1, then go figure out how long you will take to win before he destroys you",
      "posted_by": "Paladin85",
      "posted_at": "9/7/2011 8:10:24 AM",
      "rating": 0
    },
    {
      "content": "Those inhabitants of the Ivory Tower obviously didn't watch School House Rock.Otherwise they would know that KNOWLEDGE IS POWER!!!!",
      "posted_by": "KilnFiend",
      "posted_at": "1/21/2013 2:24:13 PM",
      "rating": 0
    },
    {
      "content": "Ivory Tower and Lich: the original suicide black power combo!!As you probably guessed, I'm not a fan of Disenchant....",
      "posted_by": "SeriouslyFacetious",
      "posted_at": "9/5/2013 9:11:00 AM",
      "rating": 0
    }
  ],
  "1010": [
    {
      "content": "Not bad for its time. Card draw used to be really hard to find - even blue card draw was often rare and in high-demand. Could be used even today if you wanted cards in the graveyard. Also, this Tome basically replaced Jandor's Ring, which was an awful (yet similar) card.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:00:26 AM",
      "rating": 10
    },
    {
      "content": "A decent colorless Merfolk Looter...I've actually never seen it in play however...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:56:15 PM",
      "rating": 10
    },
    {
      "content": "Library of leng works well with this...choose where to discard..",
      "posted_by": "pwdrrider",
      "posted_at": "2/20/2010 9:09:58 PM",
      "rating": 10
    },
    {
      "content": "",
      "posted_by": "DlCK",
      "posted_at": "6/25/2011 7:08:08 PM",
      "rating": 0
    }
  ],
  "1069": [
    {
      "content": "This cards was designed for use with artifacts like Armageddon Clock, Copper Tablet, and Bottle of Suleiman. It shows some age now but still a solid card with some real uses.",
      "posted_by": "snyden",
      "posted_at": "9/25/2009 2:41:54 AM",
      "rating": 10
    },
    {
      "content": "Is that an early Koth of the Hammer?",
      "posted_by": "divine_exodus",
      "posted_at": "12/9/2010 2:30:29 PM",
      "rating": 10
    },
    {
      "content": "Artifacts haven't been played widely enough to make this card worthwhile...This would be only a speed bump against Affinity, makign this card vastly inferior to Veteran Bodyguard...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 12:57:53 PM",
      "rating": 8
    },
    {
      "content": "Because I'm so very afraid of Rod of Ruin :P",
      "posted_by": "BastianQoU",
      "posted_at": "6/3/2011 7:38:43 AM",
      "rating": 6
    },
    {
      "content": "While \"bodyguards\" weren't all that successful since it was usually just better to either destroy the threat or your opponent, this card is more useful today than it was when printed thanks to the vast increase in artifact creatures. Unfortunately, all that really means is that these guys will soak the damage for 1 turn and still die - just play removal instead.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:02:19 AM",
      "rating": 0
    },
    {
      "content": "Notably nippley",
      "posted_by": "tasteful",
      "posted_at": "2/27/2014 2:19:57 AM",
      "rating": 0
    }
  ],
  "1011": [
    {
      "content": "Considering how powerful the Mightstone and Weakstone were in the fiction, this thing is just sad.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:02:57 AM",
      "rating": 10
    },
    {
      "content": "The Orfiflamme only affects your creatures.  This boosts your opponent's, too.",
      "posted_by": "sonorhC",
      "posted_at": "9/20/2011 10:24:00 PM",
      "rating": 10
    },
    {
      "content": "the mightstone!!! the first artifact owned by the great Urza in the Artifact Cycle saga... This and the weakstone owned by it's brother Mishra give death to their mentor Tocasia... While the two brothers were arguing in Urza's bedroom...",
      "posted_by": "ederchan",
      "posted_at": "6/22/2009 10:49:05 AM",
      "rating": 10
    },
    {
      "content": "A colorless Orcish Oriflamme, quite the useful card...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:00:30 PM",
      "rating": 5
    }
  ],
  "1012": [
    {
      "content": "They didn't really 'errata-ed in tapping'. It's a \"Mono Artifact\" which does indeed require tapping it to use it's ability.In the old days, Artifacts were Mono (tap to use) , Poly (doesn't tap, but has an activation), or Continuous (always on effect). In the Revised set, they changed the terminology and added the 'tap symbol'.",
      "posted_by": "PastProphet",
      "posted_at": "9/25/2009 7:39:34 AM",
      "rating": 10
    },
    {
      "content": "Hell, the name is so well known, even other games call these decks \"mill\" decks. I didn't know why until I saw this card :)",
      "posted_by": "boneclub",
      "posted_at": "3/16/2010 10:57:29 PM",
      "rating": 10
    },
    {
      "content": "The iconic \"mill\" card.  Love it or hate it, you still respect it.",
      "posted_by": "JacksJokeShop",
      "posted_at": "8/14/2009 4:25:41 PM",
      "rating": 10
    },
    {
      "content": "It defined an entire victory condition - \"milling.\"\nNot too powerful, but it was epic for its time, if for no other reason than it got folks thinking about other ways to win the game.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:04:28 AM",
      "rating": 10
    },
    {
      "content": "I played this when no on in my play circle (including me) knew about Mono Artifacts. I would deck people regularly, rofl. Was one of my favorite cards :)",
      "posted_by": "Mudbutt_on",
      "posted_at": "11/30/2009 10:07:52 PM",
      "rating": 10
    },
    {
      "content": "More than one mage was driven insane by how this card never changed its flavor text.",
      "posted_by": "Asmodi0000",
      "posted_at": "4/29/2011 10:20:25 AM",
      "rating": 10
    },
    {
      "content": "The namesake of an entire strategy, Milling, this card rarely sees play in its own archetype...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:07:44 PM",
      "rating": 9
    },
    {
      "content": "This card would be so much better if they hadn't errata-ed in tapping.",
      "posted_by": "Sooku",
      "posted_at": "7/22/2009 11:24:55 PM",
      "rating": 1
    },
    {
      "content": "With all the mill cards that exist today, it's amusing to see the strategy's humble beginnings.",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/24/2012 8:16:37 AM",
      "rating": 0
    },
    {
      "content": "Anybody else notice how with R&D's Secret Lair you can put your opponent's cards in your graveyard or vice versa?",
      "posted_by": "VDZx",
      "posted_at": "1/7/2013 4:33:59 PM",
      "rating": 0
    },
    {
      "content": "@SookuIt'd be better if they hadn't errata'ed the second \"target player\" into \"that player\".",
      "posted_by": "AdrianTrumbly",
      "posted_at": "6/13/2013 5:50:17 PM",
      "rating": 0
    }
  ],
  "1072": [
    {
      "content": "Malachorn is right, I can't even begin to recall all the beatdowns I have applied thanks to this card.",
      "posted_by": "themicronaut",
      "posted_at": "9/12/2009 5:50:18 PM",
      "rating": 10
    },
    {
      "content": "Treetop Village and Faerie Conclave and all those lands came into play tapped and cost 2 mana to activate and turn the lands into creatures.  Mishra's Factory is strictly better in that respect.  The tradeoff, of course, is that it doesn't give you the colored mana that that line of lands gave you... well worth the tradeoff.\nMutavault, of course, would be a more recent card that is scarily similar to Mishra's Factory.  Mutavault, of course, gets played very heavily.  Mutavault probably is better in decks that have some kind of theme and can take advantage of the \"all creature types\" part of the creature... but Mishra's Factory is still better and the +1/+1 ability actually gets used more than you'd want to think it would.\nThat's right, Mishra's Factory is generally better than Mutavault and the other creature-lands.  That's saying a fair amount and the real point is that Mishra's Factory is SWEETNESS.\nI loves it.",
      "posted_by": "Malachorn",
      "posted_at": "7/12/2009 8:18:42 PM",
      "rating": 9
    },
    {
      "content": "Spring.",
      "posted_by": "MagicMTG",
      "posted_at": "8/6/2010 9:35:27 AM",
      "rating": 1
    },
    {
      "content": "Malachom, you are so right. I like Mutavault, because it does have the type relevancy when dealing with tribal decks. But Mishra's Factory is just....awesome. SWEETNESS, as you put it. And I have four the non Antiquities ones, and I love them to death. The constantly rotate in and out of decks, and they are relevant and frighteningly effective no matter where I put them.",
      "posted_by": "Lateralis0ne",
      "posted_at": "9/13/2010 3:35:26 PM",
      "rating": 0
    },
    {
      "content": "How come some from Antiquities are rare, while others are uncommon?",
      "posted_by": "Superllama12",
      "posted_at": "2/13/2011 12:56:47 PM",
      "rating": 0
    },
    {
      "content": "For the fourth time, OLD SCHOOL ROCKS! And check out Assembly-Worker.\n5/5",
      "posted_by": "Duskdale_Wurm",
      "posted_at": "3/22/2011 2:33:14 AM",
      "rating": 0
    }
  ],
  "1071": [
    {
      "content": "A house. This frequently played as an uncounterable first-turn 2/2 that was immune to Wrath of God. An efficient threat in both aggro and control decks of its time, this was one of the best cards in both Antiquities and Fourth Edition.",
      "posted_by": "jeff-heikkinen",
      "posted_at": "4/30/2009 1:21:08 AM",
      "rating": 10
    },
    {
      "content": "The original Man-Land, and remains the best...Every deck seemed to play this land simply because nothing could stop it...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:18:17 PM",
      "rating": 8
    },
    {
      "content": "Treetop Village and Faerie Conclave and all those lands came into play tapped and cost 2 mana to activate and turn the lands into creatures. Mishra's Factory is strictly better in that respect. The tradeoff, of course, is that it doesn't give you the colored mana that that line of lands gave you... well worth the tradeoff. \nMutavault, of course, would be a more recent card that is scarily similar to Mishra's Factory. Mutavault, of course, gets played very heavily. Mutavault probably is better in decks that have some kind of theme and can take advantage of the \"all creature types\" part of the creature... but Mishra's Factory is still better and the +1/+1 ability actually gets used more than you'd want to think it would. \nThat's right, Mishra's Factory is generally better than Mutavault and the other creature-lands. That's saying a fair amount and the real point is that Mishra's Factory is SWEETNESS.",
      "posted_by": "Malachorn",
      "posted_at": "7/12/2009 8:20:30 PM",
      "rating": 8
    },
    {
      "content": "cheaper then the sweat shops in asia",
      "posted_by": "ttian",
      "posted_at": "3/27/2009 6:21:58 PM",
      "rating": 5
    },
    {
      "content": "Fall or Autumn.",
      "posted_by": "MagicMTG",
      "posted_at": "8/6/2010 9:36:11 AM",
      "rating": 0
    },
    {
      "content": "Gotta love old school.\n5/5",
      "posted_by": "Duskdale_Wurm",
      "posted_at": "3/22/2011 2:31:24 AM",
      "rating": 0
    },
    {
      "content": "I think the best thing about this card is that it had 4 different images, exactly the same, except during different seasons, lol.Okay, the fact that it' awesome is also probably the best thing.",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/24/2012 8:27:51 AM",
      "rating": 0
    },
    {
      "content": "One thing people tend to overlook is that the +1/+1 ability can be used on itself after blocking for an effective 3/3.",
      "posted_by": "LordRandomness",
      "posted_at": "3/14/2013 10:44:20 PM",
      "rating": 0
    },
    {
      "content": "This looks like a snapshot of the smurfs' home.",
      "posted_by": "-TheFlameReaper-",
      "posted_at": "5/29/2013 5:10:17 AM",
      "rating": 0
    }
  ],
  "1074": [
    {
      "content": "Its wintertime, but Mishra's Keebler Elves are hard at work making delicious cookies for him to devour nonetheless.",
      "posted_by": "Kryptnyt",
      "posted_at": "3/28/2011 2:21:50 PM",
      "rating": 10
    },
    {
      "content": "Old school but greatest land of all time.\n5/5",
      "posted_by": "Duskdale_Wurm",
      "posted_at": "3/22/2011 2:29:49 AM",
      "rating": 10
    },
    {
      "content": "Why is this uncommon, but the other versions are rare?  Is it cuz of the U1's and U2's?",
      "posted_by": "Superllama12",
      "posted_at": "4/29/2011 4:55:01 PM",
      "rating": 10
    },
    {
      "content": "@channelblaze: I'm pretty certain that it would remain a creature, but turn back at end of turn. Removing an ability does not cause the ability's time limit to go away. I'm not really a rules guy, so I'd look a little more in-depth before going off what I said, though.",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/24/2012 8:30:38 AM",
      "rating": 10
    },
    {
      "content": "The classic Mutavault, probably one of the greatest attacking lands out there.",
      "posted_by": "Akatosh",
      "posted_at": "11/17/2008 12:07:18 AM",
      "rating": 10
    },
    {
      "content": "Never realized the original version had a different artwork for every season. Although I wonder why 3 are common and one is uncommon...",
      "posted_by": "NARFNra",
      "posted_at": "11/23/2010 8:25:44 PM",
      "rating": 9
    },
    {
      "content": "Woot! best land ever!",
      "posted_by": "Guest1467942152",
      "posted_at": "11/14/2008 2:57:23 PM",
      "rating": 7
    },
    {
      "content": "Not as good as Treetop Village, but possibly the next-best manland.",
      "posted_by": "stygimoloch",
      "posted_at": "12/1/2008 3:09:26 PM",
      "rating": 4
    },
    {
      "content": "@channelblaze I'm pretty sure it would. In fact, since it loses the \"until end of turn clause\" You now have a permanent 2/2 Island. congrats.",
      "posted_by": "WhiteyMcFly",
      "posted_at": "10/25/2010 9:09:00 PM",
      "rating": 1
    },
    {
      "content": "If I animated it on my opponent's turn, then they cast spreading seas on it, would it still be a creature until end of turn?Edit: @WhiteyMcFly: Thanks, I thought it would stay a creature. I didn't know it would stay forever, but that sounds right. Thanks =) This came up in an EDH game, and we didn't know what to do.",
      "posted_by": "channelblaze",
      "posted_at": "10/30/2010 11:51:54 AM",
      "rating": 1
    },
    {
      "content": "The funny thing about [u]Antiquities[/u]? \nI can't find a consistent answer to say HOW MANY cards are in it -_- \nGatherer says 85. \nMTGWiki says BOTH 85 and 100, and has a short 'explanatory' paragraph that shows a breakdown of rarities, but does not quickly/clearly state why it gives both 85 and 100 as the number. \nAnd other sites sometimes say 102, which I believe is due to two notable misprints.\nI found this: \n\"[b]Rare[/b] cards are shown in bold text and occur only once (u1) on the uncommon sheet.\n[i]Uncommon[/i] cards are shown in italics and occur either two (u2) or three (u3) times on the uncommon sheet or\nonce (c1) or twice (c2) on the common sheet.\nCommon cards are shown in normal text and occur four (c4) times on the common sheet.\"\nWhich probably helps to explain sets with only U's and C's, but specifically [u]Antiquities[/u] is weird even among those. :P\nhttp://www.crystalkeep.com/magic/lists/files/list-aq.pdf\nAha! Scrolling down....[autocard]Mishra's Factory[/autocard], [autocard]Strip Mine[/autocard], and the Urza Tron all count QUADRUPLE for their arts... o.O\nso, that 3x Factory, 3x Mine, 3x Power Plant, 3x Tower, and 3x Strip...15 more. \n85 + 15 = 100. There. Mystery solved. :)",
      "posted_by": "DarthParallax",
      "posted_at": "9/20/2013 12:59:43 PM",
      "rating": 1
    },
    {
      "content": "Winter.",
      "posted_by": "MagicMTG",
      "posted_at": "8/6/2010 9:36:29 AM",
      "rating": 0
    },
    {
      "content": "This is typically the \"Pimped\" mishra's; probably because it not only looks the nicest but probably also because it's the \"uncommon\" one. Either way, this card is extremely good and still casual friendly. If you want to beef your deck a tiny bit; swapping some basics for this guy is a quick upgrade. A new player may look at this and think \"meh\"; but anyone with a bit of experience can attest it's continued value.May I also point out something fun? Deserted Temple can allow you to double boost meaning if you have a 2 Swamps,a Temple, and a Factory; you can block, boost to a 3/3, then untap it, then boost to a 4/4; all with only one factory! Very fun.",
      "posted_by": "blurrymadness",
      "posted_at": "2/12/2014 10:33:52 AM",
      "rating": 0
    },
    {
      "content": "I would love to see a mash-up of Nightmare before Christmas and The Brothers' War. Mishra could be Jack , and Yawgmoth could be Oogy-Boogy, and Urza will be the mad scientist who then has to take him down!",
      "posted_by": "car2n",
      "posted_at": "5/26/2014 12:17:45 AM",
      "rating": 0
    }
  ],
  "1073": [
    {
      "content": "Hippie Village",
      "posted_by": "JFM2796",
      "posted_at": "7/31/2011 12:31:52 PM",
      "rating": 10
    },
    {
      "content": "Treetop Village and Faerie Conclave and all those lands came into play tapped and cost 2 mana to activate and turn the lands into creatures. Mishra's Factory is strictly better in that respect. The tradeoff, of course, is that it doesn't give you the colored mana that that line of lands gave you... well worth the tradeoff. \nMutavault, of course, would be a more recent card that is scarily similar to Mishra's Factory. Mutavault, of course, gets played very heavily. Mutavault probably is better in decks that have some kind of theme and can take advantage of the \"all creature types\" part of the creature... but Mishra's Factory is still better and the +1/+1 ability actually gets used more than you'd want to think it would. \nThat's right, Mishra's Factory is generally better than Mutavault and the other creature-lands. That's saying a fair amount and the real point is that Mishra's Factory is SWEETNESS.",
      "posted_by": "Malachorn",
      "posted_at": "7/12/2009 8:20:59 PM",
      "rating": 9
    },
    {
      "content": "This card killed me more than you would like to think someone beat me with a creatureless land detruction deck I hate Sinkholes lots now.",
      "posted_by": "Ace8792",
      "posted_at": "3/15/2010 2:31:08 PM",
      "rating": 0
    },
    {
      "content": "Old school rox!\n5/5",
      "posted_by": "Duskdale_Wurm",
      "posted_at": "3/22/2011 2:30:41 AM",
      "rating": 0
    },
    {
      "content": "4 in every deck. 5/5",
      "posted_by": "gasimakos1",
      "posted_at": "5/13/2011 3:54:16 PM",
      "rating": 0
    },
    {
      "content": "What's not to love? It provides mana, deals damage, and can even boost others of its kind - great card!",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:03:34 AM",
      "rating": 0
    }
  ],
  "1013": [
    {
      "content": "This card, bad as it is, somehow inspired Masticore...Why this needed an upkeep cost is beyond me, it alreasy cost 7 mana to cast...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:19:56 PM",
      "rating": 10
    },
    {
      "content": "Lol: Mishra's Workshop can't buy it.  Two Mishra's Workshop can't buy it. But one UrzaTron can pump it out all...day...long...Mishra was an Iconic Villain: Powerful, but Stupide.Urza's 3 land cards together are better than Mishra's 1.Especially since he was smart enough to keep his lands from getting banned,so he gets 12 deck spots, Mishra gets only 1.Workshop is a nice little novelty for collectors: you want to start winning games asap? Just go buy the UrzaTron. Ninth Edition foil playsets can be gotten for less than $20.",
      "posted_by": "DarthParallax",
      "posted_at": "3/1/2012 11:34:36 PM",
      "rating": 10
    },
    {
      "content": "Protip: Goes great in a shoebox!",
      "posted_by": "Pontiac",
      "posted_at": "3/24/2011 11:02:10 AM",
      "rating": 10
    },
    {
      "content": "Yeah, if this is a typical example of Mishra's War Machines, it's no wonder he lost the war.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:05:06 AM",
      "rating": 10
    },
    {
      "content": "One of the most famously awful creatures ever. It's not actually as bad as Wood Elemental, but it's not far off.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 4:16:14 PM",
      "rating": 8
    },
    {
      "content": "I'm pretty sure this would not have been worth it even without the upkeep cost...",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/24/2012 8:41:31 AM",
      "rating": 0
    },
    {
      "content": "Points of damage?1.5/5 Stars",
      "posted_by": "Hunter06",
      "posted_at": "6/5/2013 4:10:07 PM",
      "rating": 0
    },
    {
      "content": "Started playing around 96 when Ice Age was new, stuff like this always fascinated my 11 year old self. Card seemed powerful too lmao",
      "posted_by": "SeriouslyFacetious",
      "posted_at": "8/3/2013 7:09:27 PM",
      "rating": 0
    }
  ],
  "1075": [
    {
      "content": "[i]\"Restrict this? Ugh you sissy. When I started playing there was NO SUCH THING as a Restricted list, it hadn't been thought up yet. If you think this card is so bad, go play against a TRUE Balance deck, one that has 12 Balance, 12 Jade Statue, and Moxes, and nothing else, and watch how every turn you're discarding your hand, and killing everything you have in play while they then activate Statues to send over to you. Or better yet, play someone like me who kept a copy of a Stasis deck around with 4 Kismet, 4 Time Elemental, and 4 Stasis, and then threw in Chronatogs to make you sit there doing NOTHING until you decked yourself. Can't understand how people can whine about a Land when years ago Library of Alexandria was unrestricted and so was Ancestral Recall.\"[/i]\nBoth Stasis and Balance decks were [i]so fun[/i] to play against that they should be the kind of things Wizards tries to preserve and replicate. Magic: the game where you have cards you can't play -- try keeping that business venture afloat for more than a year.",
      "posted_by": "scumbling1",
      "posted_at": "5/4/2011 6:01:40 PM",
      "rating": 10
    },
    {
      "content": "This is not restricted because players who'd forked over $$$ for a playset started whining...go figure",
      "posted_by": "spectermonger",
      "posted_at": "3/25/2010 6:48:02 PM",
      "rating": 10
    },
    {
      "content": "Wait why didn't Mishra win the war?Oh and technically Mishra is not necessarily canonically dead (along with squee), Hes just chilling in what remains of the seventh or sixth sphere i believe.",
      "posted_by": "Gramcrackers",
      "posted_at": "12/13/2010 2:57:45 PM",
      "rating": 10
    },
    {
      "content": "Where's the scars of mirrodin reprint?\nEDIT\nI just noticed the face in the art. It's like:\no_O",
      "posted_by": "divine_exodus",
      "posted_at": "4/22/2011 5:44:44 PM",
      "rating": 10
    },
    {
      "content": "This could give you only {2} and still be immensely playable. Compare with Temple of the False God, which won't even give you mana for multiple turns. This thing gives you mana right from turn 1, and with all the mana rocks available you can start churning out a bunch of stuff that aren't even artifacts.",
      "posted_by": "sarroth",
      "posted_at": "12/6/2011 1:36:55 PM",
      "rating": 10
    },
    {
      "content": "I love how slackwarewolf goes on about his 20 Black Lotus, 20 Plague Rat decks here, then on other cards talks about how ante was designed to prevent people from buying their way to victory. It's delicious hypocrisy, to the point where I think he's just a huge troll. If he's not, I have a message for him: It's not 1993 anymore. The game has changed. Get over it.Yeah, this card is broken in half. Didn't the antiquities designers realize that this card would pretty much put an upper limit on how good they could make artifacts? Two of these and I can pop out a Wurmcoil Engine on turn 2... turn 1 if I have a Black Lotus, lol. Oh well, at least it's next to impossible to get, so we don't have to worry about that.",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/24/2012 11:43:38 AM",
      "rating": 10
    },
    {
      "content": "This is what happens to lands who say their prayers and take their vitamins. Even if they hang posters of Tolarian Academy on their walls...",
      "posted_by": "stygimoloch",
      "posted_at": "12/1/2008 3:16:02 PM",
      "rating": 10
    },
    {
      "content": "They should have realized what they were doing even back then.\nSeriously, this is absurd.",
      "posted_by": "Kirbster",
      "posted_at": "7/11/2010 10:25:27 PM",
      "rating": 10
    },
    {
      "content": "Just imagine this card in Mirrodin. It would dominate.",
      "posted_by": "Dr_Draco",
      "posted_at": "7/15/2009 5:17:19 PM",
      "rating": 10
    },
    {
      "content": "One of the cornerstones of Vintage and one of the best lands ever printed...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:22:04 PM",
      "rating": 9
    },
    {
      "content": "Repeatable black lotus in artifact descks? Yes please.",
      "posted_by": "ClockworkSwordfish",
      "posted_at": "1/20/2010 7:14:15 PM",
      "rating": 9
    },
    {
      "content": "@slackwarewolf\nAre you saying that because at one point in time the game was unbalanced that it should stay that way forever? I mean, clearly they put the 4 card rule in place for a reason; the game was becoming much less enjoyable without it. \nHonestly there is a reason this card is banned in Legacy, and it would not be crazy to restrict it in vintage either.",
      "posted_by": "Silverware",
      "posted_at": "11/13/2010 6:28:48 PM",
      "rating": 9
    },
    {
      "content": "I use these to play a Turn 1 Metalworker so I can activate Myr Incubator on Turn 2.What?",
      "posted_by": "Ragamander",
      "posted_at": "1/21/2012 5:27:38 PM",
      "rating": 9
    },
    {
      "content": "Simply the best land ever printed. With the advent of Lodestone Golem I suspect these will be even more popular in Type 1. Suddenly Workshop Aggro is a viable option once again.",
      "posted_by": "Kartakass",
      "posted_at": "3/19/2010 2:22:28 PM",
      "rating": 8
    },
    {
      "content": "Wow it's so funny how some people gets all butt hurt because of someone else's comment. Dude no one cares how many balance's were in someone's deck and how they would get their a** kicked, or how you threw forty black lotus or forty eight moxes in your deck. You sound like some dude that thinks he's some old school pro that know's everything. It's not fun playing with those broken combos. I respect them and the people who figured them out were genius's but just because you can copy someone's deck list doesn't make you a godsend. Haha, anyways, this card is freakin awesome!! I love the old school flavor! The art is horrible but it feels GOOOD!",
      "posted_by": "EvilCleavage",
      "posted_at": "6/13/2010 8:14:05 PM",
      "rating": 8
    },
    {
      "content": "Mishra: \"WTF Are you all you guys doing, get out of my workshop\"",
      "posted_by": "thedarkheathen",
      "posted_at": "8/4/2010 5:30:37 AM",
      "rating": 8
    },
    {
      "content": "Shame it cost's about 150 to buy or I'd definately get a playset.",
      "posted_by": "Cheesesack",
      "posted_at": "12/29/2009 1:35:32 PM",
      "rating": 8
    },
    {
      "content": "The irony of all this is that Mishra's Workshop and Factory apparently were used mostly to churn out Mishra's War Machines. I think that explains why he lost the war. While his production abilities were superior to Urza, he simply had no idea how to build anything that was a real threat. Poor guy!\nOh, yeah, as for this card, clearly stupidly broken, even back then.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:06:47 AM",
      "rating": 8
    },
    {
      "content": "PLEASE restrict this card in Type 1! It is broken! It should have never been unrestricted.",
      "posted_by": "UNBAN_SHAHRAZAD",
      "posted_at": "8/12/2009 6:00:43 PM",
      "rating": 7
    },
    {
      "content": "it does need to be restricted, and anywhys i like the good old lighting bolt, mox rubby wheel of fourtene combo.",
      "posted_by": "18scsc",
      "posted_at": "10/7/2010 5:34:43 PM",
      "rating": 7
    },
    {
      "content": "Just imagine if they reprinted this today, it would be even more game breaking that skull clamp. Artifacts must erally have sucked when this was made, or they were just drunk while designing it. I mean, black lotus at least requires a sac, this on the other hand... and it's not even legendary Oo",
      "posted_by": "Sironos",
      "posted_at": "2/14/2011 4:35:17 PM",
      "rating": 7
    },
    {
      "content": "this is where mishra works obviously",
      "posted_by": "ttian",
      "posted_at": "3/24/2009 9:37:29 AM",
      "rating": 6
    },
    {
      "content": "@divine_exodus: Very funny.",
      "posted_by": "SolidSoldier",
      "posted_at": "1/14/2011 12:08:02 AM",
      "rating": 6
    },
    {
      "content": "I just remembered how this broke the STAX archtype back in its genesis moment. I want to get one or two now for the casual model I've been tinkering with. Now to find 640 USD to fork over.......",
      "posted_by": "Lateralis0ne",
      "posted_at": "7/20/2010 8:42:03 AM",
      "rating": 5
    },
    {
      "content": "Ooooh sadface. :(See, here I was thinking, 'what would be the cheapest set in Magic to just go on Ebay and plain BUY all the cards in?And then, I hit this card....apparently not this set. :p*EDIT: Setting my sights lower, to only get remotely playable cards that aren't banned in the format I want to use them, Antiquities is still looking pretty nice. It's so small, I'd only need to get, like, 10 cards. If that. :)",
      "posted_by": "DarthParallax",
      "posted_at": "3/1/2012 11:30:15 PM",
      "rating": 4
    },
    {
      "content": "Restrict this? Ugh you sissy. When I started playing there was NO SUCH THING as a Restricted list, it hadn't been thought up yet. If you think this card is so bad, go play against a TRUE Balance deck, one that has 12 Balance, 12 Jade Statue, and Moxes, and nothing else, and watch how every turn you're discarding your hand, and killing everything you have in play while they then activate Statues to send over to you. Or better yet, play someone like me who kept a copy of a Stasis deck around with 4 Kismet, 4 Time Elemental, and 4 Stasis, and then threw in Chronatogs to make you sit there doing NOTHING until you decked yourself. Can't understand how people can whine about a Land when years ago Library of Alexandria was unrestricted and so was Ancestral Recall.",
      "posted_by": "SlackWareWolf",
      "posted_at": "3/14/2010 5:51:08 AM",
      "rating": 4
    },
    {
      "content": "So, so, sick.\nSo happy I have one... Bought an entire Antiquities set, at most SP, mostly EX-NM, in 1996 for about 50$. Boo ya.\nAlso, EDH legal, awesome!!\nTo bad there are only three legendary Artifact creatures that are colorless: Karn, Bosh and Memnarch.",
      "posted_by": "Lord_of_Tresserhorn",
      "posted_at": "3/13/2012 5:04:31 PM",
      "rating": 3
    },
    {
      "content": "this shit doesnt even stand up to freakin... urza's mine, man!!!!!\nseriously, though, wtf is with the prices on these cards recently? this is *** ***",
      "posted_by": "gasimakos1",
      "posted_at": "5/1/2011 11:02:27 PM",
      "rating": 2
    },
    {
      "content": "This. Is. Just. So. Good. I. Can't. Breath. Anymore. *gasp*",
      "posted_by": "Dark_Raider",
      "posted_at": "11/13/2009 9:14:27 AM",
      "rating": 2
    },
    {
      "content": "Absoloutley Amazing Fits In So Many Of My Decks, On Turn I Can Play 3 Arcbound Workers HaHa",
      "posted_by": "MasterOfEtherium",
      "posted_at": "12/26/2010 7:55:19 PM",
      "rating": 2
    },
    {
      "content": "So this bad boy is now going for about $1250 (low end) for a playset. Absolutely one of the most broken to hell cards in all of magic. Imagine playing an affinity deck with this thing. LOLWhatever R&D was smoking back when they made this must have been really good stuff. LOL",
      "posted_by": "landboysteve",
      "posted_at": "12/28/2011 8:41:47 AM",
      "rating": 0
    },
    {
      "content": "@slackwarwolf Can you say Pay 2 Win for me please? Because that is what you are! I bet you like to talk smack after you beat some new player too.",
      "posted_by": "TheWrathofShane",
      "posted_at": "10/16/2012 2:21:29 AM",
      "rating": 0
    },
    {
      "content": "what the hell?? WHAT THE HELL??This is madness.",
      "posted_by": "Lueseto",
      "posted_at": "5/7/2013 7:38:05 PM",
      "rating": 0
    }
  ],
  "1014": [
    {
      "content": "Hey, at least you can return it to your hand for 6 mana and save yourself any further embarrassment for playing it...",
      "posted_by": "raptorjesus69",
      "posted_at": "9/8/2010 8:20:27 PM",
      "rating": 9
    },
    {
      "content": "It's no Rakalite, but it's really bad nonetheless. At least you can drop it early.",
      "posted_by": "Auteur",
      "posted_at": "12/8/2009 10:57:37 PM",
      "rating": 8
    },
    {
      "content": "Worst card in Antiquities. And this was the set containing Mishra's War Machine. I have always had an unnatural loathing for this card, unmatched right up until they printed Blood Funnel.I mean seriously, SIX mana? SIX FRIGGING MANA? And for that I can't even return something stolen by my opponent? GAH!",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 4:34:18 PM",
      "rating": 7
    },
    {
      "content": "What?! This piece of **** was reprinted?!\nTWICE?!?!?\nAND IN A CORE SET?!!?!?!!?!",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 6:40:52 AM",
      "rating": 6
    },
    {
      "content": "And it's a rare?",
      "posted_by": "Volcre",
      "posted_at": "10/1/2009 10:41:25 AM",
      "rating": 6
    },
    {
      "content": "bad bad bad card.... dissapointit should of been choose any umber of permanents you control or something less restrictive",
      "posted_by": "Ava_Adore",
      "posted_at": "2/10/2011 8:20:18 AM",
      "rating": 6
    },
    {
      "content": "How did anyone think that this card would be useful...6 mana activation better win me the game...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:24:55 PM",
      "rating": 5
    },
    {
      "content": "they should undo this card because it's so bad",
      "posted_by": "ttian",
      "posted_at": "3/24/2009 7:17:28 AM",
      "rating": 3
    },
    {
      "content": "It's not that bad - you can trigger a bunch of comes into play and leaves play effects with this and do it with ease.",
      "posted_by": "Lege",
      "posted_at": "10/22/2009 10:03:21 AM",
      "rating": 3
    },
    {
      "content": "To anyone trying to justify this jank- there is no reason why it costs six mana to use. Just because you can pay it doesn't mean you should. MarlinFlake, you had best be trolling. I can surround any turd with three good cards and get a better effect than lifegain and card draw. Hell, with Pridemates, Wardens, and six mana, I'd better be popping off some kind of infinite ETB combo.",
      "posted_by": "blindthrall",
      "posted_at": "3/16/2011 11:58:38 PM",
      "rating": 2
    },
    {
      "content": "Total trash, even for its time.\nHad Antiquities been full of critters with \"comes into play\" effects, I could have forgiven them since they would have had no clue how to properly price something that could reuse those effects. But no, this thing was just a silly way to bounce your own stuff and waste mana for no reason.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:08:04 AM",
      "rating": 2
    },
    {
      "content": "Great art. Ridiculously great art.Essentially top down design as well...which just makes it even better.",
      "posted_by": "ArtosXII",
      "posted_at": "9/15/2011 7:44:08 AM",
      "rating": 0
    },
    {
      "content": "@ stygimoloch - Calm down. It's going to be OK.\nPut the gun down. It's going to be alright.",
      "posted_by": "DrJack",
      "posted_at": "8/20/2012 10:37:43 PM",
      "rating": 0
    },
    {
      "content": "Imagine getting this in your opening hand, playing it, and then staring at it for a bunch of turns before ever getting to use it. I say imagine because no one's ever actually played this thing.",
      "posted_by": "RocOfKherRidges",
      "posted_at": "3/14/2013 11:42:38 PM",
      "rating": 0
    },
    {
      "content": "Don't you hate it when a perfectly good piece of Tom Wanerstrand art goes to waste?",
      "posted_by": "The_Jabberwocky",
      "posted_at": "5/19/2013 11:52:49 AM",
      "rating": 0
    },
    {
      "content": "Heh... it kinda looks like a big... *cough*",
      "posted_by": "car2n",
      "posted_at": "10/3/2013 7:10:10 PM",
      "rating": 0
    }
  ],
  "1015": [
    {
      "content": "For the wide swath of artifact power-levels back in the day, this is surprisingly moderate; were it not for the odd anagram name, this is something that could see print today. Maybe.",
      "posted_by": "Auteur",
      "posted_at": "12/8/2009 10:55:52 PM",
      "rating": 10
    },
    {
      "content": "I like it, it's odd.",
      "posted_by": "Etregan",
      "posted_at": "1/8/2010 9:38:22 PM",
      "rating": 10
    },
    {
      "content": "Random trivia for the day: Magic lore has it that this was supposed to be 'Onulets' - an anagram of Soul Net - but the art came back showing only one creature.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 4:39:55 PM",
      "rating": 9
    },
    {
      "content": "This isn't that bad of a card, especially against players that fear life-gain...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:26:22 PM",
      "rating": 7
    },
    {
      "content": "Not that great, but still better than a Grey Ogre, so they were starting to figure things out.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:08:53 AM",
      "rating": 0
    }
  ],
  "1062": [
    {
      "content": "Dude, that's because red creatures are mostly goblins and orcs. What the hell do you want, a Goblin Genius card?",
      "posted_by": "achilleselbow",
      "posted_at": "7/23/2010 5:11:40 AM",
      "rating": 10
    },
    {
      "content": "I don't think this guy is as bad as some people say. Shocking creatures and players over and over is pretty awesome. Apart from the already mentioned stuff in other comments, solemn simulacrum is no bad sac fodder either. Play this guy on turn 3, solemn on turn 4, block some attacker, and then sac the solemn after blocking, to kill some utility creature and draw a card.Or sac spellbombs if their effect is currently not needed, and draw cards of them. Or a spine of ish sah. There are many uses, and shocking stuff is nice.2.5/5",
      "posted_by": "majinara",
      "posted_at": "3/17/2012 6:06:04 AM",
      "rating": 9
    },
    {
      "content": "At least this card didn't have an upkeep restriction...without the tap this could be excellent...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:27:46 PM",
      "rating": 8
    },
    {
      "content": "It's a horrible card, but could be ok if your deck had a way to make multiple artifacts... 1/5",
      "posted_by": "Shiduba",
      "posted_at": "8/9/2009 5:38:20 AM",
      "rating": 6
    },
    {
      "content": "One star from me, rather than 0.5 ignominy, since it can hypothetically be better than Prodigal Pyromancer in a deck with artifact creature token producers. That's still something of a reach though.Does if bother anyone else that red creatures have been portrayed as dumb and liable to fail at their one job since day one? It just reinforces the negative and pernicious stereotype that Red = Stupid. Bah.",
      "posted_by": "stygimoloch",
      "posted_at": "2/15/2009 4:45:54 PM",
      "rating": 5
    },
    {
      "content": "Use with Perilous Myr.",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 6:52:16 AM",
      "rating": 5
    },
    {
      "content": "Mostly useless, but at least you can sac an artifact in response to some other effect trying to kill it.\nOh, and yeah, I've never really like the whole \"red is stupid\" thing either. Red may be primal, angry, and likely to act before thinking, but that is not the same as being a bunch of idiots who rarely succeed at anything.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:10:45 AM",
      "rating": 1
    },
    {
      "content": "Wow, this card has some hateful comments for a comparatively useful Antiquities card.Sure it'd be better if he was a Grey Ogre stat wise, but artifact decks love sacrificing their artifact tokens for damage. I'd run this guy alongside Nuisance Engine in casual, totally.Most of the antiquities era cards would also make you sac land or tear up your own cards or something dumb, but this guy could have put on a goblin nose and joined the Krark-Clan.I'm also not sure what you're getting at saying he's dumb or bad at his job - he's a mechanic that works a catapult, it flings your artifacts at your enemies. Is Brion Stoutarm dumb because he kills the guys he throws? I actually think it's kind of neat to see a catapult in Magic where the creature is the guy manning the catapult, rather than the war-machine itself. Makes sense to me.",
      "posted_by": "Opined_Fluke",
      "posted_at": "12/11/2011 11:24:56 AM",
      "rating": 0
    },
    {
      "content": "Just had the mental image of using it with grapeshot catapult.  Effectively firing a catapult out of a catapult amuses me.",
      "posted_by": "Tommy9898",
      "posted_at": "5/29/2012 10:11:02 PM",
      "rating": 0
    },
    {
      "content": "Tommy9898, chuck in Skull CatapultCongratulations, you've managed to throw a catapult from a catapult, which is throwing a catapult which is shooting at a flying creature.You've just dealt 5 damage total for 9 mana.",
      "posted_by": "SteZiL",
      "posted_at": "8/2/2012 6:59:54 AM",
      "rating": 0
    },
    {
      "content": "I love how complicated the original wording had to be in order to basically say \"sacrifice X to do this.\"  Seriously, compare that printed text to the oracle text.",
      "posted_by": "Aquillion",
      "posted_at": "3/11/2013 12:04:27 AM",
      "rating": 0
    },
    {
      "content": "Interesting old card... my only question: what is up with that silhouette of a robed figure in the background? Frickin' sinister!Also this lil fella has gotten better with time... Don't fret the low P/T when his job is to chuck Ichor Wellsprings and Mycosynth Wellsprings!",
      "posted_by": "SeriouslyFacetious",
      "posted_at": "5/10/2014 8:34:29 PM",
      "rating": 0
    }
  ],
  "1016": [
    {
      "content": "While looking for 0 costing artifacts for my Pauper deck, I noticed that Ornithopter used to be a common. Hehehe.",
      "posted_by": "Mafoo",
      "posted_at": "6/6/2011 12:21:36 AM",
      "rating": 10
    },
    {
      "content": "Despite all the hate this card has received over the years from pro players (it costs a card and does nothing on its own), there are plenty of things one could do with it that make it worthwhile. Heck, it is a 0/2 flyer for 0. That's at least better than many cards that existed back then.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:12:06 AM",
      "rating": 10
    },
    {
      "content": "The original 0 CMC creature, and the best 0 CMC creature, It's good even if you only use it to chump-block...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:29:00 PM",
      "rating": 6
    },
    {
      "content": "FLYING PAPERCLIP!",
      "posted_by": "Forgeling",
      "posted_at": "8/25/2009 9:56:04 AM",
      "rating": 4
    },
    {
      "content": "@guest: So, with Memnite now, do you have to edit your comment?",
      "posted_by": "ultratog1028",
      "posted_at": "2/13/2011 6:40:23 PM",
      "rating": 4
    },
    {
      "content": "I like 0 drops.\nEverflowing Chalice.\nCAN'T FIGHT THE WORLDWAKE POWER!!!!!!!!",
      "posted_by": "land_comment",
      "posted_at": "3/28/2011 4:00:16 PM",
      "rating": 3
    }
  ],
  "1042": [
    {
      "content": "Master Transmuter just got owned by some mutated mogwais.",
      "posted_by": "nammertime",
      "posted_at": "12/29/2009 9:52:39 AM",
      "rating": 10
    },
    {
      "content": "Is it just me, or is that moon grinning?",
      "posted_by": "NARFNra",
      "posted_at": "11/25/2010 6:09:24 PM",
      "rating": 10
    },
    {
      "content": "At least one Gremlin will be printed in Miroodin Besieged. Its creature type will *not* be ouphe.",
      "posted_by": "garbagegatherer",
      "posted_at": "1/19/2011 1:02:27 PM",
      "rating": 10
    },
    {
      "content": "This could of been more useful if it was stronger or if it costed 1 less mana. Also this was more useful pre-6th Edition when tapping an artifact \"turned it off\"...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:30:38 PM",
      "rating": 10
    },
    {
      "content": "Gremlin's are back!",
      "posted_by": "jsttu",
      "posted_at": "3/11/2011 3:52:02 PM",
      "rating": 10
    },
    {
      "content": "Updated as Rust Tick.",
      "posted_by": "HuntingDrake",
      "posted_at": "10/9/2010 4:13:29 AM",
      "rating": 9
    },
    {
      "content": "Why does this have to be an Ouphe, it is clearly a Gremlin.  Its not like anybody is going to make an All-Ouphe deck.",
      "posted_by": "themicronaut",
      "posted_at": "9/13/2009 12:27:16 AM",
      "rating": 8
    },
    {
      "content": "Latest official Oracle updates - since the Gremlin creature type is being reintroduced with Mirrodin Besieged, this will have it's type restored to Gremlin.",
      "posted_by": "A3Kitsune",
      "posted_at": "1/26/2011 10:30:29 PM",
      "rating": 5
    },
    {
      "content": "is this black's only artifact control? jesus. sad.",
      "posted_by": "gasimakos1",
      "posted_at": "5/10/2011 1:10:06 PM",
      "rating": 0
    },
    {
      "content": "Yeah, Gremlins are back!\nThis fella is overcosted, but the idea is cool.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:13:00 AM",
      "rating": 0
    },
    {
      "content": "\"Deagle, deagledeagledeagle...\"",
      "posted_by": "Kryptnyt",
      "posted_at": "4/13/2012 5:31:14 AM",
      "rating": 0
    },
    {
      "content": "I'm hoping future Gremlins are , to make them more in-line with their personality of tinkering, tearing apart machines and putting them back together.",
      "posted_by": "Blackworm_Bloodworm",
      "posted_at": "4/7/2013 7:14:56 PM",
      "rating": 0
    },
    {
      "content": "Is it not strange that no-one has commented on these guys being the first appearance of Phyrexians in Magic?",
      "posted_by": "JovianHomarid",
      "posted_at": "9/27/2013 6:21:24 AM",
      "rating": 0
    }
  ],
  "1043": [
    {
      "content": "Feel free to call me stupid if I'm wrong, but isn't Mirari's ability a triggered one and not an activated one?",
      "posted_by": "SIlverSkyz",
      "posted_at": "7/16/2010 10:03:52 PM",
      "rating": 10
    },
    {
      "content": "This is very good with Basalt Monolithor Grim Monolith=Infinity Mana Combo",
      "posted_by": "Sveni1980",
      "posted_at": "5/22/2009 4:34:20 AM",
      "rating": 10
    },
    {
      "content": "This card has its uses, the Staff of Domination sounds like fun with this card...The Obelisk of Alara gets slightly better as well...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:33:12 PM",
      "rating": 10
    },
    {
      "content": "I do believe SliverSkyz knows what he's talking about. Everything I've seen points toward Mirari having a triggered ability, not an activated one. Perikies' trick doesn't work.",
      "posted_by": "Lateralis0ne",
      "posted_at": "7/30/2010 10:14:20 PM",
      "rating": 10
    },
    {
      "content": "@Zaneshift:  Your idea doesn't quite work, since this card states specifically that it can't lower activation costs to less than 1.  It does go very well Staff of Domination, but you don't quite get infinite life.",
      "posted_by": "Faildini",
      "posted_at": "11/29/2010 10:19:28 PM",
      "rating": 10
    },
    {
      "content": "Place on Masticore to switch from Semi to Fully Automatic.",
      "posted_by": "Pontiac",
      "posted_at": "3/24/2011 11:05:31 AM",
      "rating": 10
    },
    {
      "content": "What is particularly odd about this card was that it could generate infinite combos from the beginning with stuff like Mana Vault and Basalt Monolith. I know playtesting was very hit or miss back then, but still, one would have thought they would have noticed that. As more artifacts were printed, this card became increasingly stupid-good.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:14:35 AM",
      "rating": 10
    },
    {
      "content": "This card always makes me happy. Try it on a Staff of Domination for some real fun.",
      "posted_by": "papajew",
      "posted_at": "3/7/2009 8:15:16 PM",
      "rating": 10
    },
    {
      "content": "This card is ridiculously broken ;D",
      "posted_by": "Jenss",
      "posted_at": "8/30/2009 6:30:52 AM",
      "rating": 10
    },
    {
      "content": "Time to get this one reprinted wizards. My advice, as is, this should cost 5 mana.. So either raise it 1 (U) and 1 (C)  OR.. take 1 island away from the casting cost and give 1 less colorless mana as a reward point and make it a legendary global enchantment that can target 1 artifact/turn and rare. Yep yep, think we've got a winner there boys..",
      "posted_by": "Mike-C",
      "posted_at": "5/13/2012 5:42:04 AM",
      "rating": 7
    },
    {
      "content": "Personally, I like this on my Mirari, so that when I Twincast my Lightning Bolt, I end up with 12 points of damage, out of 5 mana, with Mirari copying BOTH spells.Goes amazingly on any non-tapping artifact with 3 or more activation costs, though.",
      "posted_by": "Perikles",
      "posted_at": "1/18/2010 5:17:11 AM",
      "rating": 2
    },
    {
      "content": "Staff of Domination makes it impossible to die from damage, since you're got yourself free untap of the staff and a tap ability for life. Add a second one, and your creatures never tap and your foe's never untap. Add a third, and you can simply play your deck. Not like you'd need more than one on the staff, but it's seriously ridiculous. Toss in a creature with a tap for mana ability... you see where this is going. Also fun, equipment shuffles (like shuffling around a pinging artifact to a bunch of weenies, or any number of tap ability equipments). Lots of interesting ideas you could use, so it deserves a 4.",
      "posted_by": "Zaneshift",
      "posted_at": "9/7/2010 5:30:30 PM",
      "rating": 1
    },
    {
      "content": "@Mikey-CI like the idea of them reprinting it, though the much higher CMC , and the proposed limitation  just seems to kill why people like the card so much, but that is just my opinion.",
      "posted_by": "Travelsonic",
      "posted_at": "7/3/2012 7:39:59 AM",
      "rating": 0
    },
    {
      "content": "These days decking an opponent with Blue Sun's Zenith is a well known win-con. I wonder if anyone used this with Basalt Monolith and Braingeyser?",
      "posted_by": "SeriouslyFacetious",
      "posted_at": "5/10/2014 8:42:23 PM",
      "rating": 0
    }
  ],
  "1055": [
    {
      "content": "This card could be useful as a sideboard tech against an artifact deck, but better options exist...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:35:54 PM",
      "rating": 10
    },
    {
      "content": "lol troll combo with mycosynth lattice.Oh you tap a land i gain 1 lifeoh you attack with your massive army of 1/1s? cool i gain so much life and since im playing a bad green deck i play fog also and just gains shitons of life.",
      "posted_by": "nope.avi",
      "posted_at": "1/3/2012 7:01:46 PM",
      "rating": 10
    },
    {
      "content": "Rod of Ruin you have met your match!",
      "posted_by": "Snafinturtle",
      "posted_at": "2/16/2011 8:58:12 PM",
      "rating": 10
    },
    {
      "content": "@Earthdawn, no, nope.avi is right - the lands still become tapped (hence the first condition for triggering).I wonder why they have to add the \"doesn't have the tap symbol\" clause. Perhaps to remove confusion if an artifact's activated ability taps it (does Powerleech trigger once or twice)?Interesting (but not outstanding) way of punishing artifacts.",
      "posted_by": "CaptainNinJoe",
      "posted_at": "4/15/2013 4:28:14 AM",
      "rating": 10
    },
    {
      "content": "Reverse Haunting Wind.Thoughtleech for artifacts instead of Islands.",
      "posted_by": "HuntingDrake",
      "posted_at": "5/21/2013 8:33:44 PM",
      "rating": 10
    },
    {
      "content": "@nopeavi, that wouldn't work.  Lands have the tap symbol, so turning them into artifacts wouldn't trigger this card at all.",
      "posted_by": "Earthdawn",
      "posted_at": "4/6/2013 11:48:02 AM",
      "rating": 2
    },
    {
      "content": "Back then, green had so few ways of handling artifacts, this card may have seen some play. Eventually, green was granted a ton of anti-artifact abilities, so this card isn't of any use today.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:16:37 AM",
      "rating": 0
    }
  ],
  "1044": [
    {
      "content": "You can reap serious profit out of Frogmite and Myr Enforcer with this guy.",
      "posted_by": "Kirbster",
      "posted_at": "6/20/2012 8:00:57 PM",
      "rating": 10
    },
    {
      "content": "\"I am a human, just like you. I have a job at the dinner factory where I make enough money to purchase textiles for my family. There is no phyrexian threat. You are to remain happy.\"",
      "posted_by": "Kryptnyt",
      "posted_at": "3/29/2011 2:51:54 PM",
      "rating": 10
    },
    {
      "content": "@DarthParallax: What do you mean it doesn't make you more mana? You have this guy in play and seven lands, so you cast Spine of Ish Sah and blow up an opponent's permanent. You tap him, sacrificing Spine of Ish Sah and getting seven mana to cast it again. You just spent 14 mana when you had only 7 available from lands. That's making mana. Manaforge Cinder filters mana, this guy makes mana every turn as long as you can sacrifice an artifact. Big difference.He's great with Glissa, the Traitor. After blockers are declared or while a destroy creature spell is on the stack that will destroy an opponents' creature, you can sacrifice an artifact such as Duplicant before Glissa's ability would trigger so that you can target it with her ability and have it in hand to cast again.",
      "posted_by": "sarroth",
      "posted_at": "4/24/2012 9:19:56 PM",
      "rating": 10
    },
    {
      "content": "A solid card that is priced appropriately and has an interesting ability. Worthy of a reprint, especially now that the Phyrexians are back.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:15:45 AM",
      "rating": 10
    },
    {
      "content": "I like to use this with Cathodion  or Su-Chi  to rack up a bunch of mana and get a big spell off.",
      "posted_by": "TreeTrunkMaster",
      "posted_at": "11/22/2009 8:51:41 PM",
      "rating": 8
    },
    {
      "content": "This+Spine of Ish Sah= awesome",
      "posted_by": "luca_barelli",
      "posted_at": "5/21/2011 7:24:15 PM",
      "rating": 8
    },
    {
      "content": "I'm surprised this never got reprinted.",
      "posted_by": "Etregan",
      "posted_at": "5/5/2010 3:27:03 AM",
      "rating": 8
    },
    {
      "content": "Oracle text FTW!",
      "posted_by": "BuffJittePLZ",
      "posted_at": "3/7/2011 5:26:59 PM",
      "rating": 8
    },
    {
      "content": "Welcome to the future, priest - we've got a new tool you may use to help us flay the weak.  \nOnce we harness the Mirrans' toy, we will be unstoppable.  \nAll will be one.",
      "posted_by": "Leshrac_Nightwalker",
      "posted_at": "3/31/2011 7:36:01 AM",
      "rating": 8
    },
    {
      "content": "This could as a different mana accelerant for an artifact deck...It's nicely costed and even is a 1/2 for 2 CMC which isn't that bad for black at the time...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:40:54 PM",
      "rating": 8
    },
    {
      "content": "Gleemax + Drain Life",
      "posted_by": "PhyrexianLobbiest",
      "posted_at": "7/22/2010 8:19:34 PM",
      "rating": 7
    },
    {
      "content": "this is what happen to an old soldevi adnate",
      "posted_by": "stormkeeper",
      "posted_at": "12/4/2008 8:37:13 PM",
      "rating": 6
    },
    {
      "content": "He Looks Like A Cyborg Freddy Kreuger",
      "posted_by": "MasterOfEtherium",
      "posted_at": "8/9/2009 12:18:12 PM",
      "rating": 4
    },
    {
      "content": "this ability is basically 'T: filter colorless mana into black mana'.Which, while not terrible, is not as cool as, say, using colored mana to ramp into more colored mana.I mean, Ritual cards are great for Storm. They actually net more mana. This doesn't really make you more mana most of the time. Or if you trick it into making mana, you're probably abusing your opponent too much.",
      "posted_by": "DarthParallax",
      "posted_at": "2/28/2012 2:45:50 PM",
      "rating": 1
    },
    {
      "content": "Coincidentally, the highest costed permanent in the game is an artifact: Draco. Cheat Draco out with Tinker or whatever, sac and you can cast Emrakul, the Aeons Torn - better than cheating it out since the enter play effect will trigger =D(There's also Gleemax but that's Un-set)",
      "posted_by": "Arachnos",
      "posted_at": "12/11/2012 9:19:24 AM",
      "rating": 0
    },
    {
      "content": "Tap: Tutor two basic lands of your choice Mycosynth Wellspringor alternately probably one of the best deals in magicTap: Draw 2 cards Ichor Wellspring",
      "posted_by": "BloodDragon",
      "posted_at": "3/11/2013 9:05:03 AM",
      "rating": 0
    },
    {
      "content": "Soldevi Adnate's great grandpappy.",
      "posted_by": "MattLynn",
      "posted_at": "3/28/2013 4:59:15 AM",
      "rating": 0
    },
    {
      "content": "Oh hey, what's up, Gleemax?",
      "posted_by": "mrchuckmorris",
      "posted_at": "3/2/2014 4:19:55 PM",
      "rating": 0
    }
  ],
  "1017": [
    {
      "content": "I'm not sure if I like this version or its counterpart Primal Plasma more...",
      "posted_by": "Lateralis0ne",
      "posted_at": "8/26/2010 2:36:01 PM",
      "rating": 10
    },
    {
      "content": "Indeed it is, and I love the artwork of this version!",
      "posted_by": "Tiggurix",
      "posted_at": "6/23/2010 10:23:19 AM",
      "rating": 10
    },
    {
      "content": "This card isn't that powerful, but it does offer a bunch of options, which was unusual for the time.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:17:30 AM",
      "rating": 10
    },
    {
      "content": "This a nice card, right on the then-current power level...It's an interesting option for deck builders to use...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:42:09 PM",
      "rating": 9
    },
    {
      "content": "Hawt.",
      "posted_by": "MagicMTG",
      "posted_at": "8/20/2010 4:54:19 PM",
      "rating": 8
    },
    {
      "content": "The power of the boobs of clay compels you...It's actually not bad. It's versatile, and was a bit above the curve back then as it does not require colored mana to cast.",
      "posted_by": "Lord_of_Tresserhorn",
      "posted_at": "9/23/2011 8:37:47 AM",
      "rating": 7
    },
    {
      "content": "I don't care how strong or weak it is, i'll take the left one.",
      "posted_by": "aznxknightz",
      "posted_at": "7/16/2011 7:16:48 PM",
      "rating": 1
    },
    {
      "content": "...and I said, \"That one on the left is the chick from Gaseous Form.\" So I checked it out and thought, \"Same last name and artwork...coincidence?\" So I looked up Phil. The two are married and Phil's major work is a porn comic, likely no better drawn than this artwork. Check this guy out http://www.scifiinc.net/scifiinc/gallery/bio/Foglio,_Kaja_and_Phil.htm Right? Poor artwork, poor in constructed, poor artist married to Phil, this card is a solid 3/5.",
      "posted_by": "Jerec_Onyx",
      "posted_at": "11/26/2012 10:25:46 PM",
      "rating": 0
    },
    {
      "content": "@Jerec_Onyx: You do realize Phil (and his wife Kaja) have much more work under the belt than just XXXenophile? Regardless of the card's artwork or playability, calling Kaja \"poor\" simply because she's married to a porn artist is simply not cricket.",
      "posted_by": "TheVizier",
      "posted_at": "10/25/2013 4:26:47 PM",
      "rating": 0
    }
  ],
  "1018": [
    {
      "content": "Before there was Razor Boomerang...",
      "posted_by": "r-e-meatyard",
      "posted_at": "6/23/2010 1:47:27 AM",
      "rating": 10
    },
    {
      "content": "Look out for this in From the Vaults: Garbage.",
      "posted_by": "Equinox523",
      "posted_at": "7/2/2013 12:38:56 PM",
      "rating": 10
    },
    {
      "content": "One of the least valuable cards in Magic TG history.  Even back in the day, this was pretty awful.  Hell, even Animate Artifact had better targets.\n.5/5",
      "posted_by": "Gaussgoat",
      "posted_at": "3/1/2010 1:14:24 PM",
      "rating": 10
    },
    {
      "content": "8 mana to prevent 1 lousy damage?oh no wait right, i underestimated the card - if you waste your sixth turn to cast this and use your seventh turn to active it for further 6 mana, you can prevent 3 incredible points of damage! way to go!",
      "posted_by": "Mode",
      "posted_at": "2/6/2010 9:34:27 AM",
      "rating": 10
    },
    {
      "content": "i missed the part of the card that says \"i'm worth 6 freaken mana\"",
      "posted_by": "thaviel",
      "posted_at": "2/10/2009 8:39:42 PM",
      "rating": 10
    },
    {
      "content": "This is just as bad as the Obelisk of Undoing...Why this needed to returned to your hand is beyond me...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:44:15 PM",
      "rating": 9
    },
    {
      "content": "OK, this is just sheer, irredeemably bad. Did the other colors really need damage reduction this badly? Not the worst card ever, but maybe the absolute dregs of this set.",
      "posted_by": "Auteur",
      "posted_at": "12/8/2009 11:02:07 PM",
      "rating": 9
    },
    {
      "content": "It's terrible...until you flip over Sasaya, Orochi Ascendant and have 100+ mana! then...its okay, but you better be winning fast with 100 mana so...",
      "posted_by": "Kurhan",
      "posted_at": "1/11/2010 8:43:30 PM",
      "rating": 8
    },
    {
      "content": "Antiquities is one of my least favorite sets; this card proves it. Henceforth, when I comment on a card, I will keep Rakalite in mind, and think, \"Well, it's better than Rakalite, at least.\"",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 6:51:32 AM",
      "rating": 6
    },
    {
      "content": "Like a reverse Rocket Launcher, but worse.",
      "posted_by": "Mata-nui3",
      "posted_at": "4/27/2011 10:45:17 PM",
      "rating": 3
    },
    {
      "content": "Terrible, even for its time. Never saw play and basically worthless.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:19:17 AM",
      "rating": 0
    },
    {
      "content": "lol \"poly artifact\" - except in the terms of the day's verbiage it was more like a \"mono artifact\" since it could  only be used one turn before leaving the board. You can activate its ability however many times you can pay for it, though.All considered, this just might be the most useless artifact printed. If it was 0-1 to cast, then maybe you might have something worth playing, even if it was more for artifact ETB trigger effects more than anything.Darksteel Relic can at least get turned into a 5/5 indestructible by Tezzeret, Agent of Bolas, be an endless \"ante\" permanent for Capricious Efreet and costs zero mana so it can be a third of a metalcraft trio right away.So, yes, this is strictly worse than an artifact that does nothing at all.",
      "posted_by": "jfre81",
      "posted_at": "1/21/2012 10:52:05 AM",
      "rating": 0
    },
    {
      "content": "Oh man.Ohhhh man.This... this is actually worse than Razor Boomerang. What the fuck...",
      "posted_by": "Continue",
      "posted_at": "11/11/2012 9:08:50 PM",
      "rating": 0
    },
    {
      "content": "Massive beats with karn, silver golem",
      "posted_by": "Kryptnyt",
      "posted_at": "5/8/2013 2:20:23 PM",
      "rating": 0
    },
    {
      "content": "@Mata-nui3It actually is like a reverse rocket launcher in the sense that playing it will increase your chance to win about as much as shooting yourself in the face with a rocket launcher.",
      "posted_by": "tankthebest",
      "posted_at": "6/19/2013 10:58:17 AM",
      "rating": 0
    }
  ],
  "1045": [
    {
      "content": "Every print of this card was missing the expansion symbol I've read. I know mine don't have it.",
      "posted_by": "TreeTrunkMaster",
      "posted_at": "5/1/2010 7:23:54 PM",
      "rating": 10
    },
    {
      "content": "There is absolutely nothing wrong with this card.",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 6:26:04 AM",
      "rating": 10
    },
    {
      "content": "Straightforeward, cheap, and useful. A good card even today.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:18:16 AM",
      "rating": 10
    },
    {
      "content": "A good old card made better by the post-Mirrodin world.  Raise Dead for artifacts, in the artifact color, and enables those things that need to be cast to work, to do so.  Also cheap, and would totally work in today's metagame.",
      "posted_by": "Equinox523",
      "posted_at": "6/22/2011 11:10:58 AM",
      "rating": 10
    },
    {
      "content": "A nice Raise Dead for artifacts, nice and cheap...This and Drafna's restoration  both cost U, Antiquities had some nice Artifact recursion available...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:47:10 PM",
      "rating": 9
    },
    {
      "content": "Good card, interesting for blue.  Any word on the missing expansion symbol?",
      "posted_by": "CCGRick",
      "posted_at": "7/24/2009 7:41:34 PM",
      "rating": 9
    },
    {
      "content": "That doesn't make any sense.",
      "posted_by": "Vorthosian",
      "posted_at": "6/26/2009 12:16:13 AM",
      "rating": 7
    },
    {
      "content": "strictly worse than firebolt.",
      "posted_by": "Hydrogoose",
      "posted_at": "3/16/2009 3:45:47 AM",
      "rating": 1
    },
    {
      "content": "I thought mine was beta.  How disappointing.",
      "posted_by": "MagicMTG",
      "posted_at": "8/5/2010 6:26:00 PM",
      "rating": 0
    },
    {
      "content": "Needs a nice core set reprint. Pretty nice little card.",
      "posted_by": "LordOfTheFlies87",
      "posted_at": "7/31/2012 8:20:58 PM",
      "rating": 0
    },
    {
      "content": "@hydrogoose, please tell me you're kidding... comparing a BURN SPELL - and one on par with shock (but with a high flashback cost) for that matter - with a spell for bringing back artifacts?",
      "posted_by": "Travelsonic",
      "posted_at": "9/13/2012 10:57:30 AM",
      "rating": 0
    }
  ],
  "1070": [
    {
      "content": "I remember losing to a guy who ran this with Time Bomb.",
      "posted_by": "mrredhatter",
      "posted_at": "10/25/2009 7:47:58 AM",
      "rating": 10
    },
    {
      "content": "i love how this has the word retroactively in its rule text.",
      "posted_by": "rinoh20",
      "posted_at": "1/1/2011 12:34:11 AM",
      "rating": 10
    },
    {
      "content": "I remember during my early years building a deck around this and Time Bomb and I actually thought that it was good.  Oh man...",
      "posted_by": "themicronaut",
      "posted_at": "9/13/2009 12:36:06 AM",
      "rating": 10
    },
    {
      "content": "I almost want to buy four of these and try to play them in a lifegain deck against Affinity or something. I'd lose, but with style.",
      "posted_by": "Auteur",
      "posted_at": "12/8/2009 11:04:02 PM",
      "rating": 10
    },
    {
      "content": "The picture is junk, and it's really old, but it could be a counter for artifact decks. If you could dredge one up from years ago.",
      "posted_by": "Elysiume",
      "posted_at": "6/10/2009 8:03:44 AM",
      "rating": 7
    },
    {
      "content": "This is slightly useful...better than Reverse Damage though...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:49:03 PM",
      "rating": 3
    },
    {
      "content": "Wow that art is hideous...",
      "posted_by": "Volcre",
      "posted_at": "10/3/2009 5:23:07 AM",
      "rating": 2
    },
    {
      "content": "Bad art on a very narrow card.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:20:01 AM",
      "rating": 1
    },
    {
      "content": "@ rinoh20: Seriously great to Armageddon with a Dingus Egg out, then Planar Birth with an Ankh Of Mishra  and gain life  all in the same round.",
      "posted_by": "Psychrates",
      "posted_at": "3/20/2013 8:53:11 AM",
      "rating": 0
    }
  ],
  "1019": [
    {
      "content": "Rocket Lawn Chair!",
      "posted_by": "Saxophonist",
      "posted_at": "6/7/2010 9:28:26 AM",
      "rating": 10
    },
    {
      "content": "*click click*RAWKET LAWNCHAIR!",
      "posted_by": "Pigfish99",
      "posted_at": "6/5/2011 5:08:21 AM",
      "rating": 10
    },
    {
      "content": "Actually, it's pretty awesome with arbitrarily large amounts of mana. Just dump 10, 20, or even 40 if you have a good mana engine, and it'll deal huge amounts of damage before it's destroyed at the end of the turn.",
      "posted_by": "Lateralis0ne",
      "posted_at": "10/10/2010 6:55:49 PM",
      "rating": 10
    },
    {
      "content": "it's a rocket launcher. 5/5",
      "posted_by": "Qoid",
      "posted_at": "2/12/2011 9:01:23 PM",
      "rating": 10
    },
    {
      "content": "@mode - Any particular reason?  This one sticks around a little longer when you choose to use it...",
      "posted_by": "Alsebra",
      "posted_at": "4/21/2011 4:19:59 AM",
      "rating": 10
    },
    {
      "content": "Hello, Goblin Cannon! Except with inexplicably modern flavor?Might be playable, in certain situations.",
      "posted_by": "Auteur",
      "posted_at": "12/9/2009 10:13:19 AM",
      "rating": 10
    },
    {
      "content": "Too overcosted to see much play...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:50:27 PM",
      "rating": 8
    },
    {
      "content": "i prefer the buffed Fifth Dawn alternative.None of them are really useful, though^^",
      "posted_by": "Mode",
      "posted_at": "2/8/2009 4:15:37 AM",
      "rating": 2
    },
    {
      "content": "Type your comment here.",
      "posted_by": "Dr_Draco",
      "posted_at": "11/5/2009 2:15:23 AM",
      "rating": 1
    },
    {
      "content": "Playable in infinite mana combo decks such as elves+staff of domination",
      "posted_by": "Crag-Hack",
      "posted_at": "6/28/2011 11:28:53 PM",
      "rating": 0
    },
    {
      "content": "Wow i didn't know one of the ninja turles used a rocket launcher!",
      "posted_by": "aznxknightz",
      "posted_at": "7/16/2011 7:06:34 PM",
      "rating": 0
    },
    {
      "content": "Mostly useful in combo decks, but even back then, granting any color the ability to pour mana into an artifact to deal damage was considered rather impressive. It hasn't aged well at all, sadly.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:21:06 AM",
      "rating": 0
    },
    {
      "content": "Looked bad at first, then I realized that there was no limit in how often you could use his effect. Mana ramp, anyone?",
      "posted_by": "Casimir_the_Great",
      "posted_at": "1/29/2014 10:55:14 AM",
      "rating": 0
    }
  ],
  "1046": [
    {
      "content": "This is one of those cards that is seriously underrated and overlooked.\nThere are a number of artifacts that are useful in some situations and harmful in other situations.  Some may become harmful suddenly.  Can you think of some examples?  When that happens... in steps the Sage to clean up the mess... with the added bonus of drawing another card.\nI love the Orcish Mechanics for this same reason.  Combine these two with low cost artifacts.  Nice for avoiding that horrible feeling of \"why did I have to draw that artifact just now instead of ...\"",
      "posted_by": "FooHunter",
      "posted_at": "12/15/2009 11:19:55 PM",
      "rating": 10
    },
    {
      "content": "Even he is pondering his own large list combo potential.",
      "posted_by": "face-fister",
      "posted_at": "5/23/2011 6:07:26 PM",
      "rating": 10
    },
    {
      "content": "Properly costed and effective even today. Lots of combo potential, of course. Worthy of reprinting in the right set.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:22:17 AM",
      "rating": 10
    },
    {
      "content": "I really want to put this guy in a deck with Spine of Ish Sah and Ichor Wellspring.",
      "posted_by": "Mister_Tapwater",
      "posted_at": "6/13/2011 6:46:09 AM",
      "rating": 10
    },
    {
      "content": "Oracle vs. printedlol",
      "posted_by": "RafiqTheMiststalker",
      "posted_at": "4/23/2010 8:46:50 AM",
      "rating": 10
    },
    {
      "content": "A great card-drawing engine...nice counterpart to the Priest of Yawgmoth...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 1:52:59 PM",
      "rating": 8
    }
  ],
  "1020": [
    {
      "content": "I'm just glad Darth Vader (in the background) had an opportunity to exist in the Magic universe. I'm also surprised to learn that he is a shapeshifter.\nAs for the card, badly overcosted by today's standards, though I love the wonky toughness (7 - *) Yeah for math!",
      "posted_by": "Radagast",
      "posted_at": "12/19/2010 6:40:14 PM",
      "rating": 10
    },
    {
      "content": "(According to the oracle text)\"Okay, at the beginning of my upkeep, I choose... 7....No, wait! I take it back!\"As for the card, I like the concept, but... As said, it's a little too costly to be very effective.Here are the options of it's stats - 1/62/53/44/35/26/1Although you have versatility, none are that great for 6 mana, even if you can change it every upkeep. I guess it could be useful when the opponent has no blockers - you could turn it into a 6/1, and when you need a wall, you could turn it into a 1/6. Cool flavor anyways, and it was probably not such a bad card back when it was printed.",
      "posted_by": "Fert12334",
      "posted_at": "1/7/2012 10:31:32 AM",
      "rating": 10
    },
    {
      "content": "An interesting card, it represents a shapeshifter quite well...however it costs too much to have much of an impact...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:13:06 PM",
      "rating": 8
    },
    {
      "content": "So... Darth Vader is the 6/1 I Guess?2/5 Stars",
      "posted_by": "Hunter06",
      "posted_at": "1/28/2014 4:25:38 PM",
      "rating": 0
    }
  ],
  "1063": [
    {
      "content": "Mirrodin Besieged has a green version of this. Well, exept for the \"can't regenerate\" bit.",
      "posted_by": "A3Kitsune",
      "posted_at": "1/20/2011 10:25:59 PM",
      "rating": 10
    },
    {
      "content": "Artifact's version of a Wrath of God...Has less of an use since it is a red card, and that the need to clear the board of Artifacts is better accomplished through other cards...Also I love how this card has been jumping between Rare and Uncommon with every printing...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:15:02 PM",
      "rating": 8
    },
    {
      "content": "Much much more than breaking a glass...",
      "posted_by": "Paolino",
      "posted_at": "1/13/2012 2:29:43 AM",
      "rating": 8
    },
    {
      "content": "This card firmly established red as the anti-artifact color, and this card is devastating even today against decks with artifacts. In Commander, it could be a sweep against certain decks.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:23:25 AM",
      "rating": 7
    },
    {
      "content": "Seems like a sideboard card at best. There will be very few scenarios where you need to destroy more than 1 artifact in order to win the game. Some decks may not have a single artifact. Obviously, this is great when there are a significant number of artifacts around, but such decks are somewhat rare.",
      "posted_by": "Burningsickle",
      "posted_at": "5/3/2014 5:07:09 AM",
      "rating": 0
    }
  ],
  "1021": [
    {
      "content": "Mono Artifacts are supposed to be tapped, thats why they added the",
      "posted_by": "bhunji42",
      "posted_at": "10/7/2009 5:43:58 AM",
      "rating": 10
    },
    {
      "content": "This card is worse then Rod of Ruin, amazing !",
      "posted_by": "True_Smog",
      "posted_at": "11/10/2009 1:18:47 AM",
      "rating": 10
    },
    {
      "content": "Now I know what Saltfield Recluse is holding.",
      "posted_by": "TDL",
      "posted_at": "4/6/2011 9:18:31 PM",
      "rating": 10
    },
    {
      "content": "I saw this and thought \"some early cards have such random abilities,\" but I bet this was designed as protection from Hypnotic Specters that all colors would have access to.  It's still overcosted, but that's the only reason I can think of for a card designer in 1993 to want to make this - other than \"that's a random effect - let's put it on a card.\"",
      "posted_by": "GainsBanding",
      "posted_at": "11/6/2010 2:56:30 AM",
      "rating": 10
    },
    {
      "content": "Underpowered for its time and just lame today.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:24:03 AM",
      "rating": 10
    },
    {
      "content": "Horn of Deafening is usually better.It's too bad you have to tap it; a repeatable version would actually be pretty cool.",
      "posted_by": "HuntingDrake",
      "posted_at": "6/15/2012 9:00:14 PM",
      "rating": 10
    },
    {
      "content": "Pretty good idea for a card.  They should redo this with a lower casting cost.",
      "posted_by": "sweetestsadist",
      "posted_at": "11/29/2008 11:27:35 PM",
      "rating": 9
    },
    {
      "content": "This card costs too much in both its activation and CMC...This is a good idea for a card though...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:16:06 PM",
      "rating": 8
    },
    {
      "content": "target creature loses -2/-0?isn't that a double negative, so it actually gains +2/+0?",
      "posted_by": "doolydooly",
      "posted_at": "12/28/2009 3:24:54 PM",
      "rating": 5
    },
    {
      "content": "More like Staff of ewwwww!",
      "posted_by": "jumpingjacked",
      "posted_at": "10/8/2009 7:56:20 AM",
      "rating": 4
    },
    {
      "content": "Lets talk about the art... this guy is a pimp",
      "posted_by": "TheWrathofShane",
      "posted_at": "4/12/2012 5:57:04 AM",
      "rating": 0
    },
    {
      "content": "Looks like a broom to me.",
      "posted_by": "Drewskithelegend",
      "posted_at": "2/11/2014 9:58:28 PM",
      "rating": 0
    }
  ],
  "1077": [
    {
      "content": "Stupidly powerful on its own, insanely broken with Life from the Loam, Crucible of Worlds, etc.",
      "posted_by": "Radagast",
      "posted_at": "12/19/2010 4:01:51 PM",
      "rating": 10
    },
    {
      "content": "The ultimate land destruction card, Wasteland is a good card but Strip Mine is broken.",
      "posted_by": "Pontiac",
      "posted_at": "4/11/2011 2:28:48 PM",
      "rating": 10
    },
    {
      "content": "Why were there four versions of the mine in Antiquities? Was it just to fill up card slots on the printing sheet? If so, Mr Gelon should have made the three pictures on the rare versions more different from each other.\nReally, this is overdoing it with the multiple versions nonsense WotC used to do.",
      "posted_by": "A3Kitsune",
      "posted_at": "8/31/2010 12:42:56 AM",
      "rating": 1
    },
    {
      "content": "So..there were 3 rare versions..and an uncommon one?What?",
      "posted_by": "yousquiddinme",
      "posted_at": "11/28/2012 3:06:38 PM",
      "rating": 0
    },
    {
      "content": "This card must suck. It dies to Strip Mine.Wait...",
      "posted_by": "BongRipper420",
      "posted_at": "12/11/2012 10:45:10 AM",
      "rating": 0
    },
    {
      "content": "Please reprint this wizards. Please return BLack Land Destruction.",
      "posted_by": "The_Evictee",
      "posted_at": "4/19/2013 11:53:33 PM",
      "rating": 0
    },
    {
      "content": "Beautiful and wonderful and I love the design so much. I know land destruction isn't \"fun\" but neither are hexproof regenerating creatures or Thragrusk or counterspells and those keep getting reprinted. Bring back land destruction!",
      "posted_by": "Jannissary",
      "posted_at": "6/12/2013 1:33:57 PM",
      "rating": 0
    },
    {
      "content": "Strip  mine = 5 stars Wasteland = 5 stars Tectonic edge = 4 stars.. goes to show the power strip on lands that kill lands over a 15 year or so period. FLASH FORWARD TO 2014.  Encroaching Wastes is what's left.",
      "posted_by": "LunarAvenger",
      "posted_at": "4/27/2014 3:00:43 AM",
      "rating": 0
    }
  ],
  "1076": [
    {
      "content": "For some of the younger kids who might not understand just how painfully mean this card can be, crucible of worlds. What, you expected to play spells this game? better have some moxes.",
      "posted_by": "PolskiSuzeren",
      "posted_at": "5/22/2010 7:50:59 AM",
      "rating": 10
    },
    {
      "content": "So good, it just embodies that aggravating element of Magic.",
      "posted_by": "themicronaut",
      "posted_at": "9/13/2009 12:37:51 AM",
      "rating": 10
    },
    {
      "content": "One of the most disruptive and annoying cards ever printed...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:18:33 PM",
      "rating": 10
    },
    {
      "content": "Just plain amazing. Play it on your first turn, and you can set your opponent back a turn. Sure, you lose a land, too, but your opponent didn't get to plan around having fewer lands. Later in the game, when you don't need mana, it can set your opponent back a bit or take out powerful nonbasic lands.",
      "posted_by": "Fanaticmogg",
      "posted_at": "2/26/2011 4:58:29 PM",
      "rating": 10
    },
    {
      "content": "I have one of this printing. I love it. The old cardness and art and FREE LAND DESTRUCTION is awesome.",
      "posted_by": "Conservator",
      "posted_at": "4/14/2013 4:47:10 AM",
      "rating": 0
    },
    {
      "content": "Please reprint this wizards. Please return BLack Land Destruction.",
      "posted_by": "The_Evictee",
      "posted_at": "4/19/2013 11:52:45 PM",
      "rating": 0
    }
  ],
  "1078": [
    {
      "content": "0/5Think about it: you and your opponent even out it the end, but at least they got one use out of the land you destroy!Just kidding, amazing card, 5/5",
      "posted_by": "marmaris74",
      "posted_at": "6/29/2011 2:39:47 PM",
      "rating": 10
    },
    {
      "content": "DERP why isn't this rated higher???",
      "posted_by": "Goatllama",
      "posted_at": "11/24/2010 6:11:25 PM",
      "rating": 10
    },
    {
      "content": "definitely a 5/5. its restricted for a good reason and it's a good idea to run one even in non-LD decks simply because everyone uses non-basic lands. uncounterable, free, combos with tons of cards... it's ridiculous.",
      "posted_by": "gasimakos1",
      "posted_at": "5/13/2011 3:52:20 PM",
      "rating": 10
    },
    {
      "content": "This isn't a 5 because? Colorless, free, non-specific LD? 5",
      "posted_by": "RafiqTheMiststalker",
      "posted_at": "4/29/2010 4:57:32 AM",
      "rating": 7
    },
    {
      "content": "Strictly worse than storm crow, I mean, you're losing a land too, right? lololololololololololololololololololololol excuse me while i go make my cephalid/aurochs hybrid tribal deck.",
      "posted_by": "Necrolysis",
      "posted_at": "1/8/2010 9:24:58 AM",
      "rating": 4
    },
    {
      "content": "Yeah, this one walked right past the playtesters. Clearly, since it is a symmetrical effect, it can't be exploited... oops! That same idea didn't work too well with other cards - Balance comes to mind. Not only is this card stupidly good, even its weaker cousins, such as Wasteland, are considered extremely good!",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:25:13 AM",
      "rating": 0
    },
    {
      "content": "Please reprint this wizards. Please return BLack Land Destruction.",
      "posted_by": "The_Evictee",
      "posted_at": "4/19/2013 11:52:16 PM",
      "rating": 0
    }
  ],
  "1079": [
    {
      "content": "Is that small tower what's left of your tolarian academy?",
      "posted_by": "LunarAvenger",
      "posted_at": "3/30/2012 3:05:41 PM",
      "rating": 10
    },
    {
      "content": "really a strange thing imagining this card existed in the same set with two different rarities.would be fun seeing that these days with two differently colored expansion symbols, and it would have an interesting effect in draft. i'd also wonder about the different values those cards would get...",
      "posted_by": "Mode",
      "posted_at": "10/15/2009 9:10:36 AM",
      "rating": 8
    },
    {
      "content": "There was no actual rares in Antiquities. Some cards were printind onece on the uncommon sheet (U1) and others thrice (U3). Now U1:s have been retroactively designated as rares.",
      "posted_by": "tavaritz",
      "posted_at": "5/2/2011 2:26:19 AM",
      "rating": 6
    },
    {
      "content": "haha, this is good. old skool land destruction deck",
      "posted_by": "maestroanth",
      "posted_at": "6/26/2009 10:44:08 PM",
      "rating": 6
    },
    {
      "content": "or",
      "posted_by": "SarcasmElemental",
      "posted_at": "9/3/2012 11:42:41 PM",
      "rating": 1
    },
    {
      "content": "Please reprint this wizards. Please return BLack Land Destruction.",
      "posted_by": "The_Evictee",
      "posted_at": "4/19/2013 11:51:40 PM",
      "rating": 1
    }
  ],
  "1022": [
    {
      "content": "Back in the day, you could just funnel mana into your Mishra's Factory to prevent mana burn, it was still good.",
      "posted_by": "Kryptnyt",
      "posted_at": "6/13/2010 2:51:26 PM",
      "rating": 10
    },
    {
      "content": "This card may just be broken if you can cheat him into play and use him as amazing mana accel",
      "posted_by": "cjgrimmreaper",
      "posted_at": "10/7/2010 12:12:41 AM",
      "rating": 10
    },
    {
      "content": "{4} for a 4/4 alone is amazing for an artifact creature during Antiquities era. The \"get {4} back\" isn't as good by itself as it looks at first glance, because it'll often die at moments where it's harder to use the mana... but with mana sinks before and no mana burn now, there's probably a few instants that'll like the extra mana and you won't get hurt. And of course, if you're planning on proactively junking your creatures, it's an amazing mana boost.",
      "posted_by": "Tanaka348",
      "posted_at": "8/5/2011 1:38:18 PM",
      "rating": 10
    },
    {
      "content": "Random thought: Use with Krark Clan Ironworks and you get 6 mana from sacing one creature. :P",
      "posted_by": "Raibys",
      "posted_at": "8/21/2011 10:33:25 PM",
      "rating": 10
    },
    {
      "content": "A fun card that lets you do all sorts of silly things. Good for its time, and today it would probably be too powerful because of potential combos. What I get a laugh out of is how thanks to mana burn, its ability was sometimes a drawback - how things have changed over the years!",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:26:28 AM",
      "rating": 10
    },
    {
      "content": "This card has gotten much better with the new rules...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:19:43 PM",
      "rating": 9
    },
    {
      "content": "It was always good, everything else just got worse. The only thing better is Cathodion because of possible first-turn mana accelerators.",
      "posted_by": "zk3",
      "posted_at": "8/21/2009 2:49:52 PM",
      "rating": 6
    },
    {
      "content": "How have i never heard of Su-Chi Hes Amazing. Str8 SUSHI 5/5",
      "posted_by": "MasterOfEtherium",
      "posted_at": "1/20/2011 11:38:29 PM",
      "rating": 5
    },
    {
      "content": "for  with Culling the Weak.",
      "posted_by": "Paolino",
      "posted_at": "3/19/2012 7:34:40 AM",
      "rating": 0
    },
    {
      "content": "right, the arguments against Wurmcoil Engine and Batterskull are now invalid. Artifacts 'supposedly' are supposed to get a worse mana curve but with every ability under the colored suns. In practice, Artifacts at Common experience a worse curve just like Any Color does at Common....But at higher Rarities (and an Uncommon Artifact Creature was about as high rarity as it got in Antiquities, Legends, The Dark, and Fallen Empires), Artifacts can break their curve just like any other color. :P Now, whether Rare creatures and artifacts being allowed to be This Good in Colorless is good or not? Well, qualitatively we can still debate that if people want, but quantitatively, busted cards have always had a precedent. :P",
      "posted_by": "DarthParallax",
      "posted_at": "10/29/2013 7:08:38 PM",
      "rating": 0
    },
    {
      "content": "Raw copies of fish from the Japan empire, the Su-shi were inherently delicious and provided Youtube wasabi videos for bored students.",
      "posted_by": "Guest392185251",
      "posted_at": "11/30/2013 11:52:59 PM",
      "rating": 0
    },
    {
      "content": "run in an agro red deck with comet storm. when he dies, it becomes a 4 damage burn spell for {R}{R} and you have the option of a kicker. you can even fling him and that's another 4 damage with the 4 floating for your comet storm.looking to pull him out of the deck? transfigure fleshwrither.I guess, play with thran dynamo too... ::shrugs:: So much Thran. (i.e. Cathodion too)also, nim deathmantle  + goblin bombardment = infinite damageyou can even add grave pact to add insult to injury",
      "posted_by": "raptorman333",
      "posted_at": "2/24/2014 3:25:49 PM",
      "rating": 0
    }
  ],
  "1023": [
    {
      "content": "Like Soul Net and the other Lucky Charms this didn't see much play...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:20:50 PM",
      "rating": 10
    },
    {
      "content": "Lol, Sage of Epityr.",
      "posted_by": "Thaxan_Number_14",
      "posted_at": "7/9/2009 7:04:47 AM",
      "rating": 10
    },
    {
      "content": "Looks like a bunch of fool's gold to me.",
      "posted_by": "themicronaut",
      "posted_at": "9/13/2009 12:39:07 AM",
      "rating": 10
    },
    {
      "content": "Um, yeah... well, Soul Net wasn't that great, and it at least had plenty of trigger opportunities. This, not so much.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:27:10 AM",
      "rating": 0
    }
  ],
  "1024": [
    {
      "content": "Something like a repeatable Oblivion Ring? A worse Prison Term? Still, not bad, gives off-colors a way to deal with huge creatures.",
      "posted_by": "Auteur",
      "posted_at": "12/9/2009 10:20:37 AM",
      "rating": 10
    },
    {
      "content": "I'm surprised an Equipment hasn't been printed which is similar to this artifact...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:21:48 PM",
      "rating": 10
    },
    {
      "content": "The best use of this artifact isn't against opponent's creatures, use it on your own creatures to save them or to get multiple uses out of \"comes into play\" effects.  A great card for multiplayer (esp Commander).",
      "posted_by": "themonkey74",
      "posted_at": "12/24/2009 1:13:19 PM",
      "rating": 10
    },
    {
      "content": "Use this to save your best creature then cast the sweeper....\nPlus it retains the enchantments and counters!",
      "posted_by": "GrimGorgonBC",
      "posted_at": "1/3/2010 11:11:13 PM",
      "rating": 10
    },
    {
      "content": "Artifact version of Oubliette.",
      "posted_by": "Tiggurix",
      "posted_at": "7/2/2010 8:47:27 AM",
      "rating": 10
    },
    {
      "content": "This card is amazing in EDH.  It removes opponent's creatures (especially cards like Iona).  It saves your own creatures from board wiping.  Its also great with \"come into play effects\".  Mulldrifter?  Draw 2 cards each turn.  Entering the battlefield with X +1/+1 counters?  Double its counters each turn!",
      "posted_by": "kitsunewarlock",
      "posted_at": "11/10/2010 10:04:16 AM",
      "rating": 10
    },
    {
      "content": "that text is longer than a stephen king novel wtf?",
      "posted_by": "MasterOfEtherium",
      "posted_at": "4/18/2011 11:07:00 PM",
      "rating": 7
    },
    {
      "content": "in the right build this card can do some serious damage, it can save your creatures from getting killed, repeats comes into play effects, takes care of your opponents large/annoying critters, and looks cool all at the same time!",
      "posted_by": "Pontiac",
      "posted_at": "3/23/2011 1:23:24 PM",
      "rating": 0
    },
    {
      "content": "A very interesting card idea, and one that I'm surprised hasn't been revisited.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:27:45 AM",
      "rating": 0
    },
    {
      "content": "Man, I forgot all about that '70s-style sci-fi block.",
      "posted_by": "RocketLobster",
      "posted_at": "5/11/2012 9:08:34 AM",
      "rating": 0
    },
    {
      "content": "Tawnos developed this coffin to put Mishra in a state of stasis because he knew Urza would not be able to deal with killing Mishra. Unfortunately, he wouldn't fit after merging with a dragon engine, so Urza had to blow up the world.",
      "posted_by": "Lazrbeams",
      "posted_at": "2/11/2014 8:48:17 PM",
      "rating": 0
    }
  ],
  "1025": [
    {
      "content": "Just use Crafty Pathmage or Goblin Tunneler",
      "posted_by": "littlebeast",
      "posted_at": "4/20/2010 1:32:19 AM",
      "rating": 10
    },
    {
      "content": "Scroll Thief makes a decent target if you can't get anything better.",
      "posted_by": "NARFNra",
      "posted_at": "11/13/2010 9:26:11 PM",
      "rating": 10
    },
    {
      "content": "Combos nicely with Hypnotic Scepter...However in all truthfulness the costs for this artifact are too high...compare with Dwarven Warriors.",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:23:06 PM",
      "rating": 9
    },
    {
      "content": "Hmm, thats oddIn the Antiquities version, it reads \"unblockable by all creatures exept artifact creatures untill end of turn\", but the Fourth Edition print and the oracle text reads that its fully unblockable.Anyways, about the card, this is pretty useless now, especially with things like Whispersilk Cloak around.Well, at least its better than Joven's Tools...1.5/5",
      "posted_by": "Fert12334",
      "posted_at": "3/28/2011 8:39:40 AM",
      "rating": 6
    },
    {
      "content": "Behold, the Blandstick!",
      "posted_by": "Kryptnyt",
      "posted_at": "4/13/2012 6:08:53 PM",
      "rating": 2
    },
    {
      "content": "Expensive for its time and totally useless today.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:28:30 AM",
      "rating": 1
    },
    {
      "content": "I don't even...2/5 Stars",
      "posted_by": "Hunter06",
      "posted_at": "12/10/2012 7:49:28 PM",
      "rating": 0
    }
  ],
  "1026": [
    {
      "content": "It would be cool to see this card once more, even if it will only be shunned.",
      "posted_by": "ElvishSpirit",
      "posted_at": "6/27/2010 11:38:42 PM",
      "rating": 10
    },
    {
      "content": "nice, proto equipment.",
      "posted_by": "whiteshadw",
      "posted_at": "12/14/2010 7:08:44 AM",
      "rating": 10
    },
    {
      "content": "A decent piece of Equipment...It's since been outclassed by the Mirrodin equipment...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:24:39 PM",
      "rating": 7
    },
    {
      "content": "Tawnos's Weaponry? I can't wait for Mishra's Defensive Gear and Ashnod's Utility Device.",
      "posted_by": "Tanaka348",
      "posted_at": "8/9/2011 2:28:40 PM",
      "rating": 0
    },
    {
      "content": "The first leonin scimitar, but mirrodin has better steel",
      "posted_by": "LunarAvenger",
      "posted_at": "1/20/2012 11:22:31 AM",
      "rating": 0
    },
    {
      "content": "\"The power of the force is in you Luke.\"",
      "posted_by": "Zinquox",
      "posted_at": "8/4/2013 3:28:12 PM",
      "rating": 0
    }
  ],
  "1027": [
    {
      "content": "I love this card, and the fact that you can separate and reconstruct it at will according to your needs...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:26:05 PM",
      "rating": 10
    },
    {
      "content": "If the Tetravus is destroyed when the Tetravites are off the card, they are not destroyed, they are just orphaned. Funny.",
      "posted_by": "SIlverSkyz",
      "posted_at": "1/26/2010 3:49:10 PM",
      "rating": 10
    },
    {
      "content": "Funny with doubling season. Comes into play as a 7/7, and you can quadruple the number of counters on it each turn, having it attack as a 25/25 flyer the turn after you play it.",
      "posted_by": "majinara",
      "posted_at": "10/9/2010 11:16:26 AM",
      "rating": 10
    },
    {
      "content": "This guy started a whole family of off-the-wall critters that can take themselves apart and put themselves back together. Pretty good for its time, too.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:29:19 AM",
      "rating": 10
    },
    {
      "content": "the progenitor of all the crazy newfangled -avuses, -ites, and -skelions.",
      "posted_by": "metalevolence",
      "posted_at": "11/18/2009 1:58:14 AM",
      "rating": 8
    },
    {
      "content": "This OR Pentavus + Mana Echoes = Infinimana! YAY, WOOT, And Stuff.",
      "posted_by": "Aigloblam",
      "posted_at": "8/21/2012 3:26:03 AM",
      "rating": 0
    },
    {
      "content": "I really appreciate the trimmed down, more simple wording of Pentavus",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/27/2012 9:39:39 AM",
      "rating": 0
    }
  ],
  "1028": [
    {
      "content": "One of the most feared cards in Magic, back in the day.  I have several of these and have fond memories of tormenting the crap out of people wih them.\nPick a discarding effect and go to work.\n5/5",
      "posted_by": "Gaussgoat",
      "posted_at": "1/21/2010 9:47:47 PM",
      "rating": 10
    },
    {
      "content": "This is a very powerful, useful card.  While the Black Vise hurts more early in the game (first turn especially), this one is harder to deal with later since it's generally harder to increase your hand size than to reduce it.  4.5/5",
      "posted_by": "kowrip",
      "posted_at": "1/22/2010 9:51:50 AM",
      "rating": 10
    },
    {
      "content": "The Black Vise is worse than this...Although it is delicious when both are in play...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:28:59 PM",
      "rating": 8
    },
    {
      "content": "No excuse for this thing being 1 mana. Absolutely. No. Excuse. This has to be the single most annoying weapon in the discard deck repertoire, and for one mana, it's the definition of overpowered.",
      "posted_by": "Treima",
      "posted_at": "5/8/2009 8:32:23 AM",
      "rating": 8
    },
    {
      "content": "a lot of damage can be done with this 1 mana trick.",
      "posted_by": "thaviel",
      "posted_at": "4/15/2009 5:41:12 PM",
      "rating": 5
    },
    {
      "content": "Excellent card to throw into any discard deck.  Force discards with Liliana's Caress in play, then when they have nothing to discard they're still taking 3 damage per Rack.  Combine with Nyxathid and Guul Draz Spectre for lots of lulz.",
      "posted_by": "TheDanish",
      "posted_at": "9/8/2010 10:08:28 PM",
      "rating": 0
    },
    {
      "content": "black vise and this one are both annoying. exactly the reason why you should maindeck disenchant, etc.",
      "posted_by": "gasimakos1",
      "posted_at": "5/13/2011 3:55:32 PM",
      "rating": 0
    },
    {
      "content": "Brutal against any high-speed deck, and nasty when combined with discard effects. Almost as good as Black Vice, though it requires more work to get the most out of it.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:30:03 AM",
      "rating": 0
    },
    {
      "content": "Not a bad card, by any means, but definitely not as good as Black Vise. This thing can't kill your opponent in two turns with a hand with 3 of them and a dark ritual. It's not really good against fast decks, because chances are they're doing more damage to you by emptying their hand really fast than you  are doing to them with this thing. Still, I could see it being a decent troll card in a free-for-all game.",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/27/2012 1:32:33 PM",
      "rating": 0
    },
    {
      "content": "\"No, Mr. Bond... I expect you to die.\"",
      "posted_by": "Kirbster",
      "posted_at": "1/24/2013 12:40:04 PM",
      "rating": 0
    }
  ],
  "1056": [
    {
      "content": "A more restrictive March of the Machines, it was an interesting tech against Moxes...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:31:41 PM",
      "rating": 10
    },
    {
      "content": "Not just against Moxes, the Song deck was pretty back in the day in combo with Wrath of God and Balance.",
      "posted_by": "themicronaut",
      "posted_at": "9/13/2009 12:51:36 AM",
      "rating": 10
    },
    {
      "content": "This card would be a great help against my friend's EDH deck. Sure, he'd probably stomp me to death with his Crucible of Worlds, but at least I wouldn't be getting double Strip Mined each turn.",
      "posted_by": "themlsna",
      "posted_at": "1/25/2011 8:32:36 AM",
      "rating": 10
    },
    {
      "content": "Strange that Animate Artifact was in blue, while this was in green.Oh wait- it removes their abilities! Huh, did not notice that at first. Pretty interesting, if not a bit strange.",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/27/2012 1:49:02 PM",
      "rating": 10
    },
    {
      "content": "Interesting that it's in green. March of the Machines is much better, even if its only because it's in blue.",
      "posted_by": "ScissorsLizard",
      "posted_at": "8/31/2011 5:00:30 PM",
      "rating": 10
    },
    {
      "content": "inb4 master of etherium ruins it",
      "posted_by": "mlanier131",
      "posted_at": "11/27/2010 11:33:21 PM",
      "rating": 4
    },
    {
      "content": "More nutty than powerful, this could create some really odd games.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:30:34 AM",
      "rating": 0
    },
    {
      "content": "@Lord Ascapelion:Black had an artifact-animator, too: Xenic Poltergeist.",
      "posted_by": "HuntingDrake",
      "posted_at": "5/21/2013 8:40:49 PM",
      "rating": 0
    }
  ],
  "1047": [
    {
      "content": "Devestating when comboed with Winter's Chill.\n \"What kind of combo is this? The cards have nothing to do with each other!\" Exactly! But look at the amount of text on these two seldom-used cards! Dear God, while your opponent's busy reading these eye-strainers, tap all his mana, flick his Blastoderm into the rafters and swipe his library. Still think this is a weak combo?",
      "posted_by": "Kirbster",
      "posted_at": "11/14/2010 1:29:06 PM",
      "rating": 10
    },
    {
      "content": "The inspiration for Tinker...although this card resembles Flash more...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:34:48 PM",
      "rating": 10
    },
    {
      "content": "Then later after having figured out Tinker was broken, it also became inspiration for Reshape.I'd have prefered to see a reprint of this card, but this might have been a bit powerful for block-constructed.",
      "posted_by": "Mode",
      "posted_at": "9/4/2009 7:41:42 AM",
      "rating": 10
    },
    {
      "content": "Great card. Artifact tutor and cost reducer. And not broken like Tinker.",
      "posted_by": "A3Kitsune",
      "posted_at": "2/7/2010 2:04:32 AM",
      "rating": 10
    },
    {
      "content": "Despite the obfuscating wording, this is actually a great card. Tinker is definitely better, but Tinker is just silly.",
      "posted_by": "Auteur",
      "posted_at": "12/9/2009 10:24:37 AM",
      "rating": 6
    },
    {
      "content": "@kibster: Toss tidal influence in there too =P",
      "posted_by": "channelblaze",
      "posted_at": "11/16/2010 7:11:11 PM",
      "rating": 1
    },
    {
      "content": "Helps you get combo's on the table that have artifacts in them.",
      "posted_by": "Pontiac",
      "posted_at": "3/24/2011 11:14:58 AM",
      "rating": 0
    },
    {
      "content": "This card wasn't considered strong enough, so Tinker was made. It was fast, easy to read, and completely broken. Oops.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:31:31 AM",
      "rating": 0
    }
  ],
  "1029": [
    {
      "content": "this card is great! And this art is just cute. I think I'll get one with this art.",
      "posted_by": "Yozuk",
      "posted_at": "1/28/2011 3:11:39 PM",
      "rating": 10
    },
    {
      "content": "Add Goblin Welder mix and repeat, even better with 2.",
      "posted_by": "Tackle74",
      "posted_at": "4/13/2010 7:50:55 PM",
      "rating": 10
    },
    {
      "content": "CLASSIC",
      "posted_by": "hid@n",
      "posted_at": "11/21/2010 7:58:06 PM",
      "rating": 10
    },
    {
      "content": "Danger! Will Robinson, Danger!",
      "posted_by": "liir007",
      "posted_at": "8/14/2009 11:42:44 PM",
      "rating": 10
    },
    {
      "content": "I just saw this version of the card for the first time, and I'm buying one just because the art is so *** awesome",
      "posted_by": "mkniffen",
      "posted_at": "1/7/2010 10:15:12 AM",
      "rating": 10
    },
    {
      "content": "There's a typo in the oracle's flavor text. It says \"ans\" it should be \"and\"",
      "posted_by": "Test-Subject_217601",
      "posted_at": "9/18/2010 10:25:27 AM",
      "rating": 9
    },
    {
      "content": "Happy robot triskelion is hilarious, especially if you put a happy-robot one right next to a mirrodin one.",
      "posted_by": "littlebeast",
      "posted_at": "1/6/2010 11:12:35 AM",
      "rating": 9
    },
    {
      "content": "This card can cause quite a few shenanigans if you can +1/+1 counters on it...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:39:03 PM",
      "rating": 8
    },
    {
      "content": "what? that illustration is awesome, it totally stands out from the generic crap on most of the newer cardsold cards like this had real art on them not some cliche mainstream computer-generated rubbish that looks like the cover of a really bad fantasy novel",
      "posted_by": "WeAreTheFury",
      "posted_at": "10/9/2009 1:50:54 PM",
      "rating": 5
    },
    {
      "content": "I definitely prefer the picture in the mirrodin version of this card. In any case this is one of my favorite artifacts ever.",
      "posted_by": "Ubertoast",
      "posted_at": "6/7/2009 3:20:45 PM",
      "rating": 5
    },
    {
      "content": "@littlebeast: well said. a wide variety of quirky styles, from anson maddocks to phil and kaja foglio, made so many of the early cards memorable. unfortunately, as well as having to believe that planewalkers can be summoned for mana, wizards also no longer trusts us to appreciate anything that requires a bit of imagination.",
      "posted_by": "mangadan",
      "posted_at": "8/5/2010 3:16:10 PM",
      "rating": 4
    },
    {
      "content": "Holy cow! easy on the grotesque imagery wotc, children play this game you know...",
      "posted_by": "HuntedWumpusMustDie",
      "posted_at": "4/15/2011 5:49:49 PM",
      "rating": 0
    },
    {
      "content": "The flavor text writer for the older printings of Trike should get an award for his efforts. What's the definition of versatile? So the flavor text essentially reads: \"The brainchild of Tawnos, the Triskelion later proved both to have or be capable of many uses and be useful.\"\nWhat a versatile use of the English language!",
      "posted_by": "scumbling1",
      "posted_at": "4/18/2011 5:45:13 PM",
      "rating": 0
    },
    {
      "content": "All's well that ends well.",
      "posted_by": "WilloftheLisp",
      "posted_at": "6/24/2011 5:48:27 PM",
      "rating": 0
    },
    {
      "content": "I like discarding +1/+1 counters.",
      "posted_by": "Tanaka348",
      "posted_at": "8/4/2011 7:05:17 PM",
      "rating": 0
    },
    {
      "content": "It lives up to the flavor text - it is versatile and packs some punch. Funny if you can do something of interest with the counters (add more, move them around, etc.)",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:32:42 AM",
      "rating": 0
    },
    {
      "content": "@scumbling1 Versatile means has many uses, however useful does not share that meaning.  In this case useful means 'capable of being put to use; especially : serviceable for an end or purpose'.  The phrase in the flavour text claims that the treskelion's uses were both many and beneficial, and leaving out either adjective would give the phrase a different de***ive character.",
      "posted_by": "whiteshadw",
      "posted_at": "11/15/2011 1:42:51 PM",
      "rating": 0
    },
    {
      "content": "This guy was so cute, I didn't mind losing to him. The person who was dating me at the time, also a Magic junkie, exploited that fact ruthlessly.",
      "posted_by": "Salient",
      "posted_at": "1/25/2012 6:55:09 PM",
      "rating": 0
    },
    {
      "content": "I'm not sure which is funnier. The horrendous art, or the fact that there's a typo in the oracle flavor text.",
      "posted_by": "DoragonShinzui",
      "posted_at": "3/27/2012 7:50:14 AM",
      "rating": 0
    },
    {
      "content": "Goes well with Mephidross Vampire.EXTERMINATE! EXTERMINATE!",
      "posted_by": "mistahmoo",
      "posted_at": "6/1/2012 3:21:22 PM",
      "rating": 0
    },
    {
      "content": "I love this card. Nowadays there's a ton of ways to break it too.",
      "posted_by": "DivineNocturnus",
      "posted_at": "8/15/2012 1:39:02 PM",
      "rating": 0
    },
    {
      "content": "Triskelion is still a great card today. When it attacks, it can deal up to seven damage in one turn. Or it can take out up to three creatures the turn it enters the battlefield. Not to mention it likes any flicker combos, or anything that adds more +1/+1 counters. I like the old much a lot.",
      "posted_by": "majinara",
      "posted_at": "10/18/2012 5:37:26 AM",
      "rating": 0
    },
    {
      "content": "\"Anyone who doesn't think Triskelion is cool should get a punch in the face\" to quote an old email MaRo received.",
      "posted_by": "Goatllama",
      "posted_at": "4/7/2013 4:09:32 PM",
      "rating": 0
    },
    {
      "content": "This is another one of those cards that lost significant power in the M10 rules change for damage, since you can no longer pop the counters off when it's about to die to combat damage and can't pop all the counters off a heavily damaged Triskelion at all.  It's still a cool card, though, since colorless artifact damage is useful to a wide variety of decks.",
      "posted_by": "Aquillion",
      "posted_at": "6/2/2013 12:36:31 PM",
      "rating": 0
    },
    {
      "content": "Goes great with venser, the sojourner, which is weird, you wouldn't expect the daleks to have so much synergy with the doctor.",
      "posted_by": "Lazrbeams",
      "posted_at": "3/30/2014 1:27:16 PM",
      "rating": 0
    }
  ],
  "1030": [
    {
      "content": "@Tommy,Actually, you'll notice that old creatures costs are generally set according to a few easily discerned principles: 1) it it's P/T is X/X, its CMC starts at X; 2) if it's P/T is X/Y, then it costs the maximum of X or Y (they trust you to be smart enough to cast a 1/8 when you need a blocker, an 8/1 when you're trying to swing for lethal); 3) if it's an artifact, it can go into any deck, so {2} is used anywhere you would normally used C to balance it out; 4) an evergreen mechanic MAY cost {1}, and increases the rarity if the ability is off-color.In a colored card, this 4/4 would start at {3}C, then cost {1} more for the ability. As an artifact, it costs {2} instead of C for a grand total of {6}.",
      "posted_by": "longwinded",
      "posted_at": "12/29/2011 4:01:29 PM",
      "rating": 10
    },
    {
      "content": "They were afraid of  creatures being too powerful when they first made the game, so they had big mana costs to make sure.  They never thought much of spells however; Time walk, balance etc.Anyway this guy was always a nice beatstick in Shandalar, especially with good boosting enchantments.",
      "posted_by": "Tommy9898",
      "posted_at": "6/3/2010 7:08:03 PM",
      "rating": 10
    },
    {
      "content": "\"back then they were trying to make Mishra's Workshop balanced by making big artifacts bad.\nThis was a two drop back then.\"\nNot really. They were printing equally-overcosted non-artifact creatures at that time; it had nothing to do with Workshop specifically.",
      "posted_by": "scumbling1",
      "posted_at": "3/21/2011 3:21:24 PM",
      "rating": 10
    },
    {
      "content": "Underpowered for its cost, and yet still better than Mishra's War Machine. I guess that Urza's poor critters were just a little better than Mishra's, hence his victory.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:33:48 AM",
      "rating": 10
    },
    {
      "content": "All of the old artifacts are overcosted...EXCLUDING sol ring and lotus",
      "posted_by": "jugglingguy",
      "posted_at": "11/24/2009 7:41:13 PM",
      "rating": 8
    },
    {
      "content": "This should of costed 1 mana less...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:40:15 PM",
      "rating": 7
    },
    {
      "content": "Lol, Jodah's Avenger.",
      "posted_by": "Thaxan_Number_14",
      "posted_at": "7/9/2009 7:03:34 AM",
      "rating": 7
    },
    {
      "content": "back then they were trying to make Mishra's Workshop balanced by making big artifacts bad.This was a two drop back then.",
      "posted_by": "Kryptnyt",
      "posted_at": "3/14/2011 3:25:06 AM",
      "rating": 6
    },
    {
      "content": "It's interesting how keywords affect design. Banding is a far more complicated ability than e.g. vigilance, but it was keyworded back then (one of the original 7!) and vigilance was not.",
      "posted_by": "HuntingDrake",
      "posted_at": "4/29/2012 12:39:48 AM",
      "rating": 0
    },
    {
      "content": "If this was Urza's first attempt at revenge for his brother Mishra, it is not surprising that he was so badly beaten back by the denizens of Phyrexia.  Not that this creature isn't formidable in certain situations but it follows that a creature like this would get eaten alive by creatures like Phyrexian Colossus and Phyrexian Dreadnought.  I could see this thing eating a Phyrexian Walker for lunch though, even though that's the equivalent of a grasshopper in Phyrexia.",
      "posted_by": "R1p_v4n_54u3r",
      "posted_at": "12/18/2013 12:40:46 PM",
      "rating": 0
    }
  ],
  "1031": [
    {
      "content": "I'm amused at how literally the flavor text is matched up with the effect. In order to heal himself, Urza takes his chalice into workshops where other people are making artifacts, apparently so he could start triggering chances to pay {1}.",
      "posted_by": "Tanaka348",
      "posted_at": "8/9/2011 2:03:31 PM",
      "rating": 10
    },
    {
      "content": "The artifact Lucky Charm, quite unplayable...especially since very few decks can really make use of this...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:46:53 PM",
      "rating": 9
    },
    {
      "content": "Could have done without an activation cost. A deck that plays enough artifacts for you to get any significant benefit from this (Affinity?) is probably too strong to merit playing around with something like this.",
      "posted_by": "Auteur",
      "posted_at": "8/23/2010 12:24:01 AM",
      "rating": 7
    },
    {
      "content": "All of the Lucky Charms were poor even for thier time, but I can't blame them for creating the logical artifact version of them.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:34:45 AM",
      "rating": 7
    },
    {
      "content": "Im not sure why this has such a low rating, its really balanced and if you are playing artifacts you can give yourself a nice life buffer.",
      "posted_by": "niallcmurray86",
      "posted_at": "8/1/2010 2:47:35 PM",
      "rating": 6
    },
    {
      "content": "Just awful. But obviously made total sense for them to make it.",
      "posted_by": "Baconradar",
      "posted_at": "11/24/2011 4:31:33 PM",
      "rating": 6
    },
    {
      "content": "Golem's Heart",
      "posted_by": "use643",
      "posted_at": "11/27/2011 5:18:36 PM",
      "rating": 0
    },
    {
      "content": "@Tanaka348: if you put it like that... maybe they should have named it Urza's Drinking Game instead.",
      "posted_by": "Haywood",
      "posted_at": "9/13/2013 11:58:27 AM",
      "rating": 0
    },
    {
      "content": "Anyone else remember the scene in Trailer Park Boys where Ray correctly deduces that Mr Leahy has been secretly drinking at all times?Tawnos:  \"It's vodka, Mr. Urza!!\"Urza: \"165 proof, buds, straight up. I'm wasted!\"",
      "posted_by": "SeriouslyFacetious",
      "posted_at": "2/10/2014 9:47:17 PM",
      "rating": 0
    }
  ],
  "1083": [
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:17:51 AM",
      "rating": 4
    },
    {
      "content": "Interesting shapes, those 'mines'.\nWonder what they were getting at.",
      "posted_by": "Baconradar",
      "posted_at": "10/20/2011 8:17:40 AM",
      "rating": 0
    }
  ],
  "1080": [
    {
      "content": "BATHYSPHERE MINE!",
      "posted_by": "littlebeast",
      "posted_at": "12/8/2009 11:39:26 PM",
      "rating": 10
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:18:05 AM",
      "rating": 4
    },
    {
      "content": "Blah blah buy the expensive cycle. Blah blah no thanks.",
      "posted_by": "land_comment",
      "posted_at": "3/8/2011 11:24:46 AM",
      "rating": 1
    },
    {
      "content": "It'd be a bit crazy if there were more cities than mines, no?",
      "posted_by": "djflo",
      "posted_at": "4/27/2011 7:43:16 AM",
      "rating": 0
    },
    {
      "content": "WE NEED TO MINE DEEPER!",
      "posted_by": "Lord_of_Tresserhorn",
      "posted_at": "3/13/2012 4:28:23 PM",
      "rating": 0
    }
  ],
  "1082": [
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:18:21 AM",
      "rating": 4
    },
    {
      "content": "Urza's MINE!",
      "posted_by": "Kirbster",
      "posted_at": "6/24/2012 7:00:27 PM",
      "rating": 0
    }
  ],
  "1081": [
    {
      "content": "OM NOM NOM",
      "posted_by": "Demage",
      "posted_at": "6/20/2011 8:45:22 AM",
      "rating": 10
    },
    {
      "content": "Too... much.... innuendo.",
      "posted_by": "MagicMTG",
      "posted_at": "8/26/2010 8:05:40 PM",
      "rating": 7
    },
    {
      "content": "Urza's... Howling Mine?",
      "posted_by": "Mata-nui3",
      "posted_at": "2/12/2011 6:48:36 PM",
      "rating": 7
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:18:36 AM",
      "rating": 5
    },
    {
      "content": "Budha?",
      "posted_by": "MasterOfEtherium",
      "posted_at": "6/1/2009 9:40:35 PM",
      "rating": 4
    },
    {
      "content": "I hear he gives great head.",
      "posted_by": "Pontiac",
      "posted_at": "3/24/2011 11:24:53 AM",
      "rating": 1
    },
    {
      "content": "eeh rather have cloudpost vesuvas and glimmerposts instead of thisstill 4.5/5 for being iconic land",
      "posted_by": "nope.avi",
      "posted_at": "10/19/2011 11:03:27 AM",
      "rating": 0
    }
  ],
  "1032": [
    {
      "content": "In case any of you were wondering, Urza is the Pope.",
      "posted_by": "spectermonger",
      "posted_at": "4/6/2010 7:36:21 PM",
      "rating": 10
    },
    {
      "content": "It's funny to picture Urza wearing this. Especially when he was just a head.",
      "posted_by": "Kirbster",
      "posted_at": "12/3/2010 6:12:19 PM",
      "rating": 10
    },
    {
      "content": "Great picture... but that is about it.  Hyper bonus points if you deploy it with this guy in the Battlefield:\nFarrelite Priest",
      "posted_by": "Gaussgoat",
      "posted_at": "12/29/2009 12:30:39 PM",
      "rating": 10
    },
    {
      "content": "Sorry did I read the painter was Randy Asplund-Faith  ?   and he drew Urza's miter ?",
      "posted_by": "Teotanek",
      "posted_at": "3/20/2010 1:35:07 AM",
      "rating": 10
    },
    {
      "content": "Extra points for being a pope hat.",
      "posted_by": "ScissorsLizard",
      "posted_at": "10/23/2009 2:38:58 PM",
      "rating": 10
    },
    {
      "content": "Pope Hat!",
      "posted_by": "themicronaut",
      "posted_at": "9/13/2009 12:58:18 AM",
      "rating": 10
    },
    {
      "content": "The hell? Why did Urza make a pope hat? XD",
      "posted_by": "izzet_guild_mage",
      "posted_at": "5/6/2010 11:46:59 AM",
      "rating": 10
    },
    {
      "content": "They probably thought it would be too strong if you could sacrifice an artifact for an effect and draw a card when it hits the graveyard.  But it already costs 3 mana to get the draw and you can only do it once per artifact - that's limitation enough.  It was 1993, they didn't know any better.",
      "posted_by": "GainsBanding",
      "posted_at": "8/30/2009 10:28:09 PM",
      "rating": 9
    },
    {
      "content": "I would love to know why you can't trigger this off an artifact you've sacrificed???",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:53:41 PM",
      "rating": 7
    },
    {
      "content": "Rats of Rath is the only way I can think of to use this for card drawing.",
      "posted_by": "Kryptnyt",
      "posted_at": "5/16/2011 4:11:05 PM",
      "rating": 0
    },
    {
      "content": "It's a good thing Urza's Ornithopter took off. If not, we'd have the Miter and Urza would be a Fashionista instead of an artificer.",
      "posted_by": "Satuu",
      "posted_at": "6/19/2011 5:01:19 PM",
      "rating": 0
    },
    {
      "content": "Strange card, both in mechanics and flavor. Rather weak, too.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:35:51 AM",
      "rating": 0
    },
    {
      "content": "Does a planeswalker wear a funny hat?",
      "posted_by": "car2n",
      "posted_at": "2/19/2014 1:02:32 PM",
      "rating": 0
    }
  ],
  "1085": [
    {
      "content": "THE FLOOR IS LAVA!\nTHE CEILING IS LAVA!",
      "posted_by": "Lord_of_Tresserhorn",
      "posted_at": "3/13/2012 4:26:11 PM",
      "rating": 10
    },
    {
      "content": "Urza must get his machine designs from Willy Wonka.",
      "posted_by": "Mr.Wimples",
      "posted_at": "9/9/2011 8:29:43 AM",
      "rating": 10
    },
    {
      "content": "We used to call this version \"Urza's Slurpee Machine\", for obvious reasons.",
      "posted_by": "UrzasSlurpeeMachine",
      "posted_at": "8/15/2012 11:05:33 PM",
      "rating": 10
    },
    {
      "content": "this shit looks like something out of total recall",
      "posted_by": "gasimakos1",
      "posted_at": "8/31/2009 12:56:05 AM",
      "rating": 5
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:21:08 AM",
      "rating": 5
    },
    {
      "content": "wait, mass gets censored but shit doesn't? Wait to go gatherer.",
      "posted_by": "allmighty_abacus",
      "posted_at": "12/22/2009 4:57:17 PM",
      "rating": 0
    }
  ],
  "1084": [
    {
      "content": "It's like the Matrix! :O\nExcept with Lightning bugs!\n@bookguy: These uncommons are C1, printed once on the common sheet. They are the same numerical rarity as U3 cards. U1 are called \"rare\", and commons are at least C2.",
      "posted_by": "Lord_of_Tresserhorn",
      "posted_at": "3/13/2012 4:27:25 PM",
      "rating": 10
    },
    {
      "content": "I think this is my favorite Urza's Power Plant. Did you know that giant, magical fireflies are a cheap, green, renewable and humane source of energy? (Seriously, that firefly doesn't even care that you strapped electrodes to his ass. Heck, he probably likes it!)",
      "posted_by": "Lord_Ascapelion",
      "posted_at": "11/27/2012 3:32:44 PM",
      "rating": 10
    },
    {
      "content": "wtf are they doing to that bug?",
      "posted_by": "gasimakos1",
      "posted_at": "8/31/2009 12:56:20 AM",
      "rating": 10
    },
    {
      "content": "It's a giant, magical lightning bug. I think the machine is extracting energy from it whenever it tries to light up.",
      "posted_by": "Talcos",
      "posted_at": "7/21/2010 6:05:54 AM",
      "rating": 9
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.\n.......What the bug is doing here, I have no ****ing clue.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:21:44 AM",
      "rating": 8
    },
    {
      "content": "Hot.",
      "posted_by": "izzet_guild_mage",
      "posted_at": "2/15/2010 12:02:47 AM",
      "rating": 2
    },
    {
      "content": "Uh, why is this uncommon? Especially where it is also printed at common in the same set?",
      "posted_by": "bookguy",
      "posted_at": "10/16/2011 4:20:06 PM",
      "rating": 0
    },
    {
      "content": "I'm guessing this is some gigantic firefly that Urza taps into to extract power. Why this wasn't expanded on or featured again, we will never know.",
      "posted_by": "Trygon_Predator",
      "posted_at": "5/6/2012 3:33:52 PM",
      "rating": 0
    }
  ],
  "1086": [
    {
      "content": "Urzatron- Instant 5 in my book.",
      "posted_by": "RafiqTheMiststalker",
      "posted_at": "5/10/2010 6:41:41 PM",
      "rating": 10
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:22:08 AM",
      "rating": 5
    },
    {
      "content": "these are always great.... assuming you have all three...",
      "posted_by": "Burningsickle",
      "posted_at": "12/24/2013 8:06:13 AM",
      "rating": 0
    }
  ],
  "1087": [
    {
      "content": "the boiling turd- my favorite Urza's artwork. Grats mark tedin.",
      "posted_by": "Kryptnyt",
      "posted_at": "2/13/2010 2:57:06 PM",
      "rating": 8
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:22:24 AM",
      "rating": 4
    },
    {
      "content": "There's a piece of coal chilling in a jacuzzi.\nYour argument is invalid.",
      "posted_by": "Lord_of_Tresserhorn",
      "posted_at": "3/13/2012 4:24:40 PM",
      "rating": 0
    },
    {
      "content": "Is that a Fellwar Stone?",
      "posted_by": "JovianHomarid",
      "posted_at": "7/31/2013 1:34:53 AM",
      "rating": 0
    }
  ],
  "1088": [
    {
      "content": "I don't know what the actual rarities were, but you have to consider that expansion symbols weren't colored by rarity back in antiquities. The coloration didn't happen until Exodus, I think.",
      "posted_by": "atreusmonk",
      "posted_at": "10/27/2009 1:36:48 PM",
      "rating": 10
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:26:17 AM",
      "rating": 5
    },
    {
      "content": "How come there is no ruling saying that you have to take the three mana if you have all set in play. Such ruling is on Mines and Power Plants.",
      "posted_by": "tavaritz",
      "posted_at": "5/2/2011 2:40:54 AM",
      "rating": 0
    },
    {
      "content": "Comment deleted due to brainfart.",
      "posted_by": "willpell",
      "posted_at": "5/12/2011 8:11:31 PM",
      "rating": 0
    }
  ],
  "1091": [
    {
      "content": "Urza's Tropical Island Tower. As seen on 'Cribs'.",
      "posted_by": "A3Kitsune",
      "posted_at": "7/28/2010 1:05:38 AM",
      "rating": 10
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:26:32 AM",
      "rating": 5
    },
    {
      "content": "combo with storm crow",
      "posted_by": "CharnelhoardWurm",
      "posted_at": "7/31/2010 7:19:26 PM",
      "rating": 5
    }
  ],
  "1090": [
    {
      "content": "Apparently this one is worse, because it's listed as common rather than uncommon. =p",
      "posted_by": "Magnor_Criol",
      "posted_at": "1/31/2011 3:47:30 PM",
      "rating": 10
    },
    {
      "content": "Urza must like that design, just about every other tower he built is just like this.",
      "posted_by": "A3Kitsune",
      "posted_at": "7/28/2010 1:07:59 AM",
      "rating": 10
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:26:48 AM",
      "rating": 4
    }
  ],
  "1089": [
    {
      "content": "Classic.",
      "posted_by": "A3Kitsune",
      "posted_at": "7/28/2010 1:10:01 AM",
      "rating": 10
    },
    {
      "content": "The Urza lands have become iconic in their mass-mana abilities. Whether it's Blaze or artifacts or, well, anything, they are loved and hated by many.",
      "posted_by": "Weretarrasque",
      "posted_at": "10/22/2009 7:27:02 AM",
      "rating": 7
    },
    {
      "content": "Definatly not a 5 star land... They are good, but the fact that you need all 3 out for any benifit means that its pretty unlikely that you will get it going early, when that mana will count for most. However, definatly still good, and definatly still classic.",
      "posted_by": "Ancient_Mossdog",
      "posted_at": "5/13/2011 8:08:48 PM",
      "rating": 5
    },
    {
      "content": "Non-Legendary lands that work together to produce 3cmc per land.  I remember when I got these as a kid out of a .10 bin.  Still not worth much, but such good lands.",
      "posted_by": "Dragon23",
      "posted_at": "12/4/2010 5:46:35 PM",
      "rating": 0
    },
    {
      "content": "Hey, I had ivory tower and then hit random card.",
      "posted_by": "land_comment",
      "posted_at": "2/25/2011 12:17:20 PM",
      "rating": 0
    },
    {
      "content": "Why has no one mentioned HOW BEAUTIFUL THIS ART IS?OH MY GOSH I love it. Also of any printing of any of the Urza lands, this one is the most expensive.",
      "posted_by": "Conservator",
      "posted_at": "9/26/2013 4:51:58 PM",
      "rating": 0
    }
  ],
  "1033": [
    {
      "content": "Decent for its time since any color could use it, though a strong argument could be made that this was almost flat-out inferior to Yotian Soldier. Same casting cost, about the same stats, and both had an ability, but this one can't attack.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:40:29 AM",
      "rating": 10
    },
    {
      "content": "Yeah, this wall is average at best, especially if you put up its standard as ALL TIME.  Wall of Denial, Sentinel, Vent Sentinel, Wall of Frost, Guard Gomazoa, Wall of Blossoms and sssoooooo many more. This is a really sad wall.",
      "posted_by": "alucard311",
      "posted_at": "1/16/2011 10:41:53 AM",
      "rating": 10
    },
    {
      "content": "Wasn't this in Indiana Jones somewhere? Lame jokes aside... there are better walls.",
      "posted_by": "Trygon_Predator",
      "posted_at": "5/6/2012 3:32:42 PM",
      "rating": 10
    },
    {
      "content": "That's why you'll only ever be a Guest.",
      "posted_by": "Kirbster",
      "posted_at": "1/9/2011 3:38:20 PM",
      "rating": 7
    },
    {
      "content": "2/3 for 3 cmc is pitiful for wall.First strike is great against Ball Lightning and other RDW staples but really Deft Duelist do better job of defending than this guy2/5",
      "posted_by": "Hoonster",
      "posted_at": "3/4/2011 5:19:10 PM",
      "rating": 6
    },
    {
      "content": "One of the Best Walls of All-time, I have used this time and time again in my decks...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:55:14 PM",
      "rating": 4
    },
    {
      "content": "Little known fact about the battle of Sarinth: The Craw Wurms were running a fever.",
      "posted_by": "SarcasmElemental",
      "posted_at": "8/24/2012 5:32:29 PM",
      "rating": 0
    },
    {
      "content": "bah.",
      "posted_by": "O0oze",
      "posted_at": "7/10/2013 9:28:00 AM",
      "rating": 0
    },
    {
      "content": "The sad part about the flavor text is that Craw Wurm has 4 toughness.",
      "posted_by": "NARFNra",
      "posted_at": "7/25/2013 1:51:08 PM",
      "rating": 0
    },
    {
      "content": "Boys, clearly one of the Pikemen the flavour text refers to was enchanted with Holy Strength!Also, if you really wanna nitpick -- Craw Wurms don't have Rampage!!",
      "posted_by": "SeriouslyFacetious",
      "posted_at": "2/10/2014 9:25:54 PM",
      "rating": 0
    }
  ],
  "1034": [
    {
      "content": "what's the creature on it? it looks like a mix between an atog and a dog.\nan Adog?",
      "posted_by": "ultratog1028",
      "posted_at": "12/11/2009 1:26:21 PM",
      "rating": 10
    },
    {
      "content": "What was once a crocodile is now a naked mole rat.",
      "posted_by": "Zulp",
      "posted_at": "1/6/2010 2:29:48 PM",
      "rating": 10
    },
    {
      "content": "Legendary artifact that is not legendary... Yaaay...",
      "posted_by": "Kyuuketsukiou",
      "posted_at": "9/7/2010 4:45:29 AM",
      "rating": 10
    },
    {
      "content": "Weakstone is weaksauce..",
      "posted_by": "Blackworm_Bloodworm",
      "posted_at": "12/17/2010 6:20:28 AM",
      "rating": 10
    },
    {
      "content": "If they reinstate the second ability it would work well against  \tDoran, the Siege Tower as well.",
      "posted_by": "bhunji42",
      "posted_at": "9/15/2009 10:57:00 AM",
      "rating": 10
    },
    {
      "content": "Interesting artifact concerning the story between Urza and Mishra.But unfortunately, unlike the Meekstone, this one isn't really that playable.",
      "posted_by": "Mode",
      "posted_at": "3/4/2009 6:02:26 AM",
      "rating": 9
    },
    {
      "content": "At first read it seems funny to put the phrase \"Creatures with power less than 1 deal no damage.\" on the card. Perhaps it was intended to just affect attacking creatures or it was some kind of reminder text (and Oracle deleted the ability entirely!), but when you think about it, there would still be some narrow use to it, see Suq'Ata Firewalker, Cinder Pyromancer.",
      "posted_by": "holgir",
      "posted_at": "9/1/2009 6:03:17 AM",
      "rating": 9
    },
    {
      "content": "Yeah, it needed to be costed less to be effective...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 2:56:18 PM",
      "rating": 8
    },
    {
      "content": "this deserves more than its current rating, just because of the text... its like durrrr ofcourse creatures with power less than 1 dont deal damage.. 1-1=0",
      "posted_by": "NigelB",
      "posted_at": "5/25/2011 11:02:11 AM",
      "rating": 4
    },
    {
      "content": "Well, hoses a bunch on UN-creatures. Anything with 1 1/2 power or less. 1/2 is less than 1.",
      "posted_by": "OmegaSerris",
      "posted_at": "7/25/2011 11:58:13 PM",
      "rating": 0
    },
    {
      "content": "Considering how powerful the Mightstone and Weakstone were in the fiction, this thing is just sad.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:36:14 AM",
      "rating": 0
    },
    {
      "content": "I'm glad the card's original text told me that creatures with 0 power won't do any damage. I couldn't have figured that out on my own.I'm just sad they didn't also explain how to subtract one from a number. That one I had to look up on the Internet. :(",
      "posted_by": "Salient",
      "posted_at": "1/28/2012 5:14:43 PM",
      "rating": 0
    },
    {
      "content": "STIIIMPY! YOU IDIOOOT!",
      "posted_by": "Kryptnyt",
      "posted_at": "6/21/2012 3:51:40 PM",
      "rating": 0
    },
    {
      "content": "Doesn't the Oracle text not match the printed text at all?\"All attacking creatures lose -1/-0\" - I can only assume that losing a negative number means that you should add it, and attacking creatures should get +1/+0.\"Creatures with power less than 1 deal no damage\" - doesn't say combat damage, so this shouldn't be assumed to be reminder text.  Creatures with 0 power shouldn't be able to deal non-combat damage either.",
      "posted_by": "deggdegg",
      "posted_at": "4/10/2013 12:35:01 PM",
      "rating": 0
    },
    {
      "content": "good against cunning lethemancer.",
      "posted_by": "O0oze",
      "posted_at": "12/23/2013 11:55:27 AM",
      "rating": 0
    },
    {
      "content": "Phyrexian chihuahua.",
      "posted_by": "car2n",
      "posted_at": "5/26/2014 12:14:03 AM",
      "rating": 0
    }
  ],
  "1048": [
    {
      "content": "\"transformation\"... lol",
      "posted_by": "Androx",
      "posted_at": "2/16/2011 10:13:11 AM",
      "rating": 10
    },
    {
      "content": "Hmmm Liquimetal Coating, go away you pesky enchantments (and lands) go away!",
      "posted_by": "Toverkol",
      "posted_at": "9/4/2011 12:57:47 PM",
      "rating": 10
    },
    {
      "content": "I kill your Darksteel Relic, I kill it dead.",
      "posted_by": "BonniePrinceCharlie",
      "posted_at": "5/1/2011 6:37:39 AM",
      "rating": 10
    },
    {
      "content": "This combos with opponent's moxes!",
      "posted_by": "Paolino",
      "posted_at": "1/25/2012 7:38:41 AM",
      "rating": 10
    },
    {
      "content": "Darksteel Ingot becomes a 3/3 indestructible beater.  This is actually quite a playable card from Antiquities with a ton of fun applications.",
      "posted_by": "Equinox523",
      "posted_at": "2/14/2013 9:00:09 AM",
      "rating": 10
    },
    {
      "content": "While it is technically out of flavor for black, I have to give them credit for finding an interesting way to make it work.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:37:05 AM",
      "rating": 9
    },
    {
      "content": "Anything that makes a non-creature into a cost p/t is worth looking at, not a bad card.  Good for black keeper of the pit decks.",
      "posted_by": "Bibblesbun",
      "posted_at": "1/22/2009 3:23:24 PM",
      "rating": 8
    },
    {
      "content": "Um, you can Bibblesbun. Just re-tap it in your upkeep before the revert ability resolves.",
      "posted_by": "psyklone",
      "posted_at": "1/7/2010 1:39:02 PM",
      "rating": 6
    },
    {
      "content": "This card breaks the color pie, but in a fun way.",
      "posted_by": "kashonismw",
      "posted_at": "10/16/2011 10:49:40 AM",
      "rating": 6
    },
    {
      "content": "They should of given the option to keep this card tapped...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 3:06:53 PM",
      "rating": 4
    }
  ],
  "1049": [
    {
      "content": "While this monster was hard to kept fed and would turn on you badly, he was very difficult to stop in his day. 6/6 flying with first-strike was a sure kill against anything short of  Pit Lord, which (ironcally) was also extremely hard to control. The Demon has aged very poorly, of course, but it was at one time a very serious threat.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:39:21 AM",
      "rating": 10
    },
    {
      "content": "I love this card.He doesn't hurt hard when hungry (compared to Lord of the Pit), and is decent size for cost.I might like him so much because I had a play set when Mirrodin first came out, so between Myr Retriever, Disciple of the Vault and Nuisance Engine he became very nasty indead.4/5.",
      "posted_by": "Sharu",
      "posted_at": "3/24/2012 10:51:50 PM",
      "rating": 10
    },
    {
      "content": "all you really need is a way to untap him. forget sacrificing. two life a turn is nothing when you're already packing ivory tower, drain life, and dark rituals to back up your necropotence.",
      "posted_by": "gandalfffuuu",
      "posted_at": "8/13/2012 8:44:23 AM",
      "rating": 10
    },
    {
      "content": "I think Pinchers are not artifacts even though they are ccolorless. Try The Hive.",
      "posted_by": "tavaritz",
      "posted_at": "4/30/2011 12:22:57 PM",
      "rating": 8
    },
    {
      "content": "This used quite the beast, a 6/6 for 6 with a drawback that's somewhat easily managed...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 3:10:22 PM",
      "rating": 7
    },
    {
      "content": "he's decent",
      "posted_by": "gasimakos1",
      "posted_at": "6/5/2011 3:17:20 PM",
      "rating": 7
    },
    {
      "content": "There are better creatures for 4BB.  The drawback is hard to manage unless you got an artifact heavy deck.  Would be a lot better if instead of first strike it had haste, at least then you could swing for 6 before having to sac.  3/5",
      "posted_by": "ropebreezy",
      "posted_at": "3/17/2010 9:36:59 PM",
      "rating": 6
    },
    {
      "content": "This card has new synergy in Esper black, with cards like Salvage Slasher and Sludge Strider. I like it, even if the original art was a little lacking.",
      "posted_by": "Weretarrasque",
      "posted_at": "9/25/2009 7:52:01 AM",
      "rating": 5
    },
    {
      "content": "While pricey, Summoning Station can make his last effect hurt less. Though you will have to wait one turn before sacking them.",
      "posted_by": "John-Bender",
      "posted_at": "4/9/2010 3:14:28 PM",
      "rating": 1
    },
    {
      "content": "He's right, Pinchers aren't artifacts.",
      "posted_by": "NeoKoda",
      "posted_at": "9/4/2011 8:17:46 PM",
      "rating": 0
    },
    {
      "content": "can somebody tell me why he looks like a rasta mon?",
      "posted_by": "luca_barelli",
      "posted_at": "11/26/2011 11:05:54 AM",
      "rating": 0
    }
  ],
  "1035": [
    {
      "content": "A great creature for it's time, saw a lot play in Stasis builds...",
      "posted_by": "Guest57443454",
      "posted_at": "7/2/2009 3:10:58 PM",
      "rating": 10
    },
    {
      "content": "These things are still solid - r/u spell deck can use a turtle that doesn't tap and pokes for one",
      "posted_by": "gourd13",
      "posted_at": "10/19/2011 4:42:33 PM",
      "rating": 10
    },
    {
      "content": "A great defensive creature for its time - it could attack and still stick around to protect you. Well costed even by today's standards.",
      "posted_by": "Radagast",
      "posted_at": "11/4/2011 10:37:48 AM",
      "rating": 10
    },
    {
      "content": "dam. This is a perfectly reasonably designed card",
      "posted_by": "Burningsickle",
      "posted_at": "2/1/2014 6:00:57 PM",
      "rating": 0
    }
  ]
}
